const s=`---
title: "เจ้าของธุรกิจ: ใช้ Google Business Messages เพื่อมีส่วนร่วมในช่วงนอกเวลาทำการ!"
metatitle: "ใช้ Google Business Messages เพื่อมีส่วนร่วมในช่วงนอกเวลาทำการ!"
date: 2022-03-29 17:58:58-07:00
modified_date: 2025-07-26T16:48:39Z
draft: false
author: Ruli Setiawati
description: "ในขณะที่โปรไฟล์ธุรกิจของ Google ช่วยให้เจ้าของธุรกิจสามารถแชทกับลูกค้าได้โดยตรง แต่ Google Business Messages ช่วยให้สามารถผสานรวมกับตัวแทนเสมือนได้"
weight: 1
tags:
  - NearMe
image: images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/thumbnail.png
canonicalURL: /blog/use-google-business-messages-off-hours/
url: /blog/use-google-business-messages-off-hours/
---

*เรียนรู้เพิ่มเติมเกี่ยวกับประโยชน์และข้อจำกัดของ Google Business Messages และวิธีที่ธุรกิจต่างๆ นำ Google Business Messages ไปใช้*

การเปิดใช้งานฟีเจอร์แชทในโปรไฟล์ธุรกิจของ Google สามารถช่วยให้คุณเชื่อมต่อกับลูกค้าได้ อย่างไรก็ตาม เมื่อลูกค้าติดต่อคุณทางแชทมากขึ้น คุณอาจไม่มีเวลาและทรัพยากรในการตอบกลับทุกแชท โดยเฉพาะอย่างยิ่งในช่วงเวลาปิดทำการ นอกจากนี้ คำถามส่วนใหญ่อาจเป็นคำถามซ้ำๆ ในขณะเดียวกัน ลูกค้าคาดหวังคำตอบทันทีจากธุรกิจ หากธุรกิจไม่ตอบสนองความต้องการของลูกค้า ก็เสี่ยงที่จะสูญเสียลูกค้าปัจจุบันและลูกค้าในอนาคต

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="ผู้บริโภครู้สึกหงุดหงิดที่ไม่ได้รับคำตอบสำหรับคำถามและต้องรอสายนานเกินไป"/>

*อะไรคือสิ่งที่ขับเคลื่อนอนาคตของการส่งข้อความในสหรัฐอเมริกา? ([ที่มา](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="การให้คะแนน 1 ดาวโดยลูกค้าที่ไม่พอใจบน Google Maps เนื่องจากขาดการสื่อสารจากเจ้าของธุรกิจ"/>

*การให้คะแนน 1 ดาวโดยลูกค้าที่ไม่พอใจเนื่องจากขาดการสื่อสารจากเจ้าของธุรกิจ*
</center>

ใน [บทความก่อนหน้าของเรา](https://seasalt.ai/blog/9-enable-chat-on-google-maps/) เราได้แนะนำวิธีหลีกเลี่ยงการพลาดข้อความจากลูกค้าด้วยฟีเจอร์การแจ้งเตือนทาง SMS ของ Google แต่เราเข้าใจดีว่าในฐานะเจ้าของธุรกิจ การตอบกลับข้อความของลูกค้าต้องใช้เวลาพอสมควร และมีสิ่งอื่นๆ อีกมากมายที่คุณต้องดูแลนอกเหนือจากการดูแลลูกค้า นั่นคือเหตุผลที่เราต้องการแนะนำให้คุณรู้จักกับ [Google Business Messages](https://businessmessages.google/)

### เกี่ยวกับ Google Business Messages

Google Business Messages เป็นประสบการณ์การสนทนายุคใหม่ที่ช่วยแก้ปัญหาในการให้คำตอบแบบเรียลไทม์แก่ลูกค้าของคุณเมื่อไม่มีมนุษย์คอยให้บริการ ในขณะที่โปรไฟล์ธุรกิจของ Google ช่วยให้เจ้าของธุรกิจสามารถแชทกับลูกค้าได้โดยตรงผ่านปุ่มแชทบน Google Maps แต่ Google Business Messages ก้าวไปอีกขั้นด้วยการเปิดใช้งานการผสานรวมกับตัวแทนเสมือน จากข้อมูลของ [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6) ตัวแทนเสมือนคือ "ตัวละครเสมือนปัญญาประดิษฐ์ที่สร้างจากคอมพิวเตอร์ มีภาพเคลื่อนไหว (โดยปกติจะมีลักษณะคล้ายมนุษย์) ซึ่งทำหน้าที่เป็นตัวแทนบริการลูกค้าออนไลน์"

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="ผู้มีอำนาจตัดสินใจทางธุรกิจเชื่อว่า Google Business Messages จะปรับปรุงการโต้ตอบกับลูกค้า"/>

*ทำให้เป็นเรื่องส่วนตัว: เครื่องมือสื่อสารอัจฉริยะขับเคลื่อนผลลัพธ์ทางธุรกิจอย่างไร ([ที่มา](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf))*
</center>

ตัวแทนเสมือนมักถูกเรียกว่าผู้ช่วยดิจิทัล ตัวแทนเสมือนใช้เทคโนโลยีที่เรียกว่า Natural Language Processing (NLP) เพื่อให้คำตอบอัตโนมัติ ตัวแทนเสมือนสามารถเป็นประโยชน์ต่อธุรกิจของคุณโดยการลดเวลาตอบสนอง ให้บริการตลอด 24 ชั่วโมงทุกวัน และปรับปรุงประสบการณ์ของลูกค้า นั่นคือวิธีที่ Google Business Messages สามารถช่วยให้คุณให้คำตอบอัตโนมัติคุณภาพสูงแก่ลูกค้าของคุณได้

ประโยชน์เพิ่มเติมของ Google Business Messages ได้แก่:
- ให้คำตอบทันทีสำหรับคำถามของลูกค้าของคุณ
- ประหยัดเวลาและเงินในการส่งมอบลูกค้าที่ยอดเยี่ยม
- สร้างความไว้วางใจกับลูกค้าของคุณ

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages ผสานรวมตัวแทนเสมือนเข้ากับปุ่มแชทบน Google Maps โดยตรง"/>

*Google Business Messages ผสานรวมตัวแทนเสมือนเข้ากับปุ่มแชทของคุณโดยตรง*
</center>

### ธุรกิจต่างๆ นำ Google Business Messages ไปใช้อย่างไร

เพื่อให้เข้าใจได้ดีขึ้นว่า Google Business Messages สามารถช่วยธุรกิจของคุณได้อย่างไร ลองดูตัวอย่างจาก Walmart, Levi's และ Albertsons Companies

#### 1. Walmart

Walmart เป็นหนึ่งในบริษัทแรกๆ ที่นำ Business Messages มาใช้ ([บล็อกของ Google](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)) ด้วย Google Business Messages ทำให้ Walmart สามารถให้ข้อมูลล่าสุดเกี่ยวกับเวลาทำการของร้านค้า ผลิตภัณฑ์ วัคซีนและการทดสอบ COVID-19 ตัวเลือกการรับและจัดส่ง นโยบายการคืนสินค้า และอื่นๆ ลูกค้าสามารถรับคำตอบได้ทันทีทุกเวลาของวัน

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="ลูกค้าสามารถติดต่อ Walmart ผ่านปุ่มแชทบน Google Maps (มือถือเท่านั้น)"/>

*ลูกค้าสามารถติดต่อ Walmart ผ่านปุ่มแชทบน Google Maps (มือถือเท่านั้น)*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="ลูกค้าสามารถถามคำถามกับตัวแทนเสมือนของ Walmart เกี่ยวกับเวลาทำการของร้านค้า ผลิตภัณฑ์ นโยบายหน้ากากอนามัย วัคซีน COVID-19 และอื่นๆ"/>

*ลูกค้าสามารถถามคำถามเกี่ยวกับเวลาทำการของร้านค้า ผลิตภัณฑ์ นโยบายหน้ากากอนามัย วัคซีน COVID-19 และอื่นๆ*
</center>

#### 2. Levi’s

Levi's เป็นบริษัทเสื้อผ้าที่รู้จักกันดีในเรื่องกางเกงยีนส์ Levi's โดยมีร้านค้าปลีก 3,100 แห่งใน 110 ประเทศ ในช่วงที่มีการระบาดใหญ่ Levi's สังเกตว่าผู้ซื้อใช้เวลาส่วนใหญ่ในการค้นคว้าข้อมูลก่อนตัดสินใจซื้อ และเวลาทำการของร้านค้าอาจเปลี่ยนแปลงบ่อยขึ้น Levi's ต้องการเปลี่ยนผู้ซื้อให้เป็นลูกค้าจริงและให้คำตอบอย่างรวดเร็วสำหรับคำถามของผู้ซื้อ

ในเดือนมิถุนายน 2020 Levi's ได้นำ Google Business Messages มาใช้โดยมีเป้าหมายเพื่อปรับปรุงประสบการณ์ของลูกค้าโดยการให้ข้อมูลล่าสุดเกี่ยวกับร้านค้าและผลิตภัณฑ์ Levi's ใช้ประโยชน์จากความสามารถของ Google Business Messages ในการช่วยเหลือลูกค้าได้ทุกเวลาของวัน และด้วยเหตุนี้จึงสามารถบรรลุคะแนนความพึงพอใจของลูกค้า (CSAT) ได้ถึง 85% Levi's ยังพบว่ามีคำถามที่เกี่ยวข้องกับร้านค้าได้รับการแก้ไขมากขึ้นถึง 30 เท่า เรียนรู้เพิ่มเติมเกี่ยวกับวิธีที่ Levi's นำ Google Business Messages ไปใช้ [ที่นี่](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf)

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="ลูกค้าสามารถติดต่อ Levi's ผ่านปุ่มแชทบน Google Maps (มือถือเท่านั้น)"/>

*ลูกค้าสามารถติดต่อ Levi's ผ่านปุ่มแชท (มือถือเท่านั้น)*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="ลูกค้าสามารถดูผลิตภัณฑ์ของ Levi's ได้เมื่อโต้ตอบกับตัวแทนเสมือนของ Levi's บน Google Maps"/>

*ลูกค้าสามารถดูผลิตภัณฑ์ของ Levi's ได้เมื่อโต้ตอบกับตัวแทนเสมือนของ Levi's*
</center>

#### 3. Albertsons Companies

Albertsons Co. เป็นเจ้าของร้านขายยาหลายแห่งทั่วสหรัฐอเมริกา รวมถึง Safeway, Jewel-Osco, Vons, Albertsons, Shaw's และอื่นๆ ในช่วงปลายปี 2020 ระหว่างการเปิดตัววัคซีน COVID-19 ครั้งแรก มีการค้นหาวัคซีนทางออนไลน์เพิ่มขึ้น มีคำถามเพิ่มเติมเกี่ยวกับคุณสมบัติในการรับวัคซีน การนัดหมาย และสถานที่ที่ผู้คนสามารถรับวัคซีนได้ Albertsons Co. ตัดสินใจเปิดใช้งาน Google Business Messages เพื่อให้ข้อมูลล่าสุดเกี่ยวกับเกณฑ์คุณสมบัติ การนัดหมาย ความพร้อมให้บริการ และอื่นๆ ด้วยเหตุนี้ พวกเขาจึงสามารถลดจำนวนสายเรียกเข้า ป้องกันข้อมูลที่อาจไม่ถูกต้อง และช่วยเหลือลูกค้าได้ตลอด 24 ชั่วโมงทุกวัน

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="ลูกค้าสามารถรับข้อมูลเกี่ยวกับคุณสมบัติในการรับวัคซีนและจองนัดหมายได้โดยตรงจากตัวแทนเสมือนของ Albertsons Co."/>

*ลูกค้าสามารถรับข้อมูลเกี่ยวกับคุณสมบัติในการรับวัคซีนและจองนัดหมายได้*
</center>

Google Business Messages เป็นวิธีที่ยอดเยี่ยมในการประหยัดเวลาและเงินในการตอบคำถามซ้ำๆ สร้างความสัมพันธ์กับลูกค้า และปรับปรุงประสบการณ์ของลูกค้าโดยรวม

### อุปสรรคในการนำไปใช้

มีข้อจำกัดหลักสองประการในการนำ Google Business Messages ไปใช้โดยทั่วไปดังที่เห็นข้างต้น

ประการแรก การสร้างและบำรุงรักษาตัวแทนเสมือนที่ยอดเยี่ยมไม่ใช่เรื่องง่าย ต้องใช้ความรู้ขั้นสูงเกี่ยวกับ AI เชิงสนทนาและเวลาในการพัฒนาที่สำคัญ ธุรกิจที่ใช้ Google Business Messages จำเป็นต้องจ่ายเงินให้หน่วยงานที่ปรึกษามืออาชีพเพื่อสร้างประสบการณ์ที่ปรับแต่งได้อย่างเต็มที่สำหรับพวกเขาตั้งแต่เริ่มต้น โดยปกติแล้วจะมีราคาแพงและอาจใช้เวลาหลายเดือน องค์กรขนาดใหญ่เช่น Levi's, Walmart และ Albertsons Companies เป็นองค์กรที่สามารถจ่ายค่าบริการพิเศษดังกล่าวได้ หน่วยงานที่ปรึกษามักจะควบคุมการพัฒนาและบำรุงรักษาผลิตภัณฑ์อย่างเต็มที่ หากคุณต้องทำการเปลี่ยนแปลง คุณต้องผ่านหน่วยงานซึ่งต้องใช้เวลาเพิ่มเติม

ประการที่สอง Google Business Messages เป็นการทดแทนความสามารถในการส่งข้อความที่มีอยู่ในโปรไฟล์ธุรกิจของ Google ในฐานะเจ้าของธุรกิจ คุณมีความสามารถในการเปิดใช้งานปุ่มแชทในโปรไฟล์ธุรกิจของ Google และตอบกลับเมื่อคุณพร้อมใช้งาน อย่างไรก็ตาม เมื่อคุณนำ Google Business Messages ไปใช้ ข้อความขาเข้าของคุณจะถูกส่งไปยังตัวแทนสดของคุณ และคุณจะสูญเสียความสามารถในการแชทกับลูกค้าโดยตรงภายในโปรไฟล์ธุรกิจของ Google หรือโดยใช้แอป Google My Business

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="โซลูชันแชทสดช่วยให้เจ้าของธุรกิจสามารถพูดคุยกับลูกค้าได้โดยตรง"/>

*หากเปิดใช้งานโซลูชันแชทสด ลูกค้าจะสามารถคลิก “ส่งข้อความถึงตัวแทนสด” เพื่อพูดคุยกับเจ้าของธุรกิจได้โดยตรง*
</center>

หากคุณยังคงต้องการพูดคุยกับลูกค้าโดยตรงในขณะที่ใช้ Google Business Messages คุณต้องขอให้หน่วยงานที่ปรึกษาจัดหาโซลูชันแชทสด หากเปิดใช้งานฟีเจอร์นี้ ลูกค้าสามารถคลิกปุ่ม “ส่งข้อความถึงตัวแทนสด” จากนั้นคุณจะสามารถเข้าร่วมการสนทนาและแชทกับลูกค้าได้ ในฝั่งของตัวแทนสด การสนทนาจะเกิดขึ้นบนแพลตฟอร์มใดก็ตามที่หน่วยงานที่ปรึกษาเลือกที่จะผสานรวมด้วย ซึ่งอาจเป็นผ่านข้อความ, WhatsApp, Messenger, ซอฟต์แวร์บริการลูกค้าที่มีอยู่เช่น Zendesk หรือเว็บไซต์หรือแอปโทรศัพท์ที่สร้างขึ้นเอง

นั่นคือเหตุผลที่เราต้องการแนะนำให้คุณรู้จักกับโซลูชันของเรา Near Me Messaging (อัปเดต: เราได้เปลี่ยนผลิตภัณฑ์ให้เป็นเครื่องมือสร้างแชทบอทแบบ omni-channel แล้ว ตอนนี้เรียกว่า [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!) ซึ่งให้การนำ Google Business Messages ไปใช้ในราคาประหยัด รวดเร็ว และง่ายดายสำหรับ SME ที่มีความสามารถในการปรับแต่งได้อย่างเต็มที่ บริการตนเอง และแชทสด คอยติดตามโพสต์ถัดไปของเราเกี่ยวกับ Near Me Messaging และคุณสมบัติพิเศษของมัน [จองการสาธิตกับเรา](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) และเป็นคนแรกที่ใช้ Near Me Messaging!
`;export{s as default};
