const s=`---
title: "வணிக உரிமையாளர்களே: வேலை நேரத்திற்குப் பிறகும் வாடிக்கையாளர்களுடன் ஈடுபட Google Business Messages-ஐப் பயன்படுத்துங்கள்!"
metatitle: "வேலை நேரத்திற்குப் பிறகும் வாடிக்கையாளர்களுடன் ஈடுபட Google Business Messages-ஐப் பயன்படுத்துங்கள்!"
date: 2022-03-29 17:58:58-07:00
modified_date: 2025-07-26T16:48:39Z
draft: false
author: Ruli Setiawati
description: "Google Business Profile வணிக உரிமையாளர்களை வாடிக்கையாளர்களுடன் நேரடியாக அரட்டை அடிக்க அனுமதிக்கும் அதே வேளையில், Google Business Messages ஒரு மெய்நிகர் முகவருடன் ஒருங்கிணைக்க உதவுகிறது."
weight: 1
tags:
  - NearMe
image: images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/thumbnail.png
canonicalURL: /blog/use-google-business-messages-off-hours/
url: /blog/use-google-business-messages-off-hours/
---

*Google Business Messages-இன் நன்மைகள் மற்றும் வரம்புகள் மற்றும் வணிகங்கள் Google Business Messages-ஐ எவ்வாறு செயல்படுத்துகின்றன என்பதைப் பற்றி மேலும் அறிக.*

உங்கள் Google Business Profile-இல் அரட்டை அம்சத்தை இயக்குவது உங்கள் வாடிக்கையாளர்களுடன் இணைய உதவும். இருப்பினும், வாடிக்கையாளர்கள் உங்களை அரட்டையில் அதிகமாக அணுகும்போது, ஒவ்வொரு அரட்டைக்கும் பதிலளிக்க உங்களுக்கு நேரமும் வளங்களும் இல்லாமல் இருக்கலாம், குறிப்பாக மூடிய நேரங்களில். மேலும், பெரும்பாலான விசாரணைகள் மீண்டும் மீண்டும் வரலாம். அதே நேரத்தில், வாடிக்கையாளர்கள் வணிகங்களிடமிருந்து உடனடி பதில்களை எதிர்பார்க்கிறார்கள். வணிகங்கள் தங்கள் வாடிக்கையாளர்களின் தேவைகளைப் பூர்த்தி செய்யாவிட்டால், தற்போதுள்ள மற்றும் சாத்தியமான வாடிக்கையாளர்களை இழக்கும் அபாயம் உள்ளது.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="நுகர்வோர் தங்கள் கேள்விகளுக்கு பதிலளிக்கப்படாததாலும், நீண்ட நேரம் காத்திருப்பதாலும் விரக்தியடைந்துள்ளனர்"/>

*அமெரிக்காவில் செய்தி அனுப்புதலின் எதிர்காலத்தை எது இயக்குகிறது? ([ஆதாரம்](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="ஒரு வணிக உரிமையாளரின் தகவல் தொடர்பு இல்லாததால் Google Maps-இல் ஒரு வருத்தமான வாடிக்கையாளரின் 1-நட்சத்திர மதிப்பீடு."/>

*ஒரு வணிக உரிமையாளரின் தகவல் தொடர்பு இல்லாததால் ஒரு வருத்தமான வாடிக்கையாளரின் 1-நட்சத்திர மதிப்பீடு.*
</center>

[எங்கள் முந்தைய கட்டுரையில்](https://seasalt.ai/blog/9-enable-chat-on-google-maps/), Google-இன் SMS எச்சரிக்கை அம்சத்துடன் வாடிக்கையாளர் செய்திகளைத் தவறவிடுவதைத் தவிர்ப்பது எப்படி என்பதை நாங்கள் உங்களுக்கு விளக்கினோம். ஆனால் வணிக உரிமையாளர்களாக, வாடிக்கையாளர் செய்திகளுக்கு பதிலளிப்பது கணிசமான நேரத்தை எடுக்கும் என்பதை நாங்கள் புரிந்துகொள்கிறோம், மேலும் வாடிக்கையாளர் சேவையைத் தவிர நீங்கள் கவனிக்க வேண்டிய பல விஷயங்கள் உள்ளன. அதனால்தான் நாங்கள் உங்களை [Google Business Messages](https://businessmessages.google/)-க்கு அறிமுகப்படுத்த விரும்புகிறோம்.

### Google Business Messages பற்றி

Google Business Messages என்பது அடுத்த தலைமுறை உரையாடல் அனுபவமாகும், இது ஒரு மனிதன் கிடைக்காதபோது உங்கள் வாடிக்கையாளர்களுக்கு நிகழ்நேர பதில்களை வழங்கும் சிக்கலைத் தீர்க்கிறது. Google Business Profile வணிக உரிமையாளர்களை Google Maps-இல் உள்ள அரட்டை பொத்தான் வழியாக வாடிக்கையாளர்களுடன் நேரடியாக அரட்டை அடிக்க அனுமதிக்கும் அதே வேளையில், Google Business Messages ஒரு மெய்நிகர் முகவருடன் ஒருங்கிணைப்பை இயக்குவதன் மூலம் அதை ஒரு படி மேலே கொண்டு செல்கிறது. [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6) படி, ஒரு மெய்நிகர் முகவர் என்பது "ஒரு கணினியால் உருவாக்கப்பட்ட, அனிமேஷன் செய்யப்பட்ட, செயற்கை நுண்ணறிவு மெய்நிகர் பாத்திரம் (பொதுவாக மானுடவியல் தோற்றத்துடன்) இது ஒரு ஆன்லைன் வாடிக்கையாளர் சேவை பிரதிநிதியாக செயல்படுகிறது".

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="வணிக முடிவெடுப்பவர்கள் Google-இன் வணிகச் செய்திகள் வாடிக்கையாளர்களுடனான தொடர்புகளை மேம்படுத்தும் என்று நம்புகிறார்கள்"/>

*அதை தனிப்பட்டதாக்குதல்: ஸ்மார்ட் தகவல் தொடர்பு கருவிகள் வணிக முடிவுகளை எவ்வாறு இயக்குகின்றன ([ஆதாரம்](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>

ஒரு மெய்நிகர் முகவர் பெரும்பாலும் டிஜிட்டல் உதவியாளர் என்று குறிப்பிடப்படுகிறார். மெய்நிகர் முகவர்கள் தானியங்கு பதில்களை வழங்க இயற்கை மொழி செயலாக்கம் (NLP) எனப்படும் தொழில்நுட்பத்தைப் பயன்படுத்துகின்றனர். மெய்நிகர் முகவர்கள் உங்கள் வணிகத்திற்கு பதிலளிக்கும் நேரத்தைக் குறைப்பதன் மூலமும், 24/7 கிடைப்பதை வழங்குவதன் மூலமும், வாடிக்கையாளர் அனுபவத்தை மேம்படுத்துவதன் மூலமும் பயனளிக்க முடியும். Google Business Messages உங்கள் வாடிக்கையாளர்களுக்கு உயர்தர தானியங்கு பதில்களை வழங்க உதவுவது இப்படித்தான்.

Google Business Messages-இன் கூடுதல் நன்மைகள் பின்வருமாறு:
- உங்கள் வாடிக்கையாளர்களின் விசாரணைகளுக்கு உடனடி பதில்களை வழங்குங்கள்
- சிறந்த வாடிக்கையாளரை வழங்குவதில் நேரத்தையும் பணத்தையும் மிச்சப்படுத்துங்கள்
- உங்கள் வாடிக்கையாளர்களுடன் நம்பிக்கையை உருவாக்குங்கள்

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages ஒரு மெய்நிகர் முகவரை நேரடியாக Google Maps-இல் உள்ள அரட்டை பொத்தானில் ஒருங்கிணைக்கிறது"/>

*Google Business Messages உங்கள் அரட்டை பொத்தானில் நேரடியாக ஒரு மெய்நிகர் முகவரை ஒருங்கிணைக்கிறது.*
</center>

### வணிகங்கள் Google Business Messages-ஐ எவ்வாறு செயல்படுத்துகின்றன

Google Business Messages உங்கள் வணிகத்திற்கு எவ்வாறு உதவக்கூடும் என்பதைப் பற்றிய சிறந்த புரிதலை வழங்க, வால்மார்ட், லெவிஸ் மற்றும் ஆல்பர்ட்சன்ஸ் நிறுவனங்களின் சில எடுத்துக்காட்டுகளைப் பார்ப்போம்.

#### 1. வால்மார்ட்

வால்மார்ட் வணிகச் செய்திகளைச் செயல்படுத்திய முதல் நிறுவனங்களில் ஒன்றாகும் ([Google Blog](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). Google Business Messages மூலம், வால்மார்ட் கடை நேரம், தயாரிப்புகள், COVID-19 தடுப்பூசி மற்றும் சோதனை, பிக்-அப் மற்றும் டெலிவரி விருப்பங்கள், ரிட்டர்ன் பாலிசி மற்றும் பலவற்றைப் பற்றிய புதுப்பித்த தகவல்களை வழங்குகிறது. வாடிக்கையாளர்கள் நாளின் எந்த நேரத்திலும் உடனடி பதில்களைப் பெறலாம்.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="வாடிக்கையாளர்கள் Google Maps-இல் (மொபைல் மட்டும்) அரட்டை பொத்தான் வழியாக வால்மார்ட்டைத் தொடர்பு கொள்ளலாம்"/>

*வாடிக்கையாளர்கள் Google Maps-இல் (மொபைல் மட்டும்) அரட்டை பொத்தான் வழியாக வால்மார்ட்டைத் தொடர்பு கொள்ளலாம்.*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="வாடிக்கையாளர்கள் வால்மார்ட்டின் மெய்நிகர் முகவரிடம் கடை நேரம், தயாரிப்புகள், முகக்கவசம் கொள்கை, COVID-19 தடுப்பூசி மற்றும் பலவற்றைப் பற்றி கேள்விகளைக் கேட்கலாம்"/>

*வாடிக்கையாளர்கள் கடை நேரம், தயாரிப்புகள், முகக்கவசம் கொள்கை, COVID-19 தடுப்பூசி மற்றும் பலவற்றைப் பற்றி கேள்விகளைக் கேட்கலாம்.*
</center>

#### 2. லெவிஸ்

லெவிஸ் என்பது அதன் லெவிஸ் டெனிம் ஜீன்ஸுக்கு பெயர் பெற்ற ஒரு ஆடை நிறுவனமாகும், இது 110 நாடுகளில் 3,100 சில்லறை விற்பனைக் கடைகளைக் கொண்டுள்ளது. தொற்றுநோய்களின் போது, கடைக்காரர்கள் வாங்குவதற்கு முந்தைய ஆராய்ச்சியில் கணிசமான நேரத்தை செலவிடுவதையும், கடை நேரம் அடிக்கடி மாறக்கூடும் என்பதையும் லெவிஸ் கவனித்தது. லெவிஸ் கடைக்காரர்களை உண்மையான வாடிக்கையாளர்களாக மாற்றவும், கடைக்காரர்களின் விசாரணைகளுக்கு விரைவான பதில்களை வழங்கவும் விரும்பியது.

ஜூன் 2020-இல், லெவிஸ் கடைகள் மற்றும் தயாரிப்புகள் பற்றிய புதுப்பித்த தகவல்களை வழங்குவதன் மூலம் வாடிக்கையாளர் அனுபவத்தை மேம்படுத்தும் நோக்கத்துடன் Google Business Messages-ஐச் செயல்படுத்தியது. லெவிஸ் நாளின் எந்த நேரத்திலும் வாடிக்கையாளர்களுக்கு உதவ Google Business Messages-இன் திறனைப் பயன்படுத்தியது, இதன் விளைவாக, 85% வாடிக்கையாளர் திருப்தி (CSAT) மதிப்பெண்களை அடைய முடிந்தது. கடை தொடர்பான 30 மடங்கு அதிகமான கேள்விகள் தீர்க்கப்பட்டதையும் லெவிஸ் கண்டது. லெவிஸ் Google Business Messages-ஐ எவ்வாறு செயல்படுத்தியது என்பது பற்றி மேலும் அறிக [இங்கே](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf).

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="வாடிக்கையாளர்கள் Google Maps-இல் (மொபைல் மட்டும்) அரட்டை பொத்தான் வழியாக லெவிஸைத் தொடர்பு கொள்ளலாம்"/>

*வாடிக்கையாளர்கள் அரட்டை பொத்தான் (மொபைல் மட்டும்) வழியாக லெவிஸைத் தொடர்பு கொள்ளலாம்.*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="வாடிக்கையாளர்கள் Google Maps-இல் லெவிஸின் மெய்நிகர் முகவருடன் தொடர்பு கொள்ளும்போது லெவிஸின் தயாரிப்புகளைப் பார்க்கலாம்"/>

*வாடிக்கையாளர்கள் லெவிஸின் மெய்நிகர் முகவருடன் தொடர்பு கொள்ளும்போது லெவிஸின் தயாரிப்புகளைப் பார்க்கலாம்.*
</center>

#### 3. ஆல்பர்ட்சன்ஸ் நிறுவனங்கள்

ஆல்பர்ட்சன்ஸ் நிறுவனம் சேஃப்வே, ஜுவல்-ஓஸ்கோ, வான்ஸ், ஆல்பர்ட்சன்ஸ், ஷாஸ் மற்றும் பலவற்றை உள்ளடக்கிய அமெரிக்கா முழுவதும் பல மருந்தகங்களை வைத்திருக்கிறது. 2020-இன் பிற்பகுதியில், COVID-19 தடுப்பூசிகளின் ஆரம்ப வெளியீட்டின் போது, தடுப்பூசிகளுக்கான ஆன்லைன் தேடல்களில் அதிகரிப்பு ஏற்பட்டது. தடுப்பூசி தகுதி, சந்திப்புகள் மற்றும் மக்கள் தடுப்பூசிகளை எங்கே பெறலாம் என்பது பற்றி அதிகமான கேள்விகள் இருந்தன. ஆல்பர்ட்சன்ஸ் நிறுவனம் தகுதி வரம்புகள், சந்திப்புகள், கிடைக்கும் தன்மை மற்றும் பலவற்றைப் பற்றிய புதுப்பித்த தகவல்களை வழங்க Google Business Messages-ஐச் செயல்படுத்த முடிவு செய்தது. இதன் விளைவாக, அவர்களால் உள்வரும் அழைப்புகளின் எண்ணிக்கையைக் குறைக்கவும், சாத்தியமான தவறான தகவல்களைத் தடுக்கவும், வாடிக்கையாளர்களுக்கு 24/7 உதவவும் முடிந்தது.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="வாடிக்கையாளர்கள் தடுப்பூசி தகுதி பற்றிய தகவல்களைப் பெறலாம் மற்றும் ஆல்பர்ட்சன்ஸ் நிறுவனத்தின் மெய்நிகர் முகவரிடமிருந்து நேரடியாக ஒரு சந்திப்பை பதிவு செய்யலாம்"/>

*வாடிக்கையாளர்கள் தடுப்பூசி தகுதி பற்றிய தகவல்களைப் பெறலாம் மற்றும் ஒரு சந்திப்பை பதிவு செய்யலாம்.*
</center>

Google Business Messages மீண்டும் மீண்டும் வரும் விசாரணைகளுக்கு பதிலளிப்பதில் நேரத்தையும் பணத்தையும் மிச்சப்படுத்தவும், வாடிக்கையாளர்களுடன் உறவுகளை உருவாக்கவும், ஒட்டுமொத்த வாடிக்கையாளர் அனுபவத்தை மேம்படுத்தவும் ஒரு சிறந்த வழியாகும்.

### செயல்படுத்துவதற்கான தடைகள்

மேலே காணப்பட்டபடி Google Business Messages-இன் பொதுவான செயல்பாட்டில் இரண்டு முக்கிய வரம்புகள் உள்ளன.

முதலாவதாக, ஒரு சிறந்த மெய்நிகர் முகவரை உருவாக்குவதும் பராமரிப்பதும் ஒரு எளிய பணி அல்ல; இதற்கு உரையாடல் AI-இன் மேம்பட்ட அறிவு மற்றும் குறிப்பிடத்தக்க வளர்ச்சி நேரம் தேவைப்படுகிறது. Google Business Messages-ஐப் பயன்படுத்தும் வணிகங்கள் ஒரு தொழில்முறை ஆலோசனை நிறுவனத்திற்கு பணம் செலுத்த வேண்டும், அவர்களுக்காக ஒரு முழுமையான தனிப்பயனாக்கப்பட்ட அனுபவத்தை புதிதாக உருவாக்க வேண்டும். இவை பொதுவாக விலை உயர்ந்தவை மற்றும் மாதங்கள் ஆகலாம். லெவிஸ், வால்மார்ட் மற்றும் ஆல்பர்ட்சன்ஸ் நிறுவனங்கள் போன்ற பெரிய நிறுவனங்கள் அத்தகைய சிறப்பு சேவையை வாங்கக்கூடியவை. ஆலோசனை நிறுவனம் பொதுவாக தயாரிப்பின் வளர்ச்சி மற்றும் பராமரிப்பில் முழுமையான கட்டுப்பாட்டைக் கொண்டுள்ளது. நீங்கள் மாற்றங்களைச் செய்ய வேண்டுமானால், நீங்கள் ஏஜென்சி வழியாகச் செல்ல வேண்டும், இது கூடுதல் நேரத்தை எடுக்கும்.

இரண்டாவதாக, Google Business Messages என்பது Google Business Profile-இல் கட்டமைக்கப்பட்ட செய்தி அனுப்பும் திறனுக்கான மாற்றாகும். வணிக உரிமையாளர்களாக, Google Business Profiles-இல் அரட்டை பொத்தானை இயக்கி, நீங்கள் கிடைக்கும்போதெல்லாம் பதிலளிக்கும் திறன் உங்களுக்கு உள்ளது. இருப்பினும், நீங்கள் Google Business Messages-ஐச் செயல்படுத்தும்போது, உங்கள் உள்வரும் செய்திகள் உங்கள் நேரடி முகவருக்கு அனுப்பப்படும், மேலும் Google Business Profile-இல் அல்லது Google My Business பயன்பாட்டைப் பயன்படுத்தி வாடிக்கையாளர்களுடன் நேரடியாக அரட்டை அடிக்கும் திறனை நீங்கள் இழக்கிறீர்கள்.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="நேரடி-அரட்டை தீர்வு வணிக உரிமையாளர்களை வாடிக்கையாளர்களுடன் நேரடியாகப் பேச அனுமதிக்கிறது"/>

*நேரடி-அரட்டை தீர்வு இயக்கப்பட்டால், வாடிக்கையாளர்கள் வணிக உரிமையாளர்களுடன் நேரடியாகப் பேச “நேரடி முகவருக்கு செய்தி அனுப்பு” என்பதைக் கிளிக் செய்ய முடியும்.*
</center>

Google Business Messages-ஐப் பயன்படுத்தும்போது உங்கள் வாடிக்கையாளர்களுடன் நேரடியாகப் பேச விரும்பினால், நேரடி-அரட்டை தீர்வை வழங்க ஆலோசனை நிறுவனத்திடம் கேட்க வேண்டும். இந்த அம்சம் இயக்கப்பட்டால், வாடிக்கையாளர்கள் “நேரடி முகவருக்கு செய்தி அனுப்பு” பொத்தானைக் கிளிக் செய்யலாம், பின்னர் நீங்கள் உரையாடலில் சேர்ந்து வாடிக்கையாளருடன் அரட்டை அடிக்க முடியும். நேரடி முகவரின் பக்கத்திலிருந்து, உரையாடல்கள் ஆலோசனை நிறுவனம் ஒருங்கிணைக்கத் தேர்ந்தெடுத்த எந்த தளத்திலும் நடைபெறும்; இது உரை, வாட்ஸ்அப், மெசஞ்சர், ஜெண்டெஸ்க் போன்ற ஏற்கனவே உள்ள வாடிக்கையாளர் சேவை மென்பொருள் அல்லது தனிப்பயனாக்கப்பட்ட வலைத்தளம் அல்லது தொலைபேசி பயன்பாடு வழியாக இருக்கலாம்.

அதனால்தான் நாங்கள் எங்கள் தீர்வான Near Me Messaging-ஐ உங்களுக்கு அறிமுகப்படுத்த விரும்புகிறோம் (புதுப்பிப்பு: நாங்கள் இப்போது தயாரிப்பை ஒரு ஓம்னி-சேனல் சாட்போட் பில்டராக மாற்றியுள்ளோம். இப்போது [SeaChat](https://chat.seasalt.ai/?utm_source=blog) என்று அழைக்கப்படுகிறது!), இது முழுமையாக தனிப்பயனாக்கக்கூடிய, சுய-சேவை மற்றும் நேரடி-அரட்டை திறன்களுடன் SME-களுக்கு Google Business Messages-இன் மலிவு, வேகமான மற்றும் எளிதான செயல்பாட்டை வழங்குகிறது. Near Me Messaging மற்றும் அதன் விதிவிலக்கான அம்சங்களைப் பற்றிய எங்கள் அடுத்த இடுகைக்கு காத்திருங்கள். [எங்களுடன் ஒரு டெமோவை முன்பதிவு செய்யுங்கள்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) மற்றும் Near Me Messaging-ஐப் பயன்படுத்தும் முதல் நபராக இருங்கள்!
`;export{s as default};
