const s=`---
title: "صاحبان کسب و کار: از پیام های تجاری گوگل برای تعامل در ساعات غیر کاری استفاده کنید!"
metatitle: "از پیام های تجاری گوگل برای تعامل در ساعات غیر کاری استفاده کنید!"
date: 2022-03-29 17:58:58-07:00
modified_date: 2025-07-26T16:48:39Z
draft: false
author: Ruli Setiawati
description: "در حالی که نمایه کسب و کار گوگل به صاحبان کسب و کار اجازه می دهد مستقیماً با مشتریان چت کنند، پیام های تجاری گوگل امکان ادغام با یک نماینده مجازی را فراهم می کند."
weight: 1
tags:
  - NearMe
image: images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/thumbnail.png
canonicalURL: /blog/use-google-business-messages-off-hours/
url: /blog/use-google-business-messages-off-hours/
---

*درباره مزایا و محدودیت های پیام های تجاری گوگل و نحوه پیاده سازی پیام های تجاری گوگل توسط کسب و کارها بیشتر بدانید.*

فعال کردن ویژگی چت در نمایه کسب و کار گوگل می تواند به شما در ارتباط با مشتریان کمک کند. با این حال، با افزایش تماس مشتریان با شما از طریق چت، ممکن است وقت و منابع لازم برای پاسخگویی به هر چت را نداشته باشید، به خصوص در ساعات تعطیلی. علاوه بر این، بیشتر سوالات می توانند تکراری باشند. در عین حال، مشتریان انتظار پاسخ های فوری از کسب و کارها را دارند. اگر کسب و کارها نیازهای مشتریان خود را برآورده نکنند، در معرض خطر از دست دادن مشتریان فعلی و بالقوه خود قرار می گیرند.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="مصرف کنندگان از اینکه به سوالاتشان پاسخ داده نمی شود و برای مدت طولانی در حالت انتظار گیر می کنند، ناامید هستند"/>

*چه چیزی آینده پیام رسانی در ایالات متحده را هدایت می کند؟ ([منبع](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="امتیاز 1 ستاره توسط یک مشتری ناراضی در نقشه های گوگل به دلیل عدم ارتباط توسط صاحب کسب و کار."/>

*امتیاز 1 ستاره توسط یک مشتری ناراضی به دلیل عدم ارتباط توسط صاحب کسب و کار.*
</center>

در [مقاله قبلی ما](https://seasalt.ai/blog/9-enable-chat-on-google-maps/)، ما شما را با نحوه جلوگیری از از دست دادن پیام های مشتری با ویژگی هشدار پیامکی گوگل راهنمایی کردیم. اما ما درک می کنیم که به عنوان صاحبان کسب و کار، پاسخگویی به پیام های مشتری زمان قابل توجهی را می طلبد و چیزهای دیگری نیز وجود دارد که باید فراتر از مراقبت از مشتری به آنها رسیدگی کنید. به همین دلیل است که می خواهیم شما را با [پیام های تجاری گوگل](https://businessmessages.google/) آشنا کنیم.

### درباره پیام های تجاری گوگل

پیام های تجاری گوگل یک تجربه مکالمه نسل بعدی است که مشکل ارائه پاسخ های آنی به مشتریان شما را در زمانی که یک انسان در دسترس نیست حل می کند. در حالی که نمایه کسب و کار گوگل به صاحبان کسب و کار اجازه می دهد مستقیماً با مشتریان از طریق دکمه چت در نقشه های گوگل چت کنند، پیام های تجاری گوگل با فعال کردن ادغام با یک نماینده مجازی یک قدم فراتر می رود. به گفته [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6)، یک نماینده مجازی "یک شخصیت مجازی متحرک، تولید شده توسط کامپیوتر و هوش مصنوعی (معمولاً با ظاهری انسان نما) است که به عنوان یک نماینده خدمات مشتری آنلاین عمل می کند".

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="تصمیم گیرندگان تجاری معتقدند پیام های تجاری گوگل تعامل با مشتریان را بهبود می بخشد"/>

*شخصی سازی آن: چگونه ابزارهای ارتباطی هوشمند نتایج تجاری را هدایت می کنند ([منبع](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>

یک نماینده مجازی اغلب به عنوان دستیار دیجیتال شناخته می شود. نمایندگان مجازی از فناوری به نام پردازش زبان طبیعی (NLP) برای ارائه پاسخ های خودکار استفاده می کنند. نمایندگان مجازی می توانند با کاهش زمان پاسخگویی، ارائه در دسترس بودن 24/7 و بهبود تجربه مشتری برای کسب و کار شما مفید باشند. اینگونه است که پیام های تجاری گوگل می تواند به شما در ارائه پاسخ های خودکار با کیفیت بالا به مشتریان کمک کند.

مزایای اضافی پیام های تجاری گوگل عبارتند از:
- ارائه پاسخ های فوری به سوالات مشتریان شما
- صرفه جویی در وقت و هزینه در ارائه خدمات عالی به مشتریان
- ایجاد اعتماد با مشتریان خود

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="پیام های تجاری گوگل یک نماینده مجازی را مستقیماً در دکمه چت در نقشه های گوگل ادغام می کند"/>

*پیام های تجاری گوگل یک نماینده مجازی را مستقیماً در دکمه چت شما ادغام می کند.*
</center>

### نحوه پیاده سازی پیام های تجاری گوگل توسط کسب و کارها

برای درک بهتر اینکه چگونه پیام های تجاری گوگل می تواند به کسب و کار شما کمک کند، بیایید به چند نمونه از والمارت، لیوایز و شرکت های آلبرتسونز نگاهی بیندازیم.

#### 1. والمارت

والمارت از اولین شرکت هایی است که پیام های تجاری را پیاده سازی کرده است ([وبلاگ گوگل](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). با پیام های تجاری گوگل، والمارت اطلاعات به روزی در مورد ساعات کاری فروشگاه، محصولات، واکسن و آزمایش کووید-19، گزینه های تحویل و تحویل، سیاست بازگشت و موارد دیگر ارائه می دهد. مشتریان می توانند در هر زمانی از روز پاسخ های فوری دریافت کنند.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="مشتریان می توانند از طریق دکمه چت در نقشه های گوگل (فقط تلفن همراه) با والمارت تماس بگیرند"/>

*مشتریان می توانند از طریق دکمه چت در نقشه های گوگل (فقط تلفن همراه) با والمارت تماس بگیرند.*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="مشتریان می توانند از نماینده مجازی والمارت در مورد ساعات کاری فروشگاه، محصولات، سیاست ماسک، واکسن کووید-19 و موارد دیگر سوال کنند"/>

*مشتریان می توانند در مورد ساعات کاری فروشگاه، محصولات، سیاست ماسک، واکسن کووید-19 و موارد دیگر سوال کنند.*
</center>

#### 2. لیوایز

لیوایز یک شرکت پوشاک است که به خاطر شلوار جین لیوایز خود شناخته شده است و دارای 3100 فروشگاه خرده فروشی در 110 کشور است. در طول همه گیری، لیوایز مشاهده کرد که خریداران زمان قابل توجهی را صرف تحقیقات پیش از خرید می کنند و ساعات کاری فروشگاه ها می تواند بیشتر تغییر کند. لیوایز می خواست خریداران را به مشتریان واقعی تبدیل کند و پاسخ های سریع به سوالات خریداران ارائه دهد.

در ژوئن 2020، لیوایز پیام های تجاری گوگل را با هدف بهبود تجربه مشتری با ارائه اطلاعات به روز در مورد فروشگاه ها و محصولات پیاده سازی کرد. لیوایز از توانایی پیام های تجاری گوگل برای کمک به مشتریان در هر زمانی از روز استفاده کرد و در نتیجه توانست به امتیازات رضایت مشتری (CSAT) 85٪ دست یابد. لیوایز همچنین مشاهده کرد که 30 برابر بیشتر سوالات مربوط به فروشگاه حل شده است. درباره نحوه پیاده سازی پیام های تجاری گوگل توسط لیوایز [اینجا](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf) بیشتر بدانید.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="مشتریان می توانند از طریق دکمه چت در نقشه های گوگل (فقط تلفن همراه) با لیوایز تماس بگیرند"/>

*مشتریان می توانند از طریق دکمه چت (فقط تلفن همراه) با لیوایز تماس بگیرند.*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="مشتریان می توانند محصولات لیوایز را هنگام تعامل با نماینده مجازی لیوایز در نقشه های گوگل مشاهده کنند"/>

*مشتریان می توانند محصولات لیوایز را هنگام تعامل با نماینده مجازی لیوایز مشاهده کنند.*
</center>

#### 3. شرکت های آلبرتسونز

شرکت آلبرتسونز صاحب چندین داروخانه در سراسر ایالات متحده از جمله سیف وی، جول-اسکو، وانز، آلبرتسونز، شاز و غیره است. در اواخر سال 2020، در طول انتشار اولیه واکسن های کووید-19، افزایش جستجوهای آنلاین برای واکسن ها وجود داشت. سوالات بیشتری در مورد واجد شرایط بودن واکسن، قرار ملاقات ها و اینکه مردم از کجا می توانند واکسن دریافت کنند وجود داشت. شرکت آلبرتسونز تصمیم گرفت پیام های تجاری گوگل را برای ارائه اطلاعات به روز در مورد معیارهای واجد شرایط بودن، قرار ملاقات ها، در دسترس بودن و موارد دیگر فعال کند. در نتیجه، آنها توانستند تعداد تماس های ورودی را کاهش دهند، از اطلاعات نادرست احتمالی جلوگیری کنند و به مشتریان 24/7 کمک کنند.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="مشتریان می توانند اطلاعاتی در مورد واجد شرایط بودن واکسن دریافت کنند و مستقیماً از نماینده مجازی شرکت آلبرتسونز وقت رزرو کنند"/>

*مشتریان می توانند اطلاعاتی در مورد واجد شرایط بودن واکسن دریافت کنند و وقت رزرو کنند.*
</center>

پیام های تجاری گوگل یک راه عالی برای صرفه جویی در وقت و هزینه در پاسخ به سوالات تکراری، ایجاد روابط با مشتریان و بهبود تجربه کلی مشتری است.

### موانع پیاده سازی

دو محدودیت اصلی در پیاده سازی رایج پیام های تجاری گوگل همانطور که در بالا مشاهده شد وجود دارد.

اول از همه، ایجاد و نگهداری یک نماینده مجازی عالی کار ساده ای نیست؛ این امر مستلزم دانش پیشرفته هوش مصنوعی مکالمه ای و زمان توسعه قابل توجهی است. کسب و کارهایی که از پیام های تجاری گوگل استفاده می کنند باید به یک آژانس مشاوره حرفه ای پول بپردازند تا یک تجربه کاملاً سفارشی برای آنها از ابتدا ایجاد کند. اینها معمولاً گران هستند و می توانند ماه ها طول بکشند. شرکت های بزرگی مانند لیوایز، والمارت و شرکت های آلبرتسونز کسانی هستند که می توانند از چنین خدمات ویژه ای بهره مند شوند. آژانس مشاوره معمولاً کنترل کامل توسعه و نگهداری محصول را نیز در دست دارد. اگر مجبور به ایجاد تغییرات باشید، باید از طریق آژانس اقدام کنید و این کار زمان اضافی می برد.

دوم از همه، پیام های تجاری گوگل جایگزینی برای قابلیت پیام رسانی داخلی نمایه کسب و کار گوگل است. به عنوان صاحبان کسب و کار، شما این امکان را دارید که دکمه چت را در نمایه های کسب و کار گوگل فعال کنید و هر زمان که در دسترس بودید پاسخ دهید. با این حال، هنگامی که پیام های تجاری گوگل را پیاده سازی می کنید، پیام های ورودی شما به نماینده زنده شما هدایت می شود و شما توانایی چت مستقیم با مشتریان را در نمایه کسب و کار گوگل یا با استفاده از برنامه Google My Business از دست می دهید.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="راه حل چت زنده به صاحبان کسب و کار اجازه می دهد مستقیماً با مشتریان صحبت کنند"/>

*اگر راه حل چت زنده فعال باشد، مشتریان می توانند روی «پیام به یک نماینده زنده» کلیک کنند تا مستقیماً با صاحبان کسب و کار صحبت کنند.*
</center>

اگر هنوز می خواهید در حین استفاده از پیام های تجاری گوگل مستقیماً با مشتریان خود صحبت کنید، باید از آژانس مشاوره بخواهید که یک راه حل چت زنده ارائه دهد. اگر این ویژگی فعال باشد، مشتریان می توانند روی دکمه «پیام به یک نماینده زنده» کلیک کنند و سپس شما می توانید به مکالمه بپیوندید و با مشتری چت کنید. از طرف نماینده زنده، مکالمات در هر پلتفرمی که آژانس مشاوره برای ادغام با آن انتخاب کرده است، انجام می شود؛ این می تواند از طریق متن، واتس اپ، مسنجر، یک نرم افزار خدمات مشتری موجود مانند زندسک یا یک وب سایت یا برنامه تلفن سفارشی باشد.

به همین دلیل است که می خواهیم شما را با راه حل خود، Near Me Messaging (به روز رسانی: ما از آن زمان محصول را به یک سازنده چت بات همه کاناله تبدیل کرده ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می شود!)، که یک پیاده سازی مقرون به صرفه، سریع و آسان از پیام های تجاری گوگل را برای شرکت های کوچک و متوسط با قابلیت های کاملاً قابل تنظیم، خود سرویس و چت زنده ارائه می دهد، آشنا کنیم. منتظر پست بعدی ما در مورد Near Me Messaging و ویژگی های استثنایی آن باشید. [یک نسخه نمایشی با ما رزرو کنید](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) و اولین کسی باشید که از Near Me Messaging استفاده می کند!
`;export{s as default};
