const s=`---
title: "Владельцы бизнеса: Используйте Google Business Messages для взаимодействия с клиентами в нерабочее время!"
metatitle: "Используйте Google Business Messages для взаимодействия с клиентами в нерабочее время!"
date: 2022-03-29 17:58:58-07:00
modified_date: 2025-01-27T10:30:00Z
draft: false
author: Ruli Setiawati
description: "Хотя Google Business Profile позволяет владельцам бизнеса общаться напрямую с клиентами, Google Business Messages позволяет интегрировать виртуальное обслуживание клиентов."
weight: 1
tags:
  - NearMe
image: images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/thumbnail.png
canonicalURL: /blog/use-google-business-messages-off-hours/
url: /blog/use-google-business-messages-off-hours/
---

*Узнайте больше о преимуществах и ограничениях Google Business Messages и о том, как компании внедряют Google Business Messages.*

Включение чата в вашем Google Business Profile может помочь вам связаться с клиентами. Однако по мере того, как клиенты все чаще обращаются к вам через чат, у вас может не быть времени и ресурсов для ответа на каждый чат, особенно в нерабочее время. Кроме того, большинство запросов могут быть повторяющимися. Между тем клиенты ожидают мгновенных ответов от компаний. Если компании не удовлетворяют потребности клиентов, они рискуют потерять существующих и потенциальных клиентов.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="Потребители чувствуют разочарование, когда их вопросы остаются без ответа, а время ожидания слишком долгое"/>

*Что движет будущим обмена сообщениями в США? ([Источник](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="Разочарованный клиент ставит 1 звезду на Google Maps из-за отсутствия общения со стороны владельца бизнеса."/>

*Разочарованный клиент ставит 1 звезду из-за отсутствия общения со стороны владельца бизнеса.*
</center>

В [нашей предыдущей статье](https://seasalt.ai/blog/9-enable-chat-on-google-maps/) мы познакомили вас с тем, как использовать функцию SMS-напоминаний Google, чтобы не пропустить сообщения клиентов. Но мы знаем, что как владелец бизнеса, ответы на сообщения клиентов занимают много времени, и помимо обслуживания клиентов вам нужно обрабатывать много других вещей. Поэтому мы хотим познакомить вас с [Google Business Messages](https://businessmessages.google/).

### О Google Business Messages

Google Business Messages — это новое поколение разговорного опыта, которое решает проблему предоставления мгновенных ответов вашим клиентам, когда нет человеческого обслуживания. Хотя Google Business Profile позволяет владельцам бизнеса общаться напрямую с клиентами через кнопку чата на Google Maps, Google Business Messages идет на шаг дальше, интегрируясь с виртуальным обслуживанием клиентов. Согласно [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6), виртуальный агент — это "компьютерно-генерированный, анимированный, искусственно интеллектуальный виртуальный персонаж (обычно с антропоморфной внешностью), который действует как представитель онлайн-обслуживания клиентов."

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="Бизнес-лидеры считают, что Business Messages Google улучшат взаимодействие с клиентами"/>

*Сделайте это личным: Как умные коммуникационные инструменты стимулируют бизнес-результаты ([Источник](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>

Виртуальные агенты обычно называются цифровыми помощниками. Виртуальные агенты используют технологию, называемую обработкой естественного языка (NLP), для предоставления автоматизированных ответов. Виртуальные агенты могут принести пользу вашему бизнесу, сокращая время отклика, обеспечивая доступность 24/7 и улучшая клиентский опыт. Вот как Google Business Messages помогает вам предоставлять высококачественные автоматизированные ответы вашим клиентам.

Другие преимущества Google Business Messages включают:
- Предоставление мгновенных ответов на запросы ваших клиентов
- Экономия времени и денег при предоставлении отличного обслуживания клиентов
- Построение доверия с вашими клиентами

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages интегрирует виртуальных агентов прямо в кнопку чата на Google Maps"/>

*Google Business Messages интегрирует виртуальных агентов прямо в вашу кнопку чата.*
</center>

### Как компании внедряют Google Business Messages

Чтобы лучше понять, как Google Business Messages может помочь вашему бизнесу, давайте посмотрим на некоторые примеры от Walmart, Levi's и Albertsons Companies.

#### 1. Walmart

Walmart был одной из первых компаний, внедривших Business Messages ([Блог Google](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). С Google Business Messages Walmart предоставляет актуальную информацию о часах работы магазинов, продуктах, вакцинах и тестах COVID-19, вариантах самовывоза и доставки, политике возврата и многом другом. Клиенты могут получать мгновенные ответы в любое время дня.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="Клиенты могут связаться с Walmart через кнопку чата на Google Maps (только мобильные)"/>

*Клиенты могут связаться с Walmart через кнопку чата на Google Maps (только мобильные).*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="Клиенты могут спрашивать виртуального агента Walmart о часах работы магазинов, продуктах, политике масок, вакцинах COVID-19 и т.д."/>

*Клиенты могут спрашивать о часах работы магазинов, продуктах, политике масок, вакцинах COVID-19 и т.д.*
</center>

#### 2. Levi's

Levi's — это компания по производству одежды, известная своими джинсами Levi's, с 3100 розничными магазинами в 110 странах. Во время пандемии Levi's наблюдал, что покупатели тратили много времени на исследование перед покупкой, а часы работы магазинов могли меняться чаще. Levi's хотел превратить покупателей в реальных клиентов и предоставить быстрые ответы на запросы покупателей.

В июне 2020 года Levi's внедрил Google Business Messages, стремясь улучшить клиентский опыт, предоставляя актуальную информацию о магазинах и продуктах. Используя способность Google Business Messages помогать клиентам в любое время дня, Levi's смог достичь показателя удовлетворенности клиентов (CSAT) 85%. Levi's также обнаружил, что проблемы, связанные с магазинами, решались в 30 раз чаще. Узнайте больше о том, как Levi's внедрил Google Business Messages [здесь](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf).

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="Клиенты могут связаться с Levi's через кнопку чата на Google Maps (только мобильные)"/>

*Клиенты могут связаться с Levi's через кнопку чата (только мобильные).*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="Клиенты могут видеть продукты Levi's при взаимодействии с виртуальным агентом Levi's на Google Maps"/>

*Клиенты могут видеть продукты Levi's при взаимодействии с виртуальным агентом Levi's.*
</center>

#### 3. Albertsons Companies

Albertsons Companies имеет несколько аптек по всей территории США, включая Safeway, Jewel-Osco, Vons, Albertsons, Shaw's и другие. В конце 2020 года, во время первоначального выпуска вакцин COVID-19, наблюдался рост онлайн-поиска вакцин. Было больше вопросов о праве на вакцинацию, назначениях и где люди могут получить вакцину. Albertsons Companies решил запустить Google Business Messages для предоставления актуальной информации о критериях права, назначениях, доступности и многом другом. В результате они смогли сократить объемы звонков, предотвратить потенциальную дезинформацию и предоставить клиентам помощь 24/7.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="Клиенты могут получить информацию о праве на вакцинацию и записаться на прием прямо от виртуального агента Albertsons Companies"/>

*Клиенты могут получить информацию о праве на вакцинацию и записаться на прием.*
</center>

Google Business Messages — отличный способ сэкономить время и деньги, отвечая на повторяющиеся запросы, строя отношения с клиентами и улучшая общий клиентский опыт.

### Препятствия для внедрения

Как упоминалось выше, существуют два основных ограничения для обычных внедрений Google Business Messages.

Во-первых, создание и поддержание отличного виртуального агента непросто; это требует продвинутых знаний разговорного ИИ и значительного времени разработки. Компании, использующие Google Business Messages, должны платить профессиональным консалтинговым агентствам за создание полностью настраиваемого опыта для них с нуля. Обычно это дорого и может занять месяцы. Только крупные предприятия, такие как Levi's, Walmart и Albertsons Companies, могут позволить себе такие специализированные услуги. Консалтинговые агентства также обычно полностью контролируют разработку и обслуживание продукта. Если вам нужно внести изменения, вы должны пройти через агентство, что требует дополнительного времени.

Во-вторых, Google Business Messages является заменой встроенной функции обмена сообщениями в Google Business Profile. Как владелец бизнеса, вы можете включить кнопку чата в вашем Google Business Profile и отвечать, когда доступны. Однако когда вы внедряете Google Business Messages, ваши входящие сообщения будут направлены к вашему онлайн-агенту, и вы потеряете способность общаться напрямую с клиентами в вашем Google Business Profile или используя приложение Google My Business.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="Решения для живого чата позволяют владельцам бизнеса говорить напрямую с клиентами"/>

*Если включены решения для живого чата, клиенты смогут нажать "Отправить сообщение живому агенту", чтобы говорить напрямую с владельцем бизнеса.*
</center>

Если вы хотите говорить напрямую с вашими клиентами, используя Google Business Messages, вам нужно попросить консалтинговое агентство предоставить решения для живого чата. Если эта функция включена, клиенты могут нажать кнопку "Отправить сообщение живому агенту", а затем вы можете присоединиться к разговору и общаться с клиентами. На стороне живого агента разговоры будут происходить на любой платформе, которую выберет консалтинговое агентство для интеграции; это можно сделать через SMS, WhatsApp, Messenger, существующее программное обеспечение для обслуживания клиентов, такое как Zendesk, или настраиваемые веб-сайты или мобильные приложения.

Вот почему мы хотим познакомить вас с нашим решением Near Me Messaging (Обновление: Мы с тех пор преобразовали продукт в полнофункциональный конструктор чат-ботов. Теперь называется [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!), который предоставляет доступные, быстрые и простые в реализации Google Business Messages для малого и среднего бизнеса с полностью настраиваемыми, самообслуживанием и возможностями живого чата. Следите за нашим следующим постом о Near Me Messaging и его отличных функциях. [Запланируйте демонстрацию с нами](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) и станьте первым, кто использует Near Me Messaging!
`;export{s as default};
