const e=`---
title: "व्यापार मालिकों: ऑफ-घंटों के दौरान जुड़ने के लिए Google व्यवसाय संदेशों का उपयोग करें!"
metatitle: "ऑफ-घंटों के दौरान जुड़ने के लिए Google व्यवसाय संदेशों का उपयोग करें!"
date: 2022-03-29 17:58:58-07:00
modified_date: 2025-07-26T16:48:39Z
draft: false
author: Ruli Setiawati
description: "जबकि Google व्यवसाय प्रोफ़ाइल व्यवसाय मालिकों को सीधे ग्राहकों के साथ चैट करने देती है, Google व्यवसाय संदेश एक आभासी एजेंट के साथ एकीकरण को सक्षम बनाता है।"
weight: 1
tags:
  - NearMe
image: images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/thumbnail.png
canonicalURL: /blog/use-google-business-messages-off-hours/
url: /blog/use-google-business-messages-off-hours/
---

*Google व्यवसाय संदेशों के लाभों और सीमाओं और व्यवसाय Google व्यवसाय संदेशों को कैसे लागू करते हैं, इसके बारे में और जानें।*

अपने Google व्यवसाय प्रोफ़ाइल पर चैट सुविधा को सक्षम करने से आपको अपने ग्राहकों से जुड़ने में मदद मिल सकती है। हालाँकि, जैसे-जैसे ग्राहक आपसे चैट पर अधिक संपर्क करते हैं, आपके पास प्रत्येक चैट का जवाब देने के लिए समय और संसाधन नहीं हो सकते हैं, खासकर बंद घंटों के दौरान। इसके अलावा, अधिकांश पूछताछ दोहराई जा सकती है। साथ ही, ग्राहक व्यवसायों से तत्काल उत्तर की उम्मीद करते हैं। यदि व्यवसाय अपने ग्राहकों की जरूरतों को पूरा नहीं करते हैं, तो वे मौजूदा और संभावित ग्राहकों को खोने का जोखिम उठाते हैं।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="उपभोक्ता अपने सवालों के जवाब न मिलने और बहुत देर तक होल्ड पर फंसे रहने से निराश हैं"/>

*संयुक्त राज्य अमेरिका में मैसेजिंग के भविष्य को क्या चला रहा है? ([स्रोत](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="एक व्यवसाय के मालिक द्वारा संचार की कमी के कारण Google मानचित्र पर एक परेशान ग्राहक द्वारा 1-सितारा रेटिंग।"/>

*एक व्यवसाय के मालिक द्वारा संचार की कमी के कारण एक परेशान ग्राहक द्वारा 1-सितारा रेटिंग।*
</center>

[हमारे पिछले लेख](https://seasalt.ai/blog/9-enable-chat-on-google-maps/) में, हमने आपको बताया कि आप Google की SMS अलर्ट सुविधा के साथ ग्राहक संदेशों को गुम होने से कैसे बचा सकते हैं। लेकिन हम समझते हैं कि व्यवसाय के मालिकों के रूप में, ग्राहक संदेशों का जवाब देने में काफी समय लगता है, और केवल ग्राहक सेवा से परे बहुत सी अन्य चीजें हैं जिनकी आपको देखभाल करनी होती है। इसीलिए हम आपको [Google व्यवसाय संदेशों](https://businessmessages.google/) से परिचित कराना चाहते हैं।

### Google व्यवसाय संदेशों के बारे में

Google व्यवसाय संदेश एक अगली पीढ़ी का संवादी अनुभव है जो आपके ग्राहकों को वास्तविक समय पर प्रतिक्रिया प्रदान करने की समस्या को हल करता है जब कोई मानव उपलब्ध नहीं होता है। जबकि Google व्यवसाय प्रोफ़ाइल व्यवसाय मालिकों को Google मानचित्र पर चैट बटन के माध्यम से सीधे ग्राहकों के साथ चैट करने देती है, Google व्यवसाय संदेश एक आभासी एजेंट के साथ एकीकरण को सक्षम करके इसे एक कदम आगे ले जाता है। [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6) के अनुसार, एक आभासी एजेंट "एक कंप्यूटर-जनित, एनिमेटेड, कृत्रिम बुद्धिमत्ता आभासी चरित्र (आमतौर पर मानवशास्त्रीय उपस्थिति के साथ) है जो एक ऑनलाइन ग्राहक सेवा प्रतिनिधि के रूप में कार्य करता है"।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="व्यावसायिक निर्णय लेने वालों का मानना ​​है कि Google के व्यावसायिक संदेश ग्राहकों के साथ बातचीत में सुधार करेंगे"/>

*इसे व्यक्तिगत बनाना: कैसे स्मार्ट संचार उपकरण व्यावसायिक परिणाम देते हैं ([स्रोत](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf))।*
</center>

एक आभासी एजेंट को अक्सर एक डिजिटल सहायक के रूप में संदर्भित किया जाता है। आभासी एजेंट स्वचालित प्रतिक्रियाएं प्रदान करने के लिए प्राकृतिक भाषा प्रसंस्करण (एनएलपी) नामक एक तकनीक का उपयोग करते हैं। आभासी एजेंट प्रतिक्रिया समय को कम करके, 24/7 उपलब्धता प्रदान करके और ग्राहक अनुभव में सुधार करके आपके व्यवसाय को लाभान्वित कर सकते हैं। इस तरह Google व्यवसाय संदेश आपको अपने ग्राहकों को उच्च-गुणवत्ता वाली स्वचालित प्रतिक्रियाएं प्रदान करने में मदद कर सकता है।

Google व्यवसाय संदेशों के अतिरिक्त लाभों में शामिल हैं:
- अपने ग्राहकों की पूछताछ के लिए तत्काल उत्तर प्रदान करें
- उत्कृष्ट ग्राहक प्रदान करने में समय और धन की बचत करें
- अपने ग्राहकों के साथ विश्वास बनाएँ

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google व्यवसाय संदेश Google मानचित्र पर चैट बटन में सीधे एक आभासी एजेंट को एकीकृत करता है"/>

*Google व्यवसाय संदेश आपके चैट बटन में सीधे एक आभासी एजेंट को एकीकृत करता है।*
</center>

### व्यवसाय Google व्यवसाय संदेशों को कैसे लागू करते हैं

Google व्यवसाय संदेश आपके व्यवसाय की कैसे मदद कर सकता है, इसकी बेहतर समझ देने के लिए, आइए वॉलमार्ट, लेवी और अल्बर्ट्सन कंपनियों के कुछ उदाहरणों पर एक नज़र डालें।

#### 1. वॉलमार्ट

वॉलमार्ट व्यवसाय संदेशों को लागू करने वाली पहली कंपनियों में से है ([Google ब्लॉग](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/))। Google व्यवसाय संदेशों के साथ, वॉलमार्ट स्टोर के घंटे, उत्पादों, COVID-19 वैक्सीन और परीक्षण, पिक-अप और डिलीवरी विकल्प, वापसी नीति, और बहुत कुछ के बारे में अद्यतित जानकारी प्रदान करता है। ग्राहक दिन के किसी भी समय तत्काल उत्तर प्राप्त कर सकते हैं।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="ग्राहक Google मानचित्र पर चैट बटन के माध्यम से वॉलमार्ट से संपर्क कर सकते हैं (केवल मोबाइल)"/>

*ग्राहक Google मानचित्र पर चैट बटन के माध्यम से वॉलमार्ट से संपर्क कर सकते हैं (केवल मोबाइल)।*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="ग्राहक वॉलमार्ट के आभासी एजेंट से स्टोर के घंटे, उत्पादों, मास्क नीति, COVID-19 वैक्सीन, और बहुत कुछ के बारे में सवाल पूछ सकते हैं"/>

*ग्राहक स्टोर के घंटे, उत्पादों, मास्क नीति, COVID-19 वैक्सीन, और बहुत कुछ के बारे में सवाल पूछ सकते हैं।*
</center>

#### 2. लेवी’ज

लेवी एक कपड़े की कंपनी है जो अपनी लेवी की डेनिम जींस के लिए जानी जाती है, जिसके 110 देशों में 3,100 खुदरा स्टोर हैं। महामारी के दौरान, लेवी ने देखा कि खरीदार खरीदारी-पूर्व शोध पर काफी समय बिताते हैं और स्टोर के घंटे अधिक बार बदल सकते हैं। लेवी खरीदारों को वास्तविक ग्राहकों में बदलना और खरीदारों की पूछताछ के लिए त्वरित प्रतिक्रिया प्रदान करना चाहता था।

जून 2020 में, लेवी ने स्टोर और उत्पादों के बारे में अद्यतित जानकारी प्रदान करके ग्राहक अनुभव को बेहतर बनाने के लक्ष्य के साथ Google व्यवसाय संदेशों को लागू किया। लेवी ने दिन के किसी भी समय ग्राहकों की मदद करने के लिए Google व्यवसाय संदेशों की क्षमता का लाभ उठाया और परिणामस्वरूप, 85% ग्राहक संतुष्टि (CSAT) स्कोर प्राप्त करने में सक्षम था। लेवी ने यह भी देखा कि स्टोर से संबंधित 30 गुना अधिक प्रश्नों का समाधान किया गया। लेवी ने Google व्यवसाय संदेशों को कैसे लागू किया, इसके बारे में और जानें [यहां](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf)।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="ग्राहक Google मानचित्र पर चैट बटन के माध्यम से लेवी से संपर्क कर सकते हैं (केवल मोबाइल)"/>

*ग्राहक चैट बटन के माध्यम से लेवी से संपर्क कर सकते हैं (केवल मोबाइल)।*
</center>

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="ग्राहक Google मानचित्र पर लेवी के आभासी एजेंट के साथ बातचीत करते समय लेवी के उत्पादों को देख सकते हैं"/>

*ग्राहक लेवी के आभासी एजेंट के साथ बातचीत करते समय लेवी के उत्पादों को देख सकते हैं।*
</center>

#### 3. अल्बर्ट्सन कंपनियां

अल्बर्ट्सन कंपनी संयुक्त राज्य भर में कई फार्मेसियों का मालिक है, जिसमें सेफवे, ज्वेल-ओस्को, वॉन, अल्बर्ट्सन, शॉ और बहुत कुछ शामिल हैं। 2020 के अंत में, COVID-19 टीकों की प्रारंभिक रिलीज के दौरान, टीकों के लिए ऑनलाइन खोजों में वृद्धि हुई थी। टीके की पात्रता, नियुक्तियों और लोगों को टीके कहाँ मिल सकते हैं, इसके बारे में अधिक प्रश्न थे। अल्बर्ट्सन कंपनी ने पात्रता मानदंड, नियुक्तियों, उपलब्धता, और बहुत कुछ के बारे में अद्यतित जानकारी प्रदान करने के लिए Google व्यवसाय संदेशों को सक्रिय करने का निर्णय लिया। परिणामस्वरूप, वे आने वाली कॉलों की संख्या को कम करने, संभावित गलत सूचना को रोकने और ग्राहकों को 24/7 मदद करने में सक्षम थे।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="ग्राहक टीके की पात्रता के बारे में जानकारी प्राप्त कर सकते हैं और सीधे अल्बर्ट्सन कंपनी के आभासी एजेंट से अपॉइंटमेंट बुक कर सकते हैं"/>

*ग्राहक टीके की पात्रता के बारे में जानकारी प्राप्त कर सकते हैं और अपॉइंटमेंट बुक कर सकते हैं।*
</center>

Google व्यवसाय संदेश दोहराए जाने वाले पूछताछ का जवाब देने, ग्राहकों के साथ संबंध बनाने और समग्र ग्राहक अनुभव में सुधार करने में समय और धन बचाने का एक शानदार तरीका है।

### कार्यान्वयन के लिए बाधाएं

जैसा कि ऊपर देखा गया है, Google व्यवसाय संदेशों के सामान्य कार्यान्वयन के साथ दो मुख्य सीमाएं हैं।

सबसे पहले, एक उत्कृष्ट आभासी एजेंट बनाना और बनाए रखना कोई सरल कार्य नहीं है; इसके लिए संवादी एआई के उन्नत ज्ञान और महत्वपूर्ण विकास समय की आवश्यकता होती है। Google व्यवसाय संदेशों का उपयोग करने वाले व्यवसायों को उनके लिए जमीन से पूरी तरह से अनुकूलित अनुभव बनाने के लिए एक पेशेवर परामर्श एजेंसी को भुगतान करने की आवश्यकता होती है। ये आमतौर पर महंगे होते हैं और महीनों लग सकते हैं। लेवी, वॉलमार्ट और अल्बर्ट्सन कंपनियों जैसे बड़े उद्यम ही ऐसी विशेष सेवा का खर्च उठा सकते हैं। परामर्श एजेंसी आमतौर पर उत्पाद के विकास और रखरखाव के पूर्ण नियंत्रण में भी होती है। यदि आपको परिवर्तन करने हैं, तो आपको एजेंसी के माध्यम से जाना होगा और इसमें अतिरिक्त समय लगता है।

दूसरे, Google व्यवसाय संदेश Google व्यवसाय प्रोफ़ाइल में निर्मित मैसेजिंग क्षमता का एक प्रतिस्थापन है। व्यवसाय के मालिकों के रूप में, आपके पास Google व्यवसाय प्रोफ़ाइल पर चैट बटन को सक्षम करने और जब भी आप उपलब्ध हों, जवाब देने की क्षमता होती है। हालाँकि, जब आप Google व्यवसाय संदेशों को लागू करते हैं, तो आपके आने वाले संदेश आपके लाइव एजेंट को भेज दिए जाते हैं, और आप Google व्यवसाय प्रोफ़ाइल के भीतर या Google मेरा व्यवसाय ऐप का उपयोग करके ग्राहकों के साथ सीधे चैट करने की अपनी क्षमता खो देते हैं।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="लाइव-चैट समाधान व्यवसाय मालिकों को सीधे ग्राहकों से बात करने की अनुमति देता है"/>

*यदि लाइव-चैट समाधान सक्षम है, तो ग्राहक सीधे व्यवसाय मालिकों से बात करने के लिए "लाइव एजेंट को संदेश भेजें" पर क्लिक कर सकेंगे।*
</center>

यदि आप अभी भी Google व्यवसाय संदेशों का उपयोग करते समय सीधे अपने ग्राहकों से बात करना चाहते हैं, तो आपको परामर्श एजेंसी से लाइव-चैट समाधान प्रदान करने के लिए कहना होगा। यदि यह सुविधा सक्षम है, तो ग्राहक "लाइव एजेंट को संदेश भेजें" बटन पर क्लिक कर सकते हैं, और फिर आप बातचीत में शामिल हो सकेंगे और ग्राहक के साथ चैट कर सकेंगे। लाइव एजेंट की ओर से, बातचीत उस किसी भी प्लेटफ़ॉर्म पर होगी जिसे परामर्श एजेंसी ने एकीकृत करने के लिए चुना है; यह टेक्स्ट, व्हाट्सएप, मैसेंजर, ज़ेंडेस्क जैसे मौजूदा ग्राहक सेवा सॉफ़्टवेयर, या एक कस्टम-निर्मित वेबसाइट या फ़ोन ऐप के माध्यम से हो सकता है।

इसीलिए हम आपको हमारे समाधान, नियर मी मैसेजिंग (अपडेट: हमने तब से उत्पाद को एक ओमनी-चैनल चैटबॉट बिल्डर बनने के लिए बदल दिया है। अब इसे [SeaChat](https://chat.seasalt.ai/?utm_source=blog) कहा जाता है!) से परिचित कराना चाहते हैं, जो पूरी तरह से अनुकूलन योग्य, स्वयं-सेवा और लाइव-चैट क्षमताओं के साथ एसएमई के लिए Google व्यवसाय संदेशों का एक किफायती, तेज़ और आसान कार्यान्वयन प्रदान करता है। नियर मी मैसेजिंग और इसकी असाधारण विशेषताओं के बारे में हमारी अगली पोस्ट के लिए बने रहें। [हमारे साथ एक डेमो बुक करें](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) और नियर मी मैसेजिंग का उपयोग करने वाले पहले व्यक्ति बनें!
`;export{e as default};
