const n=`---
title: "Все, что вам нужно знать, чтобы подготовиться к новому правилу FCC о согласии «один к одному» 2025 года"
metatitle: "Seasalt.ai | Изменения правил TCPA 2025 | Полное руководство"
date: 2025-01-05 00:22:19-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Amy Chen
description: "Подробное руководство по изменениям правил TCPA 2025 года, содержащее важную информацию для предприятий по обеспечению соответствия."
weight: 1
tags:
  - TCPA
  - Compliance
  - 2025 FCC Rule
image: /images/blog/109-tcpa-fcc-one-to-one-rule/109-tcpa-fcc-one-to-one-rule.png
canonicalURL: /blog/tcpa-fcc-one-to-one-rule-2025/
url: /blog/tcpa-fcc-one-to-one-rule-2025/
---

**Эта статья не является юридической консультацией. Пожалуйста, проконсультируйтесь со своим юрисконсультом для получения дополнительной информации.**

Изменения в правилах TCPA (Закон о защите прав потребителей телефонной связи) 2025 года вступят в силу 27 января 2025 года. Крайне важно, чтобы любая компания, которая покупает лиды, имеет веб-сайт, собирающий номера телефонов клиентов, или отправляет SMS или исходящие звонки, понимала последствия нового правила. Обратите внимание, что хотя это новое правило предназначено для регулирования компаний по генерации лидов, оно применяется ко всем предприятиям, а не только к компаниям по генерации лидов.

Если вы управляете каким-либо бизнесом, который собирает номера телефонов клиентов и общается с клиентами, вы должны позаботиться об этом новом правиле.

## Что такое TCPA?

TCPA — это федеральный закон, регулирующий использование автоматических телефонных звонков и текстовых сообщений. Он был принят в 1991 году для защиты потребителей от нежелательных телемаркетинговых звонков и текстовых сообщений. Закон распространяется на все предприятия, которые совершают автоматические звонки или отправляют текстовые сообщения, независимо от их размера или местоположения. Проще говоря, TCPA — это закон, который регулирует использование автоматических телефонных звонков и текстовых сообщений.

На практике TCPA является причиной того, что вы должны дать согласие на получение звонков и текстовых сообщений от вашего банка, компании-эмитента кредитных карт и других предприятий. Виджет [SeaX](https://seax.seasalt.ai/?utm_source=blog&utm_medium=blog&utm_campaign=109-tcpa) является хорошим примером. Вы можете связываться со своими лидами только в том случае, если они дали согласие на получение ваших звонков и текстовых сообщений.

<br/>

<center>
<img width="50%" src="/images/blog/109-tcpa-fcc-one-to-one-rule/seax-consent-screenshot.png"  alt="Скриншот, показывающий процесс согласия SeaX">

</center>

27 января 2025 года TCPA станет строже. Каждому бизнесу необходимо пересмотреть свои стратегии генерации лидов и маркетинга, чтобы обеспечить соответствие.


## Почему новое правило FCC о согласии «один к одному» имеет значение?

Генерация лидов сегодня в значительной степени зависит от сбора форм, при этом онлайн-формы и сайты сравнения покупок являются ключевыми инструментами для маркетологов, работающих напрямую с потребителями, страховых и риелторских агентов, создателей контента и десятков тысяч малых предприятий. Поскольку рекомендации из уст в уста обычно недоступны с самого начала, предприятия, стремящиеся к расширению, должны либо разрабатывать комплексные маркетинговые стратегии, либо покупать лиды у компаний, занимающихся генерацией лидов. Ежемесячно миллионы лидов обрабатываются через десятки тысяч сайтов по генерации лидов, что приводит к сотням миллионов маркетинговых звонков потребителям.

До введения нового правила «один к одному» операторы веб-сайтов могли включать партнерские страницы, ссылающиеся на тысячи компаний, что позволяло потребителям неосознанно соглашаться на получение звонков от этих предприятий. Часто мелкий шрифт позволял звонки от компаний, предлагающих продукты, не связанные с первоначальным запросом потребителя. Например, сайт, предоставляющий информацию о медицинском страховании, может содержать мелкий шрифт, который позволяет продавать данные потребителя брокеру по страхованию имущества и от несчастных случаев или страхованию жизни.

Новое правило «один к одному» устраняет эти практики, требуя от операторов веб-сайтов четко идентифицировать каждого поставщика, который может связаться с потребителем. Потребители теперь должны индивидуально выбирать каждого поставщика, чтобы их согласие было действительным. Это изменение призвано защитить потребителей от нежелательных звонков и текстовых сообщений, гарантируя, что они явно согласились на контакт с каждым конкретным бизнесом.

Закон TCPA, появившийся в 1990-х годах, претерпел многочисленные поправки, с крупными обновлениями в начале 2010-х годов. Предстоящие изменения в 2025 году еще больше ужесточат эти правила. С 27 января 2025 года новые правила FCC требуют от генераторов лидов и веб-сайтов сравнения покупок получать согласие потребителя на робозвонки и роботексты на основе «один продавец за раз». Крайне важно понимать, что нарушения TCPA могут привести к значительным штрафам, и корпоративный статус не защищает физических лиц от личной ответственности.

**Каждый несанкционированный звонок или текстовое сообщение может привести к штрафу в размере 500 долларов**, и некоторые лица сообщают о нарушениях TCPA для получения финансовой выгоды. Поэтому защита вашего бизнеса и личных активов от этих рисков имеет важное значение.


## Преимущества нового правила согласия «один к одному»

Текущая модель основана на согласии третьих сторон, когда издатели лидов разрешают издателям лидов продавать свою информацию. Это часто приводит к тому, что один лид, сгенерированный компанией по генерации лидов, продается нескольким предприятиям. Чтобы представить это в перспективе, если вы ипотечный брокер, вы конкурируете с другими ипотечными брокерами за тот же лид. Эта бизнес-модель не только ухудшает качество лида, но и приводит к плохому клиентскому опыту. Вы когда-нибудь получали 30 звонков от разных ипотечных брокеров сразу после заполнения формы запроса ставки по ипотеке на сайте сравнения покупок? Это расстраивает как малый бизнес, так и потребителя. Малому бизнесу приходится бороться за тот же лид, а потребители перегружены количеством звонков/текстовых сообщений, которые они получают.

Новое правило согласия «один к одному» направлено на улучшение этой системы, делая потребителей более восприимчивыми к общению с предприятиями, с которыми они специально выбрали работать. Измененное определение «предварительного явного письменного согласия» требует, чтобы согласие было четким, заметным и специфичным для одного идентифицированного продавца.

## Повлияет ли на меня новое правило FCC «один к одному»? Не рискуйте

Пожалуйста, используйте следующий контрольный список, чтобы определить, повлияет ли на вас правило FCC «один к одному». [Цитируя контрольный список](https://natlawreview.com/article/confused-about-fccs-new-one-one-consent-rules-youre-not-alone-here-are-some-faqs?amp) от эксперта TCPA, Эрика Дж. Траутмана из Troutman Amin, LLP.


- Если вы покупаете или продаете лиды
- Если вы BPO или колл-центр, который зависит от лидов
- Если вы платформа CPaaS или коммуникационная платформа
- Если вы оператор связи
- Если вы платформа или поставщик услуг по генерации лидов
- Если вы генерируете лиды первого контакта (получаете ли вы клиентов через SEO или PPC кампании?)

Да, вы затронуты, и вам следует проконсультироваться со своим юрисконсультом, чтобы пересмотреть свои текущие стратегии генерации лидов и маркетинга.


## Что мне делать дальше до 27 января 2025 года?

1. Если вы получаете свои собственные лиды, обновите форму захвата лидов, чтобы включить язык согласия «один к одному». Seasalt.ai готова и имеет инструменты, которые помогут вам в переходе, включая язык, используемый в формах согласия, управление вашими SMS- и исходящими звонками (как для ручных, так и для автоматических SMS- и телефонных кампаний), и многое другое.

2. Если вы получаете лиды от внешних генераторов лидов, то есть вы покупаете лиды у компаний по генерации лидов, вам необходимо проверить, соответствуют ли внешние источники лидов новому правилу согласия «один к одному». Лучше не рисковать и найти соответствующий источник лидов. Если вы не уверены, пожалуйста, свяжитесь со своим юрисконсультом или приостановите получение лидов, пока у вас не будет четкого понимания источников лидов.


## Что насчет моих существующих лидов?

После 27 января 2025 года вы можете продолжать связываться со своими существующими лидами, используя ручной набор номера (Да, человеку нужно ввести номер телефона) или системы, управляемые человеком. Однако важно отметить, что любое обращение с использованием регулируемых технологий, таких как предварительно записанные сообщения, голоса ИИ, звуковые панели, беззвучные голосовые сообщения (RVM), интерактивные голосовые ответы (IVR) или голосовые сообщения (VMs), будет запрещено для этих старых лидов.



## Действуйте сейчас

Если вы хотите быть впереди, пожалуйста, действуйте сейчас. 27 января 2025 года быстро приближается, но мы не видим достаточного количества компаний, принимающих меры для подготовки. Seasalt.ai продолжит предоставлять ресурсы и инструменты, чтобы помочь вам подготовиться к новому правилу. Мы охватываем SMS- и исходящие звонки с использованием как ручной, так и ИИ-технологии. Давайте работать вместе, чтобы убедиться, что вы соответствуете требованиям и готовы к новому правилу.

Изменения в правилах TCPA 2025 года значительно повлияют на то, как предприятия осуществляют свою деятельность. Звонки и текстовые сообщения, использующие регулируемые технологии, потребуют явного согласия на подписку. Для тех, у кого нет подписки, потребуется ручной набор номера и отправка текстовых сообщений после очистки. Существующие деловые отношения могут предоставлять некоторые исключения, но оставаться информированным и соблюдать правила крайне важно. Всегда консультируйтесь со своим юрисконсультом, прежде чем вносить какие-либо изменения.

<center>
<a href="https://meetings.hubspot.com/seasalt-ai/seasalt-meeting" style="display: inline-block; padding: 10px 20px; font-size: 16px; color: #fff; background-color: #18a1a8; border-radius: 5px; text-decoration: none;">Запишитесь на бесплатную консультацию с нами</a>
</center>


## Ссылки

Если вы предпочитаете читать непосредственно из FCC, пожалуйста, посетите следующие ссылки:
- [Правило согласия «один к одному» для предварительного явного письменного согласия TCPA Часто задаваемые вопросы](https://docs.fcc.gov/public/attachments/DOC-408396A1.pdf).
- [Постановление FCC](https://docs.fcc.gov/public/attachments/FCC-23-107A1.pdf)

Если вы хотите узнать от других экспертов, пожалуйста, посетите следующие ссылки:

- [TCPA World](https://tcpaworld.com/)
- [Consumer Financial Services Law Monitor](https://www.consumerfinancialserviceslawmonitor.com/)
- [Lead Gen Insider News](https://www.linkedin.com/posts/clelland-green-5600083_in-case-you-missed-our-4th-issue-we-activity-7271234432903135232-8kqh)
- [Стратегии генерации лидов, соответствующие новым изменениям TCPA, от Evocalize](https://youtu.be/vFNtTGuNJPA)
`;export{n as default};
