const n=`---
title: "您需要了解的关于 2025 年 FCC 新的一对一同意规则的一切"
metatitle: "Seasalt.ai | 2025 年 TCPA 规则变更 | 综合指南"
date: 2025-01-05 00:22:19-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Amy Chen
description: "一份关于 2025 年 TCPA 规则变更的深入指南，为企业提供确保合规性的基本信息。"
weight: 1
tags:
  - TCPA
  - Compliance
  - 2025 FCC Rule
image: /images/blog/109-tcpa-fcc-one-to-one-rule/109-tcpa-fcc-one-to-one-rule.png
canonicalURL: /blog/tcpa-fcc-one-to-one-rule-2025/
url: /blog/tcpa-fcc-one-to-one-rule-2025/
---

**本文不构成法律建议。请咨询您的法律顾问以获取更多信息。**

2025 年 TCPA（电话消费者保护法）规则变更将于 2025 年 1 月 27 日生效。对于任何购买潜在客户、拥有收集客户电话号码的网站或发送短信或外呼电话的企业来说，了解新规则的影响至关重要。请注意，尽管此新规则旨在规范潜在客户生成公司，但它适用于所有企业，而不仅仅是潜在客户生成公司。

如果您经营任何收集客户电话号码并与客户沟通的企业，您都应该关注这项新规则。

## 什么是 TCPA？

TCPA 是一项联邦法律，规范自动电话呼叫和短信的使用。它于 1991 年颁布，旨在保护消费者免受不必要的电话营销呼叫和短信的骚扰。该法律适用于所有进行自动呼叫或发送短信的企业，无论其规模或地点如何。简而言之，TCPA 是一项规范自动电话呼叫和短信使用的法律。

实际上，TCPA 是您必须选择加入才能接收来自银行、信用卡公司和其他企业的电话和短信的原因。[SeaX](https://seax.seasalt.ai/?utm_source=blog&utm_medium=blog&utm_campaign=109-tcpa) 小部件就是一个很好的例子。您只有在潜在客户选择接收您的电话和短信后才能联系他们。

<br/>

<center>
<img width="50%" src="/images/blog/109-tcpa-fcc-one-to-one-rule/seax-consent-screenshot.png"  alt="显示 SeaX 同意过程的屏幕截图">

</center>

2025 年 1 月 27 日，TCPA 将变得更加严格。每个企业都需要重新评估其潜在客户生成和营销策略，以确保合规性。


## 为什么 FCC 新的一对一裁决很重要？

如今，潜在客户生成严重依赖表单捕获，在线网页表单和比价购物网站是面向消费者营销人员、保险和房地产经纪人、创作者以及数万家小型企业的关键工具。由于口碑推荐通常无法从一开始就获得，因此旨在扩张的企业必须要么制定全面的营销策略，要么从潜在客户公司购买潜在客户。每个月，数百万潜在客户通过数万个潜在客户生成网站进行交易，导致向消费者拨打数亿个营销电话。

在引入新的一对一规则之前，网站运营商可以包含链接到数千家公司的合作伙伴页面，允许消费者在不知情的情况下同意接收来自这些企业的电话。通常，小字披露允许来自提供与消费者最初查询无关的产品的公司的电话。例如，一个提供健康保险信息的网站可能包含小字，允许将消费者数据出售给财产和意外险或人寿保险经纪人。

新的一对一规则通过要求网站运营商明确识别可能联系消费者的每个提供商来消除这些做法。消费者现在必须单独选择每个提供商，以便其同意有效。此更改旨在通过确保消费者明确同意由每个特定企业联系来保护消费者免受未经请求的电话和短信的骚扰。

TCPA 法案起源于 1990 年代，经历了多次修订，并在 2010 年代初期进行了重大更新。2025 年即将到来的变化将进一步收紧这些法规。自 2025 年 1 月 27 日起，FCC 的新规则要求潜在客户生成器和比价购物网站在“一次一个卖家”的基础上获得消费者对自动呼叫和自动短信的同意。重要的是要理解，违反 TCPA 可能会导致巨额罚款，并且公司身份不能保护个人免受个人责任。

**每次未经授权的电话或短信都可能导致 500 美元的罚款**，一些人报告 TCPA 违规行为是为了获取经济利益。因此，保护您的企业和个人资产免受这些风险至关重要。


## 新的一对一同意规则的好处

当前模型依赖于第三方同意，即潜在客户发布者允许潜在客户发布者出售其信息。这通常导致一个潜在客户（由潜在客户生成公司生成）被出售给多个企业。从这个角度来看，如果您是一名抵押贷款经纪人，您正在与同一潜在客户的其他抵押贷款经纪人竞争。这种商业模式不仅会降低潜在客户的质量，还会导致糟糕的客户体验。您是否曾经在比价购物网站上填写抵押贷款利率报价表后，立即收到来自不同抵押贷款经纪人的 30 个电话？这对于小型企业和消费者来说都是令人沮丧的。小型企业需要争夺同一个潜在客户，而消费者则被收到的电话/短信数量所淹没。

新的一对一同意规则旨在改进此系统，使消费者更容易接受他们明确选择合作的企业的通信。修订后的“事先明确书面同意”定义要求同意必须清晰、醒目，并针对一个已识别的卖家。

## FCC 新的一对一裁决会影响我吗？不要冒险

请使用以下清单来确定 FCC 的一对一裁决是否会影响您。 [引用 TCPA 专家 Troutman Amin, LLP 的 Eric J. Troutman 的清单](https://natlawreview.com/article/confused-about-fccs-new-one-one-consent-rules-youre-not-alone-here-are-some-faqs?amp)。


- 如果您正在购买或销售潜在客户
- 如果您是依赖潜在客户的 BPO 或呼叫中心
- 如果您是 CPaaS 或通信平台
- 如果您是电信运营商
- 如果您是潜在客户生成平台或服务提供商
- 如果您生成第一方潜在客户（您是否通过 SEO 或 PPC 活动获取客户？）

是的，您会受到影响，并且应该咨询您的法律顾问以审查您当前的潜在客户生成和营销策略。


## 2025 年 1 月 27 日之前我应该怎么做？

1. 如果您获取自己的潜在客户，请更新潜在客户捕获表单，以包含一对一同意语言。Seasalt.ai 已做好准备，并拥有工具来帮助您进行过渡，包括同意表单中使用的语言、您的短信和外呼活动（包括手动和自动短信和电话活动）的管理等等。

2. 如果您从外部潜在客户生成器获取潜在客户，即您从潜在客户生成公司购买潜在客户，您需要检查外部潜在客户来源是否符合新的一对一同意规则。最好不要冒险，寻找一个合规的潜在客户来源。如果您不确定，请联系您的法律顾问，或者暂停您的潜在客户获取，直到您对潜在客户来源有清晰的了解。


## 我的现有潜在客户怎么办？

2025 年 1 月 27 日之后，您可以继续使用手动拨号（是的，需要人工输入电话号码）或人工操作系统联系现有潜在客户。但是，需要注意的是，任何使用受监管技术（例如预先录制的邮件、AI 语音、音板、无响铃语音邮件 (RVM)、交互式语音应答 (IVR) 或语音邮件 (VMs)）的外联都将禁止用于这些旧潜在客户。



## 立即行动

如果您想走在前沿，请立即行动。2025 年 1 月 27 日即将到来，但我们没有看到足够多的企业采取行动进行准备。Seasalt.ai 将继续提供资源和工具，帮助您为新规则做好准备。我们涵盖使用手动和 AI 技术进行短信和外呼活动。让我们共同努力，确保您符合新规则并做好准备。

2025 年 TCPA 规则变更将显著影响企业开展外联活动的方式。使用受监管技术的电话和短信将需要明确的选择加入同意。对于没有选择加入的，在清理后需要手动拨号和发短信。现有的业务关系可以提供一些豁免，但保持知情和合规至关重要。在进行任何更改之前，请务必咨询您的法律顾问。

<center>
<a href="https://meetings.hubspot.com/seasalt-ai/seasalt-meeting" style="display: inline-block; padding: 10px 20px; font-size: 16px; color: #fff; background-color: #18a1a8; border-radius: 5px; text-decoration: none;">与我们预约免费咨询</a>
</center>


## 参考资料

如果您想直接从 FCC 阅读，请访问以下链接：
- [TCPA 事先明确书面同意的一对一同意规则常见问题](https://docs.fcc.gov/public/attachments/DOC-408396A1.pdf)。
- [FCC 命令](https://docs.fcc.gov/public/attachments/FCC-23-107A1.pdf)

如果您想向其他专家学习，请访问以下链接：

- [TCPA World](https://tcpaworld.com/)
- [Consumer Financial Services Law Monitor](https://www.consumerfinancialserviceslawmonitor.com/)
- [Lead Gen Insider News](https://www.linkedin.com/posts/clelland-green-5600083_in-case-you-missed-our-4th-issue-we-activity-7271234432903135232-8kqh)
- [Evocalize 关于新 TCPA 变更的合规潜在客户生成策略](https://youtu.be/vFNtTGuNJPA)
`;export{n as default};
