const e=`---
title: "وداعًا Google My Business، الآن خرائط Google هي نظام التشغيل الجديد للشركات"
metatitle: "وداعًا GMB، خرائط Google هي نظام التشغيل الجديد للشركات"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "تستبدل Google تطبيق Google My Business بخرائط Google، حيث يمكن للشركات إدارة معلوماتها والرد على رسائل العملاء على خرائط Google."
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*ربط الشركات مباشرة بالمستهلكين من خلال خرائط Google يوفر تجربة سلسة لتجربة تسوق المستهلكين. هذه خطوة استراتيجية رائعة لـ Google لتحويل خرائط Google إلى نظام التشغيل الجديد للبحث المحلي عن الشركات "القريبة مني".*


قد يكون 10 ملايين من أصحاب الأعمال الذين يستخدمون تطبيق Google My Business قد تلقوا رسالة مؤخرًا تعلن عن استبدال Google My Business بخرائط Google والبحث:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google My Business يتقاعد رسميًا.*
</center>

لقد ترددت شائعات منذ فترة طويلة بأن Google ستفعل شيئًا حيال التطبيق، بناءً على ملاحظتين:
1. تم مؤخرًا إعادة تسمية إصدار الويب عبر الإنترنت من Google My Business إلى Google Business Profile.
2. تتيح Google للمرء إدارة نشاط تجاري مباشرة من خلال بحث Google بمجرد البحث عن نشاطك التجاري الخاص على Google.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*إدارة نشاط تجاري من خلال بحث Google.*
</center>

لقد اشتبهنا في أن Google ستقوم ببساطة بإعادة تسمية Google My Business (التطبيق) إلى Google Business Profile، بالتزامن مع اسم إصدار الويب الخاص به. بعد كل شيء، يبدو أن Google قد اكتشفت بالفعل عائلة منتجاتها: **Google Business Profile** و **Google Business Messages**. وهكذا جاء الخبر مفاجأة بأن Google تتخلص تمامًا من تطبيق Google My Business المحبوب.

هل هذا منطقي لأصحاب الأعمال و Google؟ بالتأكيد نعم بعدة طرق مختلفة. إليك ما نعتقده حول هذه الخطوة.

## للشركات: تطبيق أقل ومزيد من السياق

إزالة شرط تنزيل تطبيق إضافي يخدم أصحاب الشركات الصغيرة والمتوسطة بشكل جيد. لماذا؟ لأنه حتى لو كان مجرد متجر صغير، فعادة ما يكون هناك أكثر من مدير واحد للعمل، وكل واحد منهم يحتاج إلى تنزيل التطبيق وتثبيته. على سبيل المثال، غالبًا ما يمنح أصحاب المتاجر مديريهم أو موظفيهم الإذن بتزويد العملاء بالتحديثات، مثل الإجابة على الأسئلة، والرد على المراجعات، وحتى التغييرات المفاجئة في ساعات العمل/العطلات.

غالبًا ما يحتاج الموظفون إلى تذكر استخدام تطبيق "Google My Business" لإجراء تغييرات. الآن أصبح الأمر سهلاً: ما عليك سوى فتح خرائط Google ومعظم الناس لديهم بالفعل. هذا يوفر الكثير من الوقت لكل من المالكين والموظفين.

أيضًا، في كل مرة يفتح فيها المرء خرائط Google، يرى المزيد من الشركات المتنافسة والمكملة في الحي. تتضمن هذه المعلومات غالبًا المراجعات والتصنيفات ومدى انشغال الشركات الأخرى. في السابق، عند فتح Google My Business، كان المالكون يرون فقط أعمالهم الخاصة. الآن مع تطبيق خرائط Google، يرى المالكون أولاً جميع الشركات مع سياق أكبر.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*من اليسار إلى اليمين: واجهات Google My Business وتطبيق خرائط Google لإدارة نشاطك التجاري.*
</center>

## لـ Google: المزيد من تبني الشركات

افتح أي منطقة عشوائية على خرائط Google، يمكن للمرء أن يجد على الفور ملفات تعريف الأعمال التي لم يتم "المطالبة بها" من قبل المالكين مع Google. ينظر المالكون إلى مراجعات المستهلكين وأحيانًا لا يعرفون كيفية تقديم ملاحظات. لأنهم اضطروا إلى استخدام تطبيق آخر للقيام بذلك.

لمساعدة المالكين على تتبع أعمالهم، بدأت Google [Grow With Google](https://grow.google/intl/ALL_ca/) لتقديم التدريب والأدوات والموارد لأصحاب الأعمال. ومع ذلك، فإن الحاجز هو تطبيق واحد بعيدًا. إذا نظر صاحب عمل إلى أعماله على خرائط Google وأدرك أنه يمكنه على الفور المطالبة والتحكم في أعماله (بعد التحقق)، فإن تبني Google Business Profile سيكون أسهل بكثير.

## لماذا خرائط Google؟ إنه نظام التشغيل لعالمنا المادي!

لماذا تريد خرائط Google هذا؟ يمكننا التفكير في ثلاثة أسباب رئيسية:

**التنافس ضد خرائط Apple/Bing**

تريد خرائط Google أن تتقدم أكثر على خدمات الخرائط المنافسة مثل خرائط Apple وخرائط Bing. هناك عدد محدود من ملفات تعريف الأعمال التي يرغب المالك في إدارتها: بمجرد تسجيلهم في Google، فمن غير المرجح أن يواصلوا التسجيل في المزيد من Apple و Bing.

**التنافس ضد خدمات المجمعات**

خدمات المجمعات مثل Yelp و OpenTable، نحن نتحدث عنكم. إذا كانت الرغبة النهائية في تصفح الأعمال هي الذهاب إليها بالفعل، فبالتأكيد أتمنى أن أتمكن من قراءة جميع المراجعات أو إجراء حجز من واجهة الخرائط أو الملاحة الخاصة بي، والتي عادة ما تكون خرائط Google.

توفر خرائط Google بالفعل اختصارات مريحة لروابط المتجر للقائمة، والطلب، والحجز، والمواعيد، وأبرز الميزات، وما إلى ذلك. إن التبني الهائل للمستهلكين يضع الجوانب التي تواجه المستهلك من الشركات من Yelp/OpenTable/Foursquare في وضع صعب للغاية.

**تقديم خدمات أفضل للمستهلكين**

يريد المستهلكون معلومات أكثر تفصيلاً وشمولية حول الأعمال التجارية. في بعض الأحيان يواجهون صعوبة في التواصل مع الشركات. حتى أن بعض الشركات لديها صندوق بريد صوتي ممتلئ بحيث لا يمكن ترك رسالة صوتية. من خلال اعتماد خرائط Google لإدارة الأعمال مباشرة، يتم تشجيع الشركات على تقديم المزيد من المعلومات التي ستنعكس مباشرة على ملفها الشخصي في خرائط Google. في المقابل، يبقى المستهلكون على خرائط Google أكثر، دون اللجوء إلى مصادر أخرى للمعلومات.

## خرائط Google: ربط المستهلك والعمل حقًا

في السابق، قدمت خرائط Google خدمات للشركات التي تحتاج إلى معلومات جغرافية من خلال تقديم واجهات برمجة التطبيقات الخاصة بها على Google Cloud. وهكذا يمكن للمرء أن يكتب بسرعة اسم عمل تجاري ويكتشف عنوانه، أو يقوم بالترميز الجغرافي العكسي لتحويل خطوط الطول والعرض إلى عنوان أو العثور على جميع الأعمال التجارية في عنوان. توفر خرائط Google أيضًا خدمات رسم خرائط وملاحة عالية الدقة في منافسة مع [HERE Maps](https://www.here.com/)، والتي تشغل القيادة الذاتية للعديد من المركبات.

لكن كل هذا يحدث تحت الغطاء وليس له علاقة كبيرة بالمستهلكين العاديين. ثم يأتي تغيير كبير:

<center>

*هل تعلم أن خرائط Google هي أيضًا تطبيق دردشة بين المستهلكين والشركات؟*
</center>

نعم، يمكن للمستهلكين الآن إرسال رسالة إلى عمل تجاري على خرائط Google باستخدام خرائط Google! هذه محاولة أخرى من Google لتحدي iMessage كأداة اتصال تجارية، بعد معارك صعبة مع شركات الاتصالات التي [تباطأت في تبني معيار RCS للمراسلة](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/) على هواتف Android.

ربط الشركات مباشرة بالمستهلكين من خلال خرائط Google يوفر تجربة سلسة لتجربة تسوق المستهلكين. هذه خطوة استراتيجية رائعة لـ Google لتحويل خرائط Google إلى نظام التشغيل الجديد للبحث المحلي عن الشركات "القريبة مني".


إذا أجبت بـ "لا" على السؤال أعلاه، فهذا يعني أن الأمر لا يزال يتطلب بعض الاكتشاف لاستخدام خرائط Google لإدارة عملك أو إرسال رسائل إلى عملائك. يرجى متابعة القراءة للحصول على دليل تعليمي خطوة بخطوة حول كيفية استخدام خرائط Google لعملك!

## دليل تعليمي خطوة بخطوة حول كيفية استخدام خرائط Google لإدارة أعمالك

أولاً وقبل كل شيء، تأكد من تحديث تطبيق خرائط Google الخاص بك إلى أحدث إصدار. هنا، نحن نستخدم الإصدار 6.12 على iOS. يمكننا التأكد من أن الإصدار 11.24 على Android لديه نفس الإمكانيات.

### 1. انتقل إلى تطبيق خرائط Google وانقر على ملفك الشخصي.
انتقل إلى تطبيق خرائط Google الخاص بك وتأكد من أنك تستخدم نفس الحساب الذي تستخدمه لملف Google Maps Profile. انقر على ملفك الشخصي.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*واجهة تطبيق خرائط Google.*
</center>

### 2. انقر على "ملفاتك التجارية".
إذا كنت تستخدم الحساب الصحيح المرتبط بقائمة أعمالك، فيجب أن تكون قادرًا على رؤية خيار "ملفاتك التجارية". انقر على خيار "ملفاتك التجارية".

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*انقر على "ملفاتك التجارية" لعرض ملفاتك التجارية.*
</center>

### 3. حدد النشاط التجاري الذي تريد تحديثه.

إذا كان لديك عدة أنشطة تجارية، فيجب أن تكون قادرًا على رؤية جميع أنشطتك التجارية. حدد النشاط التجاري الذي تريد تحديثه أو إدارته في الوقت الحالي. في مثالنا، نريد إدارة Seasalt AI.


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*يمكننا رؤية الأنشطة التجارية التي نديرها حاليًا.*
</center>

### 4. انقر على خيار "تعديل الملف الشخصي".
بمجرد النقر على زر "تعديل الملف الشخصي"، يمكنك رؤية جميع المعلومات التي يمكنك تعديلها. يتضمن ذلك معلومات النشاط التجاري، وساعات العمل، والشعار، وصورة الغلاف. لغرض هذا البرنامج التعليمي، سنقوم بتحديث معلومات النشاط التجاري.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*انقر على زر "تعديل الملف الشخصي".*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*المعلومات التي يمكنك تعديلها حول نشاطك التجاري.*
</center>


### 5. حدد أي معلومات تريد تعديلها.

بمجرد النقر على معلومات النشاط التجاري، يمكنك رؤية المعلومات التي يمكنك تعديلها مثل اسم النشاط التجاري، وفئة النشاط التجاري، ورقم الهاتف، والموقع الإلكتروني، والمزيد. يمكنك تحديد أي معلومات تريد تحديثها.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*خيارات معلومات النشاط التجاري التي يمكنك تعديلها.*
</center>


إن استبدال Google My Business بخرائط Google والبحث منطقي تمامًا لأصحاب الأعمال و Google. بالنسبة للشركات، فهو تطبيق أقل لتنزيله لإدارة معلومات أعمالهم. بهذه الخطوة، تربط خرائط Google أيضًا المستهلكين والشركات حقًا. يمكن للمستهلكين الآن إرسال رسالة إلى عمل تجاري على خرائط Google باستخدام خرائط Google، والعكس صحيح. يتيح الاتصال بالمستهلكين من خلال خرائط Google أيضًا تجربة سلسة للمستهلكين. بالنسبة لـ Google، فإن تسهيل الأمور على أصحاب الأعمال يعني المزيد من تبني الشركات.

تعرف على المزيد حول كيفية [إدارة ملفك التجاري مباشرة على Google](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid). ابق على اتصال معنا من خلال متابعتنا على [LinkedIn](https://www.linkedin.com/company/seasalt-ai)!
`;export{e as default};
