const e=`---
title: "अलविदा Google My Business, अब Google Maps व्यवसायों के लिए नया OS है"
metatitle: "अलविदा GMB, Google Maps व्यवसायों के लिए नया OS है"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "Google Google My Business ऐप को Google Maps से बदल रहा है, जहाँ व्यवसाय अपनी जानकारी प्रबंधित कर सकते हैं और Google Maps पर ग्राहकों के संदेशों का जवाब दे सकते हैं।"
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*Google Maps के माध्यम से व्यवसायों को सीधे उपभोक्ताओं से जोड़ना उपभोक्ताओं के खरीदारी अनुभव के लिए एक सहज अनुभव प्रदान करता है। Google के लिए Google Maps को व्यवसायों की स्थानीय खोज के लिए नया ऑपरेटिंग सिस्टम बनाने के लिए यह एक शानदार रणनीतिक कदम है "मेरे पास"।*


Google My Business ऐप का उपयोग करने वाले 10 मिलियन व्यवसाय मालिकों को हाल ही में Google My Business को Google Maps और Search से बदलने की घोषणा करने वाला एक संदेश प्राप्त हुआ होगा:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google My Business आधिकारिक तौर पर सेवानिवृत्त हो गया।*
</center>

लंबे समय से अफवाह थी कि Google ऐप के बारे में कुछ करेगा, दो अवलोकनों के आधार पर:
1. Google My Business के ऑनलाइन वेब संस्करण का नाम हाल ही में Google Business Profile में बदल दिया गया है।
2. Google आपको Google पर अपने व्यवसाय को खोजने के बाद सीधे Google Search के माध्यम से व्यवसाय का प्रबंधन करने की अनुमति देता है।


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*Google Search के माध्यम से व्यवसाय का प्रबंधन करना।*
</center>

हमें संदेह था कि Google Google My Business (ऐप) का नाम बदलकर Google Business Profile कर देगा, जो इसके वेब संस्करण के नाम के साथ सिंक्रनाइज़ होगा। आखिरकार, Google ने पहले ही अपने उत्पाद परिवार का पता लगा लिया है: **Google Business Profile** और **Google Business Messages**। इस प्रकार यह खबर एक आश्चर्य के रूप में आई कि Google प्रिय Google My Business ऐप को पूरी तरह से बंद कर रहा है।

क्या यह व्यवसाय मालिकों और Google के लिए कोई मायने रखता है? यह निश्चित रूप से कई अलग-अलग तरीकों से मायने रखता है। यहां हम इस कदम के बारे में क्या सोचते हैं।

## व्यवसायों के लिए: एक कम ऐप और अधिक संदर्भ

एक अतिरिक्त ऐप डाउनलोड करने की आवश्यकता को हटाना SME मालिकों के लिए अच्छा काम करता है। क्यों? क्योंकि भले ही यह सिर्फ एक पॉप और मॉम शॉप हो, आमतौर पर एक व्यवसाय के लिए एक से अधिक प्रबंधक होते हैं और प्रत्येक को ऐप डाउनलोड और इंस्टॉल करने की आवश्यकता होती है। उदाहरण के लिए, स्टोर मालिक अक्सर अपने प्रबंधकों या कर्मचारियों को ग्राहकों को अपडेट प्रदान करने की अनुमति देते हैं, जैसे प्रश्नों का उत्तर देना, समीक्षाओं का जवाब देना, और यहां तक कि स्टोर/छुट्टी के घंटों में अचानक परिवर्तन भी।

कर्मचारियों को अक्सर बदलाव करने के लिए "Google My Business" ऐप का उपयोग करना याद रखना पड़ता है। अब यह आसान है: बस Google Maps खोलें और अधिकांश लोगों के पास यह पहले से ही है। यह मालिकों और कर्मचारियों दोनों के लिए बहुत समय बचाता है।

इसके अलावा, हर बार जब कोई Google Maps खोलता है, तो उसे पड़ोस में अधिक प्रतिस्पर्धी और पूरक व्यवसाय दिखाई देते हैं। इस जानकारी में अक्सर समीक्षाएं, रैंकिंग और अन्य व्यवसायों की व्यस्तता शामिल होती है। पहले जब Google My Business खोला जाता था, तो मालिक केवल अपना व्यवसाय देखते थे। अब Google Maps ऐप के साथ, मालिक पहले अधिक संदर्भ के साथ सभी व्यवसायों को देखते हैं।


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*बाएं से दाएं: Google My Business और Google Maps इंटरफेस आपके व्यवसाय का प्रबंधन करने के लिए।*
</center>

## Google के लिए: व्यवसायों का अधिक अपनाना

Google Maps पर किसी भी यादृच्छिक क्षेत्र को खोलें, कोई भी तुरंत उन व्यावसायिक प्रोफाइल को ढूंढ सकता है जिन्हें मालिकों द्वारा Google के साथ "दावा" नहीं किया गया है। मालिक उपभोक्ताओं की समीक्षाओं को देखते हैं और कभी-कभी यह नहीं जानते कि प्रतिक्रिया कैसे दें। क्योंकि उन्हें ऐसा करने के लिए एक और ऐप का उपयोग करना पड़ता था।

मालिकों को उनके व्यवसाय के साथ ट्रैक पर लाने में मदद करने के लिए, Google ने व्यवसाय मालिकों को प्रशिक्षण, उपकरण और संसाधन प्रदान करने के लिए [Grow With Google](https://grow.google/intl/ALL_ca/) शुरू किया है। फिर भी, बाधा एक ऐप दूर है। यदि कोई व्यवसाय मालिक Google Maps पर अपने व्यवसाय को देखता है और महसूस करता है कि वे तुरंत अपने व्यवसाय का दावा कर सकते हैं और नियंत्रण कर सकते हैं (सत्यापन के बाद), तो Google Business Profile को अपनाना बहुत आसान होगा।

## Google Maps क्यों? यह हमारी भौतिक दुनिया का ऑपरेटिंग सिस्टम है!

Google Maps ऐसा क्यों चाहता है? हम तीन मुख्य कारण सोच सकते हैं:

**Apple/Bing Maps के खिलाफ प्रतिस्पर्धा करें**

Google Maps Apple Maps और Bing Maps जैसी प्रतिस्पर्धी मैपिंग सेवाओं से भी आगे निकलना चाहता है। एक मालिक जितने व्यावसायिक प्रोफाइल का प्रबंधन करना चाहता है, उनकी संख्या सीमित है: एक बार जब वे Google पर साइन अप कर लेते हैं, तो उनके Apple और Bing से अधिक साइन अप करने की संभावना कम होती है।

**एग्रीगेटर सेवाओं के खिलाफ प्रतिस्पर्धा करें**

Yelp और OpenTable जैसी एग्रीगेटर सेवाएं, हम आपकी बात कर रहे हैं। यदि व्यवसायों को ब्राउज़ करने की अंतिम इच्छा वास्तव में वहां जाना है, तो मैं निश्चित रूप से चाहूंगा कि मैं अपने मैपिंग या नेविगेशन इंटरफ़ेस से सभी समीक्षाएं पढ़ सकूं या आरक्षण कर सकूं, जो आमतौर पर Google Maps है।

Google Maps पहले से ही मेनू, ऑर्डरिंग, आरक्षण, अपॉइंटमेंट, सुविधाओं के मुख्य आकर्षण आदि के लिए एक दुकान के लिंक के लिए सुविधाजनक शॉर्टकट प्रदान करता है। बड़े पैमाने पर उपभोक्ता अपनाने से Yelp/OpenTable/Foursquare से व्यवसायों के उपभोक्ता-सामना वाले पक्ष बहुत चुनौतीपूर्ण स्थिति में आ जाते हैं।

**उपभोक्ताओं को बेहतर सेवाएं प्रदान करें**

उपभोक्ता किसी व्यवसाय के बारे में अधिक विस्तृत और गहन जानकारी चाहते हैं। कभी-कभी उन्हें व्यवसायों तक पहुंचने में परेशानी होती है। कुछ व्यवसायों के पास तो अपना वॉइसमेल इनबॉक्स भी भरा होता है कि कोई वॉइसमेल नहीं छोड़ सकता। Google Maps को सीधे व्यवसाय का प्रबंधन करने के लिए अपनाने से, व्यवसायों को अधिक जानकारी प्रदान करने के लिए प्रोत्साहित किया जाता है जो सीधे उनके Google Maps प्रोफ़ाइल पर दिखाई देगी। बदले में, उपभोक्ता जानकारी के लिए अन्य स्रोतों का सहारा लिए बिना Google Maps पर अधिक समय बिताते हैं।

## Google Maps: वास्तव में उपभोक्ता और व्यवसाय को जोड़ना

पहले, Google Maps उन व्यवसायों को सेवाएं प्रदान करता था जिन्हें Google Cloud पर अपने API प्रदान करके भौगोलिक जानकारी की आवश्यकता होती थी। इस प्रकार कोई भी जल्दी से एक व्यवसाय का नाम टाइप कर सकता है और उसका पता ढूंढ सकता है, या अक्षांश और देशांतर को पते में बदलने के लिए रिवर्स जियोकोडिंग कर सकता है या एक पते पर सभी व्यवसायों को ढूंढ सकता है। Google Maps [HERE Maps](https://www.here.com/) के साथ प्रतिस्पर्धा में उच्च सटीकता मैपिंग और नेविगेशन सेवाएं भी प्रदान करता है, जो कई वाहनों के स्वायत्त ड्राइविंग को शक्ति प्रदान करता है।

लेकिन यह सब पर्दे के पीछे होता है और इसका आम उपभोक्ताओं से ज्यादा लेना-देना नहीं है। फिर एक महत्वपूर्ण बदलाव आता है:

<center>

*क्या आप जानते हैं कि Google Maps उपभोक्ताओं और व्यवसायों के बीच एक चैट ऐप भी है?*
</center>

हाँ, उपभोक्ता अब Google Maps का उपयोग करके Google Maps पर किसी व्यवसाय को संदेश भेज सकते हैं! यह Google का iMessage को एक व्यावसायिक संचार उपकरण के रूप में चुनौती देने का एक और प्रयास है, वाहकों के साथ कठिन लड़ाई के बाद जिन्होंने Android हैंडसेट पर [RCS मैसेजिंग मानक को धीरे-धीरे अपनाया है](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/)।

Google Maps के माध्यम से व्यवसायों को सीधे उपभोक्ताओं से जोड़ना उपभोक्ताओं के खरीदारी अनुभव के लिए एक सहज अनुभव प्रदान करता है। Google के लिए Google Maps को व्यवसायों की स्थानीय खोज के लिए नया ऑपरेटिंग सिस्टम बनाने के लिए यह एक शानदार रणनीतिक कदम है "मेरे पास"।


यदि आपने उपरोक्त प्रश्न का उत्तर "नहीं" दिया है, तो इसका मतलब है कि अपने व्यवसाय का प्रबंधन करने या अपने ग्राहकों को संदेश भेजने के लिए Google Maps का उपयोग करने के लिए अभी भी थोड़ी खोज की आवश्यकता है। कृपया अपने व्यवसाय के लिए Google Maps का उपयोग कैसे करें, इस पर चरण-दर-चरण ट्यूटोरियल के लिए आगे पढ़ें!

## अपने व्यवसायों का प्रबंधन करने के लिए Google Maps का उपयोग कैसे करें, इस पर चरण-दर-चरण ट्यूटोरियल

सबसे पहले, सुनिश्चित करें कि आपने अपने Google Maps ऐप को नवीनतम संस्करण में अपडेट कर लिया है। यहां, हम iOS पर संस्करण 6.12 का उपयोग कर रहे हैं। हम पुष्टि कर सकते हैं कि Android पर संस्करण 11.24 में समान क्षमताएं हैं।

### 1. Google Maps ऐप पर जाएं और अपनी प्रोफ़ाइल पर क्लिक करें।
अपने Google Maps ऐप पर जाएं और सुनिश्चित करें कि आप उसी खाते का उपयोग कर रहे हैं जिसका उपयोग आप Google Maps प्रोफ़ाइल के लिए करते हैं। अपनी प्रोफ़ाइल पर क्लिक करें।

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*Google Maps ऐप इंटरफ़ेस।*
</center>

### 2. "आपके व्यवसाय प्रोफाइल" पर क्लिक करें।
यदि आप अपने व्यवसाय लिस्टिंग से जुड़े सही खाते का उपयोग कर रहे हैं, तो आपको "आपके व्यवसाय प्रोफाइल" विकल्प दिखाई देना चाहिए। "आपके व्यवसाय प्रोफाइल" विकल्प पर क्लिक करें।

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*अपने व्यवसाय प्रोफाइल देखने के लिए "आपके व्यवसाय प्रोफाइल" पर क्लिक करें।*
</center>

### 3. उस व्यवसाय का चयन करें जिसे आप अपडेट करना चाहते हैं।

यदि आपके पास कई व्यवसाय हैं, तो आपको अपने सभी व्यवसाय दिखाई देने चाहिए। उस व्यवसाय का चयन करें जिसे आप इस समय अपडेट या प्रबंधित करना चाहते हैं। हमारे उदाहरण में, हम Seasalt AI का प्रबंधन करना चाहते हैं।


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*हम उन व्यवसायों को देख सकते हैं जिन्हें हम वर्तमान में प्रबंधित करते हैं।*
</center>

### 4. "प्रोफ़ाइल संपादित करें" विकल्प पर क्लिक करें।
एक बार जब आप "प्रोफ़ाइल संपादित करें" बटन पर क्लिक करते हैं, तो आप वह सभी जानकारी देख सकते हैं जिसे आप संशोधित कर सकते हैं। इसमें व्यवसाय की जानकारी, संचालन के घंटे, लोगो और कवर फोटो शामिल हैं। इस ट्यूटोरियल के उद्देश्य के लिए, हम व्यवसाय की जानकारी अपडेट करेंगे।


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*"प्रोफ़ाइल संपादित करें" बटन पर क्लिक करें।*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*आपके व्यवसाय के बारे में आप जो जानकारी संशोधित कर सकते हैं।*
</center>


### 5. कोई भी जानकारी चुनें जिसे आप संशोधित करना चाहते हैं।

एक बार जब आप व्यवसाय की जानकारी पर क्लिक करते हैं, तो आप वह जानकारी देख सकते हैं जिसे आप संशोधित कर सकते हैं जैसे व्यवसाय का नाम, व्यवसाय श्रेणी, फोन नंबर, वेबसाइट, और बहुत कुछ। आप कोई भी जानकारी चुन सकते हैं जिसे आप अपडेट करना चाहते हैं।


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*व्यवसाय जानकारी विकल्प जिन्हें आप संशोधित कर सकते हैं।*
</center>


Google My Business को Google Maps और Search से बदलना व्यवसाय मालिकों और Google के लिए पूरी तरह से समझ में आता है। व्यवसायों के लिए, यह उनकी व्यावसायिक जानकारी का प्रबंधन करने के लिए एक कम ऐप है। इस कदम के साथ, Google Maps वास्तव में उपभोक्ताओं और व्यवसायों को भी जोड़ रहा है। उपभोक्ता अब Google Maps के साथ Google Maps पर किसी व्यवसाय को संदेश भेज सकते हैं, और इसके विपरीत। Google Maps के माध्यम से उपभोक्ताओं से जुड़ना उपभोक्ताओं के लिए एक सहज अनुभव भी प्रदान करता है। Google के लिए, व्यवसाय मालिकों के लिए चीजों को आसान बनाने का मतलब व्यवसायों को अधिक अपनाना है।

Google पर सीधे अपने व्यवसाय प्रोफ़ाइल को कैसे प्रबंधित करें, इसके बारे में अधिक जानें [यहां](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid)। [LinkedIn](https://www.linkedin.com/company/seasalt-ai) पर हमें फॉलो करके हमसे जुड़े रहें!
`;export{e as default};
