const e=`---
title: "Google My Business-க்கு விடைபெறுங்கள், இப்போது Google Maps வணிகங்களுக்கான புதிய OS ஆக உள்ளது"
metatitle: "GMB-க்கு விடைபெறுங்கள், Google Maps வணிகங்களுக்கான புதிய OS ஆக உள்ளது"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "Google My Business பயன்பாட்டை Google Maps மூலம் Google மாற்றுகிறது, அங்கு வணிகங்கள் தங்கள் தகவல்களை நிர்வகிக்கலாம் மற்றும் Google Maps இல் வாடிக்கையாளர்களின் செய்திகளுக்கு பதிலளிக்கலாம்."
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*Google Maps மூலம் வணிகங்களை நுகர்வோருடன் நேரடியாக இணைப்பது, நுகர்வோரின் ஷாப்பிங் அனுபவத்திற்கு தடையற்ற அனுபவத்தை வழங்குகிறது. Google Maps ஐ "எனக்கு அருகிலுள்ள" வணிகங்களுக்கான உள்ளூர் தேடலுக்கான புதிய இயக்க முறைமையாக மாற்றுவதற்கு Google க்கு இது ஒரு சிறந்த மூலோபாய நகர்வு.*


Google My Business பயன்பாட்டைப் பயன்படுத்தும் 10 மில்லியன் வணிக உரிமையாளர்கள் சமீபத்தில் Google My Business ஐ Google Maps மற்றும் Search மூலம் மாற்றுவதாக ஒரு செய்தியைப் பெற்றிருக்கலாம்:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google My Business அதிகாரப்பூர்வமாக ஓய்வு பெறுகிறது.*
</center>

இரண்டு அவதானிப்புகளின் அடிப்படையில், Google பயன்பாட்டைப் பற்றி ஏதாவது செய்யும் என்று நீண்ட காலமாக வதந்தி பரவியது:
1. Google My Business இன் ஆன்லைன் வலைப் பதிப்பு சமீபத்தில் Google Business Profile என மறுபெயரிடப்பட்டது.
2. Google இல் உங்கள் சொந்த வணிகத்தைத் தேடியவுடன் Google Search மூலம் ஒரு வணிகத்தை நேரடியாக நிர்வகிக்க Google உதவுகிறது.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*Google Search மூலம் ஒரு வணிகத்தை நிர்வகித்தல்.*
</center>

Google My Business (பயன்பாடு) ஐ Google Business Profile என மறுபெயரிடும் என்று நாங்கள் சந்தேகித்தோம், அதன் வலைப் பதிப்பின் பெயருடன் ஒத்திசைந்து. எல்லாவற்றிற்கும் மேலாக, Google ஏற்கனவே அதன் தயாரிப்பு குடும்பத்தைக் கண்டுபிடித்ததாகத் தெரிகிறது: **Google Business Profile** மற்றும் **Google Business Messages**. எனவே, அன்பான Google My Business பயன்பாட்டை Google முழுமையாக நீக்குகிறது என்ற செய்தி ஆச்சரியமாக இருந்தது.

இது வணிக உரிமையாளர்களுக்கும் Google க்கும் ஏதேனும் அர்த்தம் உள்ளதா? இது நிச்சயமாக சில வழிகளில் அர்த்தம் தருகிறது. இந்த நகர்வைப் பற்றி நாங்கள் என்ன நினைக்கிறோம் என்பது இங்கே.

## வணிகங்களுக்கு: ஒரு குறைவான பயன்பாடு மற்றும் அதிக சூழல்

கூடுதல் பயன்பாட்டைப் பதிவிறக்கும் தேவையை நீக்குவது SME உரிமையாளர்களுக்கு நன்றாக உதவுகிறது. ஏன்? ஏனெனில் இது ஒரு சிறிய கடை என்றாலும், ஒரு வணிகத்திற்கு பொதுவாக ஒன்றுக்கு மேற்பட்ட மேலாளர்கள் இருப்பார்கள், மேலும் ஒவ்வொருவரும் பயன்பாட்டைப் பதிவிறக்கி நிறுவ வேண்டும். உதாரணமாக, கடை உரிமையாளர்கள் பெரும்பாலும் தங்கள் மேலாளர்கள் அல்லது ஊழியர்களுக்கு வாடிக்கையாளர்களுக்கு புதுப்பிப்புகளை வழங்க அனுமதிப்பார்கள், அதாவது கேள்விகளுக்கு பதிலளிப்பது, மதிப்புரைகளுக்கு பதிலளிப்பது மற்றும் கடை/விடுமுறை நேரங்களில் திடீர் மாற்றங்கள்.

ஊழியர்கள் பெரும்பாலும் “Google My Business” பயன்பாட்டைப் பயன்படுத்தி மாற்றங்களைச் செய்ய நினைவில் கொள்ள வேண்டும். இப்போது அது எளிது: Google Maps ஐத் திறந்தால் போதும், பெரும்பாலான மக்கள் அதை ஏற்கனவே வைத்திருக்கிறார்கள். இது உரிமையாளர்கள் மற்றும் ஊழியர்கள் இருவருக்கும் ஒரு பெரிய நேர சேமிப்பு.

மேலும், ஒருவர் Google Maps ஐத் திறக்கும் ஒவ்வொரு முறையும், அக்கம் பக்கத்தில் உள்ள போட்டி மற்றும் நிரப்பு வணிகங்களை ஒருவர் காண்கிறார். இந்தத் தகவலில் பெரும்பாலும் மதிப்புரைகள், தரவரிசைகள் மற்றும் பிற வணிகங்கள் எவ்வளவு பிஸியாக உள்ளன என்பதும் அடங்கும். முன்பு Google My Business ஐத் திறக்கும்போது, உரிமையாளர்கள் தங்கள் சொந்த வணிகத்தை மட்டுமே பார்த்தார்கள். இப்போது Google Maps பயன்பாட்டின் மூலம், உரிமையாளர்கள் முதலில் அனைத்து வணிகங்களையும் அதிக சூழலுடன் பார்க்கிறார்கள்.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*இடமிருந்து வலமாக: Google My Business மற்றும் Google Maps உங்கள் வணிகத்தை நிர்வகிப்பதற்கான இடைமுகங்கள்.*
</center>

## Google க்கு: வணிகங்களின் அதிக தத்தெடுப்பு

Google Maps இல் எந்த ஒரு சீரற்ற பகுதியையும் திறந்தால், உரிமையாளர்களால் Google உடன் "உரிமைகோரப்படாத" வணிக சுயவிவரங்களை உடனடியாகக் காணலாம். உரிமையாளர்கள் நுகர்வோரின் மதிப்புரைகளைப் பார்க்கிறார்கள், சில சமயங்களில் கருத்துக்களை எவ்வாறு வழங்குவது என்று தெரியவில்லை. ஏனென்றால் அவர்கள் அதைச் செய்ய மற்றொரு பயன்பாட்டைப் பயன்படுத்த வேண்டியிருந்தது.

உரிமையாளர்கள் தங்கள் வணிகத்துடன் இணைந்து செயல்பட உதவ, Google வணிக உரிமையாளர்களுக்கு பயிற்சி, கருவிகள் மற்றும் ஆதாரங்களை வழங்க [Grow With Google](https://grow.google/intl/ALL_ca/) ஐத் தொடங்கியுள்ளது. இருப்பினும், ஒரு பயன்பாடு தடையாக உள்ளது. ஒரு வணிக உரிமையாளர் Google Maps இல் தங்கள் வணிகத்தைப் பார்த்து, தங்கள் வணிகத்தை உடனடியாக உரிமைகோரலாம் மற்றும் கட்டுப்படுத்தலாம் (சரிபார்ப்புக்குப் பிறகு) என்று உணர்ந்தால், Google Business Profile இன் தத்தெடுப்பு மிகவும் எளிதாக இருக்கும்.

## ஏன் Google Maps? இது நமது பௌதிக உலகின் இயக்க முறைமை!

Google Maps ஏன் இதை விரும்புகிறது? மூன்று முக்கிய காரணங்களை நாம் சிந்திக்கலாம்:

**Apple/Bing Maps உடன் போட்டியிடுங்கள்**

Google Maps ஆனது Apple Maps மற்றும் Bing Maps போன்ற போட்டி மேப்பிங் சேவைகளை விட முன்னணியில் இருக்க விரும்புகிறது. ஒரு உரிமையாளர் நிர்வகிக்க விரும்பும் வணிக சுயவிவரங்களின் எண்ணிக்கை குறைவாக உள்ளது: அவர்கள் Google இல் பதிவுசெய்தவுடன், Apple மற்றும் Bing இலிருந்து மேலும் பதிவுசெய்ய வாய்ப்பில்லை.

**அக்ரிகேட்டர் சேவைகளுக்கு எதிராக போட்டியிடுங்கள்**

Yelp மற்றும் OpenTable போன்ற அக்ரிகேட்டர் சேவைகள், நாங்கள் உங்களைப் பற்றி பேசுகிறோம். வணிகங்களை உலாவியதன் இறுதி விருப்பம் உண்மையில் அங்கு செல்வதாக இருந்தால், எனது மேப்பிங் அல்லது வழிசெலுத்தல் இடைமுகத்திலிருந்து, அதாவது Google Maps இலிருந்து அனைத்து மதிப்புரைகளையும் படிக்க அல்லது முன்பதிவு செய்ய நான் நிச்சயமாக விரும்புவேன்.

Google Maps ஏற்கனவே ஒரு கடையின் மெனு, ஆர்டர் செய்தல், முன்பதிவு செய்தல், சந்திப்புகள், வசதிகள் சிறப்பம்சங்கள் போன்றவற்றுக்கான இணைப்புகளுக்கு வசதியான குறுக்குவழிகளை வழங்குகிறது. பாரிய நுகர்வோர் தத்தெடுப்பு Yelp/OpenTable/Foursquare இலிருந்து வணிகங்களின் நுகர்வோர் சார்ந்த பக்கங்களை மிகவும் சவாலான சூழ்நிலையில் வைக்கிறது.

**நுகர்வோருக்கு சிறந்த சேவைகளை வழங்குங்கள்**

நுகர்வோர் ஒரு வணிகத்தைப் பற்றி மேலும் விரிவான மற்றும் முழுமையான தகவல்களை விரும்புகிறார்கள். சில சமயங்களில் வணிகங்களை அணுக அவர்களுக்கு சிரமம் ஏற்படுகிறது. சில வணிகங்களில் அவர்களின் குரல் அஞ்சல் இன்பாக்ஸ் நிரம்பியிருப்பதால், ஒருவர் குரல் அஞ்சலை விட முடியாது. Google Maps ஐப் பயன்படுத்தி வணிகத்தை நேரடியாக நிர்வகிப்பதன் மூலம், வணிகங்கள் தங்கள் Google Maps சுயவிவரத்தில் நேரடியாக பிரதிபலிக்கும் அதிக தகவல்களை வழங்க ஊக்குவிக்கப்படுகின்றன. அதற்கு ஈடாக, நுகர்வோர் Google Maps இல் அதிக நேரம் செலவிடுகிறார்கள், தகவலுக்காக மற்ற ஆதாரங்களை நாடாமல்.

## Google Maps: நுகர்வோர் மற்றும் வணிகத்தை உண்மையிலேயே இணைக்கிறது

முன்பு, Google Maps ஆனது Google Cloud இல் அதன் API களை வழங்குவதன் மூலம் புவியியல் தகவல் தேவைப்படும் வணிகங்களுக்கு சேவைகளை வழங்கியது. இதனால் ஒருவர் ஒரு வணிகப் பெயரை விரைவாகத் தட்டச்சு செய்து அதன் முகவரியைக் கண்டறியலாம், அல்லது அட்சரேகை மற்றும் தீர்க்கரேகையை ஒரு முகவரியாக மாற்ற அல்லது ஒரு முகவரியில் உள்ள அனைத்து வணிகங்களையும் கண்டறிய தலைகீழ் புவி குறியீட்டைச் செய்யலாம். Google Maps ஆனது [HERE Maps](https://www.here.com/) உடன் போட்டியிட்டு உயர் துல்லியமான மேப்பிங் மற்றும் வழிசெலுத்தல் சேவைகளையும் வழங்குகிறது, இது பல வாகனங்களின் தன்னாட்சி ஓட்டத்தை இயக்குகிறது.

ஆனால் இவை அனைத்தும் திரைக்குப் பின்னால் நடக்கின்றன, மேலும் அன்றாட நுகர்வோருடன் அதிகம் சம்பந்தப்படவில்லை. பின்னர் ஒரு குறிப்பிடத்தக்க மாற்றம் வருகிறது:

<center>

*Google Maps ஒரு அரட்டை பயன்பாடு என்பதும் உங்களுக்குத் தெரியுமா?*
</center>

ஆம், நுகர்வோர் இப்போது Google Maps ஐப் பயன்படுத்தி Google Maps இல் ஒரு வணிகத்திற்கு செய்தி அனுப்பலாம்! Android கைபேசியில் [RCS செய்தியிடல் தரநிலையை மெதுவாக ஏற்றுக்கொண்ட](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/) கேரியர்களுடன் கடினமான போராட்டங்களுக்குப் பிறகு, வணிக தொடர்பு கருவியாக iMessage ஐ சவால் செய்ய Google இன் மற்றொரு முயற்சி இது.

Google Maps மூலம் வணிகங்களை நுகர்வோருடன் நேரடியாக இணைப்பது, நுகர்வோரின் ஷாப்பிங் அனுபவத்திற்கு தடையற்ற அனுபவத்தை வழங்குகிறது. Google Maps ஐ "எனக்கு அருகிலுள்ள" வணிகங்களுக்கான உள்ளூர் தேடலுக்கான புதிய இயக்க முறைமையாக மாற்றுவதற்கு Google க்கு இது ஒரு சிறந்த மூலோபாய நகர்வு.


மேலே உள்ள கேள்விக்கு நீங்கள் "இல்லை" என்று பதிலளித்திருந்தால், உங்கள் வணிகத்தை நிர்வகிக்க அல்லது உங்கள் வாடிக்கையாளர்களுக்கு செய்தி அனுப்ப Google Maps ஐப் பயன்படுத்த இன்னும் கொஞ்சம் கண்டுபிடிப்பு தேவை என்று அர்த்தம். உங்கள் வணிகத்திற்காக Google Maps ஐ எவ்வாறு பயன்படுத்துவது என்பது குறித்த படிப்படியான பயிற்சிக்காக தொடர்ந்து படிக்கவும்!

## உங்கள் வணிகங்களை நிர்வகிக்க Google Maps ஐ எவ்வாறு பயன்படுத்துவது என்பது குறித்த படிப்படியான பயிற்சி

முதலில், உங்கள் Google Maps பயன்பாட்டை சமீபத்திய பதிப்பிற்கு புதுப்பித்துள்ளீர்கள் என்பதை உறுதிப்படுத்தவும். இங்கே, நாங்கள் iOS இல் பதிப்பு 6.12 ஐப் பயன்படுத்துகிறோம். Android இல் பதிப்பு 11.24 அதே திறன்களைக் கொண்டுள்ளது என்பதை நாங்கள் உறுதிப்படுத்த முடியும்.

### 1. Google Maps பயன்பாட்டிற்குச் சென்று உங்கள் சுயவிவரத்தைக் கிளிக் செய்யவும்.
உங்கள் Google Maps பயன்பாட்டிற்குச் சென்று, Google Maps சுயவிவரத்திற்காக நீங்கள் பயன்படுத்தும் அதே கணக்கைப் பயன்படுத்துகிறீர்கள் என்பதை உறுதிப்படுத்தவும். உங்கள் சுயவிவரத்தைக் கிளிக் செய்யவும்.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*Google Maps பயன்பாட்டு இடைமுகம்.*
</center>

### 2. "உங்கள் வணிக சுயவிவரங்கள்" என்பதைக் கிளிக் செய்யவும்.
உங்கள் வணிகப் பட்டியலுடன் தொடர்புடைய சரியான கணக்கைப் பயன்படுத்துகிறீர்கள் என்றால், "உங்கள் வணிக சுயவிவரங்கள்" விருப்பத்தை நீங்கள் பார்க்க முடியும். "உங்கள் வணிக சுயவிவரங்கள்" விருப்பத்தைக் கிளிக் செய்யவும்.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*உங்கள் வணிக சுயவிவரங்களைக் காண "உங்கள் வணிக சுயவிவரங்கள்" என்பதைக் கிளிக் செய்யவும்.*
</center>

### 3. நீங்கள் புதுப்பிக்க விரும்பும் வணிகத்தைத் தேர்ந்தெடுக்கவும்.

உங்களுக்கு பல வணிகங்கள் இருந்தால், உங்கள் வணிகங்கள் அனைத்தையும் நீங்கள் பார்க்க முடியும். நீங்கள் தற்போது புதுப்பிக்க அல்லது நிர்வகிக்க விரும்பும் வணிகத்தைத் தேர்ந்தெடுக்கவும். எங்கள் எடுத்துக்காட்டில், நாங்கள் Seasalt AI ஐ நிர்வகிக்க விரும்புகிறோம்.


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*நாங்கள் தற்போது நிர்வகிக்கும் வணிகங்களை நாங்கள் காணலாம்.*
</center>

### 4. "சுயவிவரத்தைத் திருத்து" விருப்பத்தைக் கிளிக் செய்யவும்.
"சுயவிவரத்தைத் திருத்து" பொத்தானைக் கிளிக் செய்தவுடன், நீங்கள் மாற்றக்கூடிய அனைத்து தகவல்களையும் நீங்கள் காணலாம். இதில் வணிகத் தகவல், செயல்பாட்டு நேரம், லோகோ மற்றும் அட்டைப் படம் ஆகியவை அடங்கும். இந்த பயிற்சிக்காக, நாங்கள் வணிகத் தகவலைப் புதுப்பிப்போம்.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*"சுயவிவரத்தைத் திருத்து" பொத்தானைக் கிளிக் செய்யவும்.*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*உங்கள் வணிகத்தைப் பற்றி நீங்கள் மாற்றக்கூடிய தகவல்கள்.*
</center>


### 5. நீங்கள் மாற்ற விரும்பும் எந்த தகவலையும் தேர்ந்தெடுக்கவும்.

வணிகத் தகவலைக் கிளிக் செய்தவுடன், வணிகப் பெயர், வணிக வகை, தொலைபேசி எண், வலைத்தளம் மற்றும் பலவற்றை நீங்கள் மாற்றக்கூடிய தகவல்களை நீங்கள் காணலாம். நீங்கள் புதுப்பிக்க விரும்பும் எந்த தகவலையும் நீங்கள் தேர்ந்தெடுக்கலாம்.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*நீங்கள் மாற்றக்கூடிய வணிகத் தகவல் விருப்பங்கள்.*
</center>


Google My Business ஐ Google Maps மற்றும் Search மூலம் மாற்றுவது வணிக உரிமையாளர்களுக்கும் Google க்கும் சரியான அர்த்தத்தை தருகிறது. வணிகங்களுக்கு, தங்கள் வணிகத் தகவலை நிர்வகிக்க ஒரு குறைவான பயன்பாடு இது. இந்த நகர்வுடன், Google Maps நுகர்வோர் மற்றும் வணிகங்களை உண்மையிலேயே இணைக்கிறது. நுகர்வோர் இப்போது Google Maps ஐப் பயன்படுத்தி Google Maps இல் ஒரு வணிகத்திற்கு செய்தி அனுப்பலாம், மற்றும் நேர்மாறாகவும். Google Maps மூலம் நுகர்வோருடன் இணைப்பது நுகர்வோருக்கு தடையற்ற அனுபவத்தையும் வழங்குகிறது. Google க்கு, வணிக உரிமையாளர்களுக்கு விஷயங்களை எளிதாக்குவது வணிகங்களின் அதிக தத்தெடுப்பைக் குறிக்கிறது.

[Google இல் உங்கள் வணிக சுயவிவரத்தை நேரடியாக எவ்வாறு நிர்வகிப்பது](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid) என்பதைப் பற்றி மேலும் அறிக. [LinkedIn](https://www.linkedin.com/company/seasalt-ai) இல் எங்களைப் பின்தொடர்வதன் மூலம் எங்களுடன் இணைந்திருங்கள்!`;export{e as default};
