const o=`---
title: "さようならGoogleマイビジネス、Googleマップがビジネスの新しいOSに"
metatitle: "さようならGMB、Googleマップがビジネスの新しいOSに"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "GoogleはGoogleマイビジネスアプリをGoogleマップに置き換えています。これにより、企業はGoogleマップ上で情報を管理し、顧客のメッセージに返信できるようになります。"
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*Googleマップを通じて企業と消費者を直接つなぐことで、消費者のショッピング体験がシームレスになります。これは、GoogleがGoogleマップを「近くの」ビジネスのローカル検索のための新しいオペレーティングシステムに変えるための素晴らしい戦略的動きです。*


Googleマイビジネスアプリを利用している1000万人の事業主は、最近、GoogleマイビジネスがGoogleマップと検索に置き換えられるというメッセージを受け取ったかもしれません。

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Googleマイビジネスは正式に引退します。*
</center>

Googleがアプリについて何かをするだろうと長い間噂されていました。これは2つの観察に基づいています。
1. Googleマイビジネスのオンラインウェブ版は、最近Googleビジネスプロフィールに改名されました。
2. Googleで自分のビジネスを検索すると、Google検索を通じてビジネスを直接管理できるようになりました。


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*Google検索を通じてビジネスを管理する。*
</center>

GoogleがGoogleマイビジネス（アプリ）を、ウェブ版の名前と同期してGoogleビジネスプロフィールに改名するだけだと私たちは推測していました。結局のところ、Googleはすでに製品ファミリーを把握しているようです。**Googleビジネスプロフィール**と**Googleビジネスメッセージ**です。したがって、Googleが愛されていたGoogleマイビジネスアプリを完全に段階的に廃止するというニュースは驚きでした。

これは事業主とGoogleにとって意味があるのでしょうか？確かにいくつかの点で意味があります。この動きについて私たちがどう考えているかをご紹介します。

## ビジネス向け：アプリが1つ減り、より多くのコンテキスト

追加のアプリをダウンロードする必要がなくなることは、中小企業のオーナーにとって非常に役立ちます。なぜでしょうか？たとえそれが小さな家族経営の店であっても、通常は複数のマネージャーがビジネスに関わっており、それぞれがアプリをダウンロードしてインストールする必要があります。たとえば、店舗のオーナーは、マネージャーや従業員に、質問への回答、レビューへの返信、さらには店舗の営業時間や休日の急な変更など、顧客への最新情報を提供する許可を与えることがよくあります。

従業員は変更を行うために「Googleマイビジネス」アプリを使用することを覚えておく必要がありました。今では簡単です。Googleマップを開くだけで、ほとんどの人がすでに持っています。これはオーナーと従業員の両方にとって大幅な時間節約になります。

また、Googleマップを開くたびに、近隣の競合するビジネスや補完的なビジネスがより多く表示されます。この情報には、レビュー、ランキング、他のビジネスの混雑状況などが含まれることがよくあります。以前はGoogleマイビジネスを開くと、オーナーは自分のビジネスしか見ることができませんでした。しかし、Googleマップアプリでは、オーナーはまず、より多くのコンテキストですべてのビジネスを見ることができます。


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*左から右へ：GoogleマイビジネスとGoogleマップのビジネス管理インターフェース。*
</center>

## Google向け：ビジネスの採用拡大

Googleマップで任意の場所を開くと、オーナーがGoogleで「申請」していないビジネスプロフィールがすぐに見つかります。オーナーは消費者のレビューを見て、フィードバックの提供方法がわからない場合があります。なぜなら、彼らはそれを行うために別のアプリを使用しなければならなかったからです。

オーナーがビジネスを軌道に乗せるのを支援するため、Googleは[Grow With Google](https://grow.google/intl/ALL_ca/)を開始し、事業主向けにトレーニング、ツール、リソースを提供しています。それでも、障壁はアプリ1つ分です。事業主がGoogleマップで自分のビジネスを見て、すぐにビジネスを申請して管理できる（確認後）ことに気づけば、Googleビジネスプロフィールの採用ははるかに簡単になるでしょう。

## なぜGoogleマップなのか？それは私たちの物理世界のOSだからです！

なぜGoogleマップはこれを望んでいるのでしょうか？主な理由は3つ考えられます。

**Apple/Bingマップとの競争**

Googleマップは、AppleマップやBingマップなどの競合する地図サービスよりもさらに優位に立ちたいと考えています。オーナーが管理したいビジネスプロフィールの数には限りがあります。一度Googleに登録すれば、AppleやBingからさらに登録する可能性は低くなります。

**アグリゲーターサービスとの競争**

YelpやOpenTableのようなアグリゲーターサービス、あなたのことです。ビジネスを閲覧する最終的な目的が実際にそこに行くことであるならば、私は確かに、通常Googleマップである私の地図作成またはナビゲーションインターフェースからすべてのレビューを読んだり、予約したりできることを望みます。

Googleマップはすでに、メニュー、注文、予約、アポイントメント、アメニティのハイライトなど、店舗のリンクへの便利なショートカットを提供しています。大規模な消費者採用は、Yelp/OpenTable/Foursquareからのビジネスの消費者向け側面を非常に困難な状況に置くことは間違いありません。

**消費者へのより良いサービスの提供**

消費者はビジネスについてより詳細で徹底的な情報を求めています。時には、ビジネスに連絡するのに苦労することもあります。一部のビジネスでは、ボイスメールの受信箱がいっぱいで、ボイスメールを残せないことさえあります。Googleマップを採用してビジネスを直接管理することで、ビジネスはGoogleマップのプロフィールに直接反映されるより多くの情報を提供するよう奨励されます。その見返りとして、消費者は他の情報源に頼ることなく、Googleマップに長く滞在します。

## Googleマップ：消費者とビジネスを真に結びつける

以前、GoogleマップはGoogle Cloud上でAPIを提供することで、地理情報が必要な企業にサービスを提供していました。これにより、企業名を素早く入力してその住所を検索したり、逆ジオコーディングを行って緯度経度を住所に変換したり、ある住所にあるすべての企業を検索したりすることができました。Googleマップはまた、多くの車両の自動運転を支える[HERE Maps](https://www.here.com/)と競合して、高精度の地図作成およびナビゲーションサービスを提供しています。

しかし、これらはすべて舞台裏で行われることであり、一般の消費者とはあまり関係ありません。そして、大きな変化が訪れます。

<center>

*Googleマップが消費者とビジネス間のチャットアプリでもあることをご存知でしたか？*
</center>

はい、消費者はGoogleマップを使ってGoogleマップ上のビジネスにメッセージを送れるようになりました！これは、Android端末での[RCSメッセージング標準の採用が遅れている](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/)キャリアとの困難な戦いの後、GoogleがiMessageをビジネスコミュニケーションツールとして挑戦するもう一つの試みです。

Googleマップを通じて企業と消費者を直接つなぐことで、消費者のショッピング体験がシームレスになります。これは、GoogleがGoogleマップを「近くの」ビジネスのローカル検索のための新しいオペレーティングシステムに変えるための素晴らしい戦略的動きです。


上記の質問に「いいえ」と答えた場合、それはGoogleマップを使用してビジネスを管理したり、顧客にメッセージを送信したりするには、まだ少し発見が必要であることを意味します。ビジネスでGoogleマップを使用する方法のステップバイステップチュートリアルについては、引き続きお読みください！

## Googleマップを使用してビジネスを管理する方法のステップバイステップチュートリアル

まず、Googleマップアプリを最新バージョンに更新してください。ここでは、iOS版6.12を使用しています。Android版11.24でも同じ機能が利用できることを確認しています。

### 1. Googleマップアプリを開き、プロフィールをクリックします。
Googleマップアプリを開き、Googleマッププロフィールに使用しているのと同じアカウントを使用していることを確認します。プロフィールをクリックします。

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*Googleマップアプリのインターフェース。*
</center>

### 2. 「あなたのビジネスプロフィール」をクリックします。
ビジネスリスティングに関連付けられた正しいアカウントを使用している場合、「あなたのビジネスプロフィール」オプションが表示されるはずです。「あなたのビジネスプロフィール」オプションをクリックします。

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*「あなたのビジネスプロフィール」をクリックして、ビジネスプロフィールを表示します。*
</center>

### 3. 更新したいビジネスを選択します。

複数のビジネスをお持ちの場合は、すべてのビジネスが表示されるはずです。現在更新または管理したいビジネスを選択します。この例では、Seasalt AIを管理したいと考えています。


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*現在管理しているビジネスを見ることができます。*
</center>

### 4. 「プロフィールを編集」オプションをクリックします。
「プロフィールを編集」ボタンをクリックすると、変更できるすべての情報が表示されます。これには、ビジネス情報、営業時間、ロゴ、カバー写真が含まれます。このチュートリアルの目的のために、ビジネス情報を更新します。


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*「プロフィールを編集」ボタンをクリックします。*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*ビジネスについて変更できる情報。*
</center>


### 5. 変更したい情報を選択します。

ビジネス情報をクリックすると、ビジネス名、ビジネスカテゴリ、電話番号、ウェブサイトなど、変更できる情報が表示されます。更新したい情報を選択できます。


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*変更できるビジネス情報オプション。*
</center>


GoogleマイビジネスがGoogleマップと検索に置き換えられたことは、事業主とGoogleにとって完全に理にかなっています。ビジネスにとって、ビジネス情報を管理するためにダウンロードするアプリが1つ減ります。この動きにより、Googleマップは消費者とビジネスを真に結びつけています。消費者はGoogleマップでGoogleマップを使ってビジネスにメッセージを送ることができ、その逆も可能です。Googleマップを通じて消費者とつながることは、消費者にとってもシームレスな体験を提供します。Googleにとって、事業主にとって物事をより簡単にすることは、ビジネスの採用を増やすことを意味します。

[Googleで直接ビジネスプロフィールを管理する方法](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid)について詳しく学びましょう。[LinkedIn](https://www.linkedin.com/company/seasalt-ai)でフォローして、私たちとつながりましょう！
`;export{o as default};
