const e=`---
title: "خداحافظ Google My Business، اکنون Google Maps سیستم عامل جدیدی برای کسب و کارها است"
metatitle: "خداحافظ GMB، Google Maps سیستم عامل جدیدی برای کسب و کارها است"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-27 05:06:58+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "گوگل در حال جایگزینی برنامه Google My Business با Google Maps است، جایی که کسب و کارها می توانند اطلاعات خود را مدیریت کرده و به پیام های مشتریان در Google Maps پاسخ دهند."
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*اتصال مستقیم کسب و کارها با مصرف کنندگان از طریق Google Maps تجربه ای یکپارچه را برای تجربه خرید مصرف کنندگان فراهم می کند. این یک حرکت استراتژیک عالی برای گوگل است تا Google Maps را به سیستم عامل جدیدی برای جستجوی محلی کسب و کارهای "نزدیک من" تبدیل کند.*


10 میلیون صاحب کسب و کار که از برنامه Google My Business استفاده می کنند، ممکن است اخیراً پیامی دریافت کرده باشند که در آن جایگزینی Google My Business با Google Maps و Search اعلام شده است:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google My Business رسماً بازنشسته می شود.*
</center>

مدت ها بود که شایعه شده بود گوگل با توجه به دو مشاهده، کاری در مورد این برنامه انجام خواهد داد:
1. نسخه وب آنلاین Google My Business اخیراً به Google Business Profile تغییر نام داده است.
2. گوگل به شما امکان می دهد تا با جستجوی کسب و کار خود در گوگل، مستقیماً آن را از طریق جستجوی گوگل مدیریت کنید.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*مدیریت یک کسب و کار از طریق جستجوی گوگل.*
</center>

ما گمان می کردیم که گوگل به سادگی Google My Business (برنامه) را به Google Business Profile تغییر نام خواهد داد تا با نام نسخه وب آن هماهنگ شود. با این حال، گوگل به نظر می رسد که خانواده محصولات خود را قبلاً مشخص کرده است: **Google Business Profile** و **Google Business Messages**. بنابراین، خبر حذف کامل برنامه محبوب Google My Business برای ما غافلگیرکننده بود.

آیا این برای صاحبان کسب و کار و گوگل منطقی است؟ قطعاً از چند جهت مختلف منطقی است. در اینجا نظر ما در مورد این حرکت آمده است.

## برای کسب و کارها: یک برنامه کمتر و زمینه بیشتر

حذف نیاز به دانلود یک برنامه اضافی برای صاحبان SME بسیار مفید است. چرا؟ زیرا حتی اگر یک کسب و کار کوچک خانوادگی باشد، معمولاً بیش از یک مدیر برای یک کسب و کار وجود دارد و هر یک از آنها باید برنامه را دانلود و نصب کنند. به عنوان مثال، صاحبان فروشگاه اغلب به مدیران یا کارمندان خود اجازه می دهند تا به مشتریان به روز رسانی هایی ارائه دهند، مانند پاسخ به سوالات، پاسخ به نظرات، و حتی تغییرات ناگهانی در ساعات کاری/تعطیلات.

کارمندان اغلب باید به یاد داشته باشند که برای ایجاد تغییرات از برنامه "Google My Business" استفاده کنند. اکنون آسان است: فقط Google Maps را باز کنید و اکثر مردم آن را از قبل دارند. این کار باعث صرفه جویی زیادی در وقت هم برای صاحبان و هم برای کارمندان می شود.

همچنین، هر بار که Google Maps را باز می کنید، کسب و کارهای رقیب و مکمل بیشتری را در محله مشاهده می کنید. این اطلاعات اغلب شامل نظرات، رتبه بندی ها و میزان شلوغی سایر کسب و کارها است. قبلاً هنگام باز کردن Google My Business، صاحبان فقط کسب و کار خود را می دیدند. اکنون با برنامه Google Maps، صاحبان ابتدا همه کسب و کارها را با زمینه بیشتری مشاهده می کنند.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*از چپ به راست: رابط های Google My Business و Google Maps برای مدیریت کسب و کار شما.*
</center>

## برای گوگل: پذیرش بیشتر کسب و کارها

هر منطقه تصادفی را در Google Maps باز کنید، بلافاصله می توانید پروفایل های کسب و کاری را پیدا کنید که توسط صاحبان آنها در گوگل "ادعا" نشده اند. صاحبان به نظرات مصرف کنندگان نگاه می کنند و گاهی اوقات نمی دانند چگونه بازخورد ارائه دهند. زیرا آنها مجبور بودند برای انجام این کار از برنامه دیگری استفاده کنند.

برای کمک به صاحبان کسب و کار در مسیر درست، گوگل [Grow With Google](https://grow.google/intl/ALL_ca/) را راه اندازی کرده است تا آموزش، ابزار و منابع را در اختیار صاحبان کسب و کار قرار دهد. با این حال، مانع هنوز یک برنامه فاصله دارد. اگر یک صاحب کسب و کار به کسب و کار خود در Google Maps نگاه کند و متوجه شود که می تواند بلافاصله کسب و کار خود را ادعا کرده و کنترل کند (پس از تأیید)، آنگاه پذیرش Google Business Profile بسیار آسان تر خواهد بود.

## چرا Google Maps؟ این سیستم عامل دنیای فیزیکی ماست!

چرا Google Maps این را می خواهد؟ می توانیم سه دلیل اصلی را در نظر بگیریم:

**رقابت با Apple/Bing Maps**

Google Maps می خواهد حتی از خدمات نقشه برداری رقیب مانند Apple Maps و Bing Maps نیز جلوتر باشد. تعداد محدودی از پروفایل های کسب و کار وجود دارد که یک صاحب کسب و کار می خواهد آنها را مدیریت کند: هنگامی که آنها در گوگل ثبت نام می کنند، احتمال کمتری وجود دارد که از Apple و Bing نیز ثبت نام کنند.

**رقابت با خدمات تجمیع کننده**

خدمات تجمیع کننده مانند Yelp و OpenTable، ما در مورد شما صحبت می کنیم. اگر تمایل نهایی برای مرور کسب و کارها این است که واقعاً به آنجا بروید، پس من مطمئناً آرزو می کنم که بتوانم همه نظرات را بخوانم یا از طریق رابط نقشه برداری یا ناوبری خود، که معمولاً Google Maps است، رزرو کنم.

Google Maps در حال حاضر به راحتی میانبرهایی را به لینک های فروشگاه برای منو، سفارش، رزرو، قرار ملاقات ها، نکات برجسته امکانات و غیره ارائه می دهد. پذیرش گسترده مصرف کنندگان مطمئناً جنبه های مصرف کننده محور کسب و کارها را از Yelp/OpenTable/Foursquare در موقعیت بسیار چالش برانگیزی قرار می دهد.

**ارائه خدمات بهتر به مصرف کنندگان**

مصرف کنندگان اطلاعات دقیق تر و کامل تری در مورد یک کسب و کار می خواهند. گاهی اوقات آنها در برقراری ارتباط با کسب و کارها مشکل دارند. حتی برخی از کسب و کارها صندوق صوتی آنها پر است که نمی توان پیام صوتی گذاشت. با استفاده از Google Maps برای مدیریت مستقیم کسب و کار، کسب و کارها تشویق می شوند تا اطلاعات بیشتری را ارائه دهند که مستقیماً در پروفایل Google Maps آنها منعکس می شود. در عوض، مصرف کنندگان بیشتر در Google Maps می مانند، بدون اینکه برای اطلاعات به منابع دیگر مراجعه کنند.

## Google Maps: واقعاً مصرف کننده و کسب و کار را به هم متصل می کند

پیش از این، Google Maps با ارائه API های خود در Google Cloud، خدماتی را به کسب و کارهایی که به اطلاعات جغرافیایی نیاز داشتند، ارائه می داد. بنابراین می توان به سرعت نام یک کسب و کار را تایپ کرد و آدرس آن را پیدا کرد، یا کدگذاری جغرافیایی معکوس را برای تبدیل طول و عرض جغرافیایی به آدرس یا یافتن همه کسب و کارها در یک آدرس انجام داد. Google Maps همچنین خدمات نقشه برداری و ناوبری با دقت بالا را در رقابت با [HERE Maps](https://www.here.com/) ارائه می دهد که رانندگی خودکار بسیاری از وسایل نقلیه را تامین می کند.

اما همه اینها در پشت صحنه اتفاق می افتد و ارتباط چندانی با مصرف کنندگان عادی ندارد. سپس یک تغییر مهم رخ می دهد:

<center>

*آیا می دانید Google Maps یک برنامه چت بین مصرف کنندگان و کسب و کارها نیز هست؟*
</center>

بله، مصرف کنندگان اکنون می توانند با استفاده از Google Maps به یک کسب و کار در Google Maps پیام ارسال کنند! این یک تلاش دیگر از سوی گوگل برای به چالش کشیدن iMessage به عنوان یک ابزار ارتباطی تجاری است، پس از نبردهای دشوار با اپراتورهایی که [استاندارد پیام رسانی RCS را به کندی پذیرفته اند](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/) در گوشی های اندروید.

اتصال مستقیم کسب و کارها با مصرف کنندگان از طریق Google Maps تجربه ای یکپارچه را برای تجربه خرید مصرف کنندگان فراهم می کند. این یک حرکت استراتژیک عالی برای گوگل است تا Google Maps را به سیستم عامل جدیدی برای جستجوی محلی کسب و کارهای "نزدیک من" تبدیل کند.


اگر به سوال بالا "خیر" پاسخ دادید، به این معنی است که هنوز برای استفاده از Google Maps برای مدیریت کسب و کار یا پیام رسانی به مشتریان خود، کمی کشف لازم است. لطفاً برای آموزش گام به گام نحوه استفاده از Google Maps برای کسب و کار خود، ادامه مطلب را بخوانید!

## راهنمای گام به گام نحوه استفاده از Google Maps برای مدیریت کسب و کار شما

اول از همه، مطمئن شوید که برنامه Google Maps خود را به آخرین نسخه به روز کرده اید. در اینجا، ما از نسخه 6.12 در iOS استفاده می کنیم. می توانیم تأیید کنیم که نسخه 11.24 در Android نیز همین قابلیت ها را دارد.

### 1. به برنامه Google Maps بروید و روی نمایه خود کلیک کنید.
به برنامه Google Maps خود بروید و مطمئن شوید که از همان حسابی که برای نمایه Google Maps استفاده می کنید، استفاده می کنید. روی نمایه خود کلیک کنید.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*رابط برنامه Google Maps.*
</center>

### 2. روی "نمایه های کسب و کار شما" کلیک کنید.
اگر از حساب صحیح مرتبط با لیست کسب و کار خود استفاده می کنید، باید بتوانید گزینه "نمایه های کسب و کار شما" را مشاهده کنید. روی گزینه "نمایه های کسب و کار شما" کلیک کنید.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*برای مشاهده نمایه های کسب و کار خود، روی "نمایه های کسب و کار شما" کلیک کنید.*
</center>

### 3. کسب و کاری را که می خواهید به روز کنید انتخاب کنید.

اگر چندین کسب و کار دارید، باید بتوانید همه کسب و کارهای خود را مشاهده کنید. کسب و کاری را که می خواهید در حال حاضر به روز کنید یا مدیریت کنید، انتخاب کنید. در مثال ما، ما می خواهیم Seasalt AI را مدیریت کنیم.


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*ما می توانیم کسب و کارهایی را که در حال حاضر مدیریت می کنیم، مشاهده کنیم.*
</center>

### 4. روی گزینه "ویرایش نمایه" کلیک کنید.
پس از کلیک بر روی دکمه "ویرایش نمایه"، می توانید تمام اطلاعاتی را که می توانید تغییر دهید مشاهده کنید. این شامل اطلاعات کسب و کار، ساعات کاری، لوگو و عکس روی جلد است. برای هدف این آموزش، ما اطلاعات کسب و کار را به روز خواهیم کرد.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*روی دکمه "ویرایش نمایه" کلیک کنید.*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*اطلاعاتی که می توانید در مورد کسب و کار خود تغییر دهید.*
</center>


### 5. هر اطلاعاتی را که می خواهید تغییر دهید انتخاب کنید.

پس از کلیک بر روی اطلاعات کسب و کار، می توانید اطلاعاتی را که می توانید تغییر دهید مانند نام کسب و کار، دسته بندی کسب و کار، شماره تلفن، وب سایت و موارد دیگر را مشاهده کنید. می توانید هر اطلاعاتی را که می خواهید به روز کنید انتخاب کنید.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*گزینه های اطلاعات کسب و کار که می توانید تغییر دهید.*
</center>


جایگزینی Google My Business با Google Maps و Search برای صاحبان کسب و کار و گوگل کاملاً منطقی است. برای کسب و کارها، این به معنای یک برنامه کمتر برای مدیریت اطلاعات کسب و کارشان است. با این حرکت، Google Maps واقعاً مصرف کنندگان و کسب و کارها را به هم متصل می کند. مصرف کنندگان اکنون می توانند با استفاده از Google Maps به یک کسب و کار در Google Maps پیام ارسال کنند و بالعکس. اتصال با مصرف کنندگان از طریق Google Maps نیز تجربه ای یکپارچه را برای مصرف کنندگان فراهم می کند. برای گوگل، آسان تر کردن کارها برای صاحبان کسب و کار به معنای پذیرش بیشتر کسب و کارها است.

درباره نحوه [مدیریت نمایه کسب و کار خود مستقیماً در گوگل](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid) بیشتر بدانید. با دنبال کردن ما در [LinkedIn](https://www.linkedin.com/company/seasalt-ai) با ما در ارتباط باشید!
`;export{e as default};
