const o=`---
title: "Прощай, Google Мой Бизнес, теперь Google Карты — новая ОС для бизнеса"
metatitle: "Прощай, GMB, Google Карты — новая ОС для бизнеса"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "Google заменяет приложение Google Мой Бизнес на Google Карты, где компании могут управлять своей информацией и отвечать на сообщения клиентов в Google Картах."
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*Прямое соединение бизнеса с потребителями через Google Карты обеспечивает бесшовный опыт для покупателей. Это отличный стратегический шаг для Google, чтобы превратить Google Карты в новую операционную систему для локального поиска предприятий "рядом со мной".*


10 миллионов владельцев бизнеса, использующих приложение Google Мой Бизнес, возможно, недавно получили сообщение, объявляющее о замене Google Мой Бизнес на Google Карты и Поиск:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google Мой Бизнес официально уходит в отставку.*
</center>

Давно ходили слухи, что Google что-то сделает с приложением, основываясь на двух наблюдениях:
1. Онлайн-веб-версия Google Мой Бизнес недавно была переименована в Google Business Profile.
2. Google позволяет напрямую управлять бизнесом через Google Поиск, как только вы ищете свой собственный бизнес в Google.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*Управление бизнесом через Google Поиск.*
</center>

Мы подозревали, что Google просто переименует Google Мой Бизнес (приложение) в Google Business Profile, синхронизируя его с названием веб-версии. В конце концов, Google, похоже, уже определился со своим семейством продуктов: **Google Business Profile** и **Google Business Messages**. Таким образом, новость о том, что Google полностью отказывается от любимого приложения Google Мой Бизнес, стала неожиданностью.

Имеет ли это смысл для владельцев бизнеса и Google? Безусловно, это имеет смысл по нескольким причинам. Вот что мы думаем об этом шаге.

## Для бизнеса: на одно приложение меньше и больше контекста

Удаление требования загружать дополнительное приложение хорошо служит владельцам малого и среднего бизнеса. Почему? Потому что даже если это просто небольшой магазин, обычно у бизнеса есть несколько менеджеров, и каждому из них необходимо загрузить и установить приложение. Например, владельцы магазинов часто дают своим менеджерам или сотрудникам разрешение предоставлять клиентам обновления, такие как ответы на вопросы, ответы на отзывы и даже внезапные изменения в часах работы магазина/праздничных днях.

Сотрудникам часто нужно помнить, что для внесения изменений необходимо использовать приложение "Google Мой Бизнес". Теперь это просто: достаточно открыть Google Карты, и у большинства людей оно уже есть. Это значительно экономит время как владельцам, так и сотрудникам.

Кроме того, каждый раз, когда открывается Google Карты, пользователь видит больше конкурирующих и дополняющих предприятий по соседству. Эта информация часто включает отзывы, рейтинги и то, насколько заняты другие предприятия. Раньше, открывая Google Мой Бизнес, владельцы видели только свой собственный бизнес. Теперь с приложением Google Карты владельцы сначала видят все предприятия с большим контекстом.


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*Слева направо: интерфейсы Google Мой Бизнес и Google Карты для управления вашим бизнесом.*
</center>

## Для Google: большее распространение бизнеса

Откройте любую случайную область на Google Картах, и вы сразу же найдете профили компаний, которые не были "заявлены" владельцами в Google. Владельцы просматривают отзывы потребителей и иногда не знают, как оставить отзыв. Потому что им приходилось использовать для этого другое приложение.

Чтобы помочь владельцам быть в курсе своего бизнеса, Google запустил [Grow With Google](https://grow.google/intl/ALL_ca/) для предоставления обучения, инструментов и ресурсов владельцам бизнеса. Тем не менее, барьер - это одно приложение. Если владелец бизнеса посмотрит на свой бизнес в Google Картах и поймет, что он может немедленно заявить о своем бизнесе и взять его под контроль (после проверки), то внедрение Google Business Profile будет намного проще.

## Почему Google Карты? Это операционная система нашего физического мира!

Почему Google Карты этого хотят? Мы можем назвать три основные причины:

**Конкуренция с Apple/Bing Maps**

Google Карты хотят еще больше опередить конкурирующие картографические сервисы, такие как Apple Maps и Bing Maps. Количество бизнес-профилей, которыми хочет управлять владелец, ограничено: как только они регистрируются в Google, они с меньшей вероятностью будут регистрироваться в Apple и Bing.

**Конкуренция с агрегаторами**

Агрегаторы, такие как Yelp и OpenTable, мы говорим о вас. Если конечное желание просмотра предприятий состоит в том, чтобы фактически пойти туда, то я, безусловно, хотел бы иметь возможность читать все отзывы или делать бронирование из моего интерфейса карт или навигации, которым обычно является Google Карты.

Google Карты уже удобно предоставляют ярлыки для ссылок на меню магазина, заказы, бронирования, встречи, основные удобства и т. д. Массовое внедрение потребителями, безусловно, ставит потребительские стороны бизнеса от Yelp/OpenTable/Foursquare в очень сложную ситуацию.

**Предоставление лучших услуг потребителям**

Потребители хотят более подробную и полную информацию о бизнесе. Иногда им трудно связаться с предприятиями. У некоторых предприятий даже переполнен почтовый ящик голосовой почты, так что нельзя оставить голосовое сообщение. Приняв Google Карты для прямого управления бизнесом, предприятия поощряются предоставлять больше информации, которая будет непосредственно отражена в их профиле Google Карт. В свою очередь, потребители дольше остаются в Google Картах, не прибегая к другим ресурсам для получения информации.

## Google Карты: Действительно соединяя потребителя и бизнес

Ранее Google Карты предоставляли услуги предприятиям, которым требовалась географическая информация, предоставляя свои API в Google Cloud. Таким образом, можно быстро ввести название предприятия и узнать его адрес, или выполнить обратное геокодирование, чтобы преобразовать широту и долготу в адрес или найти все предприятия по адресу. Google Карты также предоставляют высокоточные картографические и навигационные услуги в конкуренции с [HERE Maps](https://www.here.com/), которая обеспечивает автономное вождение многих транспортных средств.

Но все это происходит за кулисами и не имеет большого отношения к повседневным потребителям. Затем происходит значительное изменение:

<center>

*Знаете ли вы, что Google Карты также являются чат-приложением между потребителями и предприятиями?*
</center>

Да, потребители теперь могут отправлять сообщения бизнесу в Google Картах, используя Google Карты! Это еще одна попытка Google бросить вызов iMessage как инструменту бизнес-коммуникации, после трудных битв с операторами, которые [медленно внедряют стандарт обмена сообщениями RCS](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/) на телефонах Android.

Прямое соединение бизнеса с потребителями через Google Карты обеспечивает бесшовный опыт для покупателей. Это отличный стратегический шаг для Google, чтобы превратить Google Карты в новую операционную систему для локального поиска предприятий "рядом со мной".


Если вы ответили "Нет" на вышеуказанный вопрос, это означает, что для использования Google Карт для управления вашим бизнесом или отправки сообщений вашим клиентам все еще требуется некоторое изучение. Пожалуйста, прочитайте пошаговое руководство о том, как использовать Google Карты для вашего бизнеса!

## Пошаговое руководство по использованию Google Карт для управления вашим бизнесом

Прежде всего, убедитесь, что вы обновили приложение Google Карты до последней версии. Здесь мы используем версию 6.12 на iOS. Мы можем подтвердить, что версия 11.24 на Android имеет те же возможности.

### 1. Перейдите в приложение Google Карты и нажмите на свой профиль.
Перейдите в приложение Google Карты и убедитесь, что вы используете ту же учетную запись, которую вы используете для профиля Google Карт. Нажмите на свой профиль.

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*Интерфейс приложения Google Карты.*
</center>

### 2. Нажмите "Ваши бизнес-профили".
Если вы используете правильную учетную запись, связанную с вашим бизнес-листингом, вы должны увидеть опцию "Ваши бизнес-профили". Нажмите на опцию "Ваши бизнес-профили".

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*Нажмите "Ваши бизнес-профили", чтобы просмотреть свои бизнес-профили.*
</center>

### 3. Выберите бизнес, который вы хотите обновить.

Если у вас несколько предприятий, вы должны увидеть все свои предприятия. Выберите предприятие, которое вы хотите обновить или управлять в данный момент. В нашем примере мы хотим управлять Seasalt AI.


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*Мы можем видеть предприятия, которыми мы в настоящее время управляем.*
</center>

### 4. Нажмите опцию "Редактировать профиль".
После нажатия кнопки "Редактировать профиль" вы увидите всю информацию, которую можно изменить. Это включает информацию о бизнесе, часы работы, логотип и обложку. Для целей этого руководства мы обновим информацию о бизнесе.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*Нажмите кнопку "Редактировать профиль".*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*Информация, которую вы можете изменить о своем бизнесе.*
</center>


### 5. Выберите любую информацию, которую вы хотите изменить.

После того, как вы нажмете на информацию о бизнесе, вы увидите информацию, которую вы можете изменить, такую как название компании, категория компании, номер телефона, веб-сайт и многое другое. Вы можете выбрать любую информацию, которую вы хотите обновить.


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*Параметры информации о бизнесе, которые вы можете изменить.*
</center>


Замена Google Мой Бизнес на Google Карты и Поиск имеет идеальный смысл для владельцев бизнеса и Google. Для бизнеса это на одно приложение меньше для управления информацией о своем бизнесе. С этим шагом Google Карты также по-настоящему соединяют потребителей и бизнес. Потребители теперь могут отправлять сообщения бизнесу в Google Картах с помощью Google Карт, и наоборот. Соединение с потребителями через Google Карты также обеспечивает бесшовный опыт для потребителей. Для Google, упрощение работы для владельцев бизнеса означает большее распространение бизнеса.

Узнайте больше о том, как [управлять своим бизнес-профилем непосредственно в Google](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid). Оставайтесь на связи с нами, подписавшись на нас в [LinkedIn](https://www.linkedin.com/company/seasalt-ai)!`;export{o as default};
