const e=`---
title: "ลาก่อน Google My Business, ตอนนี้ Google Maps คือ OS ใหม่สำหรับธุรกิจ"
metatitle: "ลาก่อน GMB, Google Maps คือ OS ใหม่สำหรับธุรกิจ"
date: 2022-04-06 11:11:16-07:00
modified_date: 2025-07-28 16:03:25.123456
draft: false
author: Xuchen Yao, Ruli Setiawati
description: "Google กำลังแทนที่แอป Google My Business ด้วย Google Maps ซึ่งธุรกิจสามารถจัดการข้อมูลและตอบกลับข้อความของลูกค้าบน Google Maps ได้"
weight: 1
tags: []
image: images/blog/11-Google-Maps-replaces-Google-My-Business/thumbnail.png
canonicalURL: /blog/google-maps-replaces-google-my-business/
url: /blog/google-maps-replaces-google-my-business/
---

*การเชื่อมต่อธุรกิจกับผู้บริโภคโดยตรงผ่าน Google Maps มอบประสบการณ์ที่ราบรื่นสำหรับการช้อปปิ้งของผู้บริโภค นี่คือการเคลื่อนไหวเชิงกลยุทธ์ที่ยอดเยี่ยมสำหรับ Google ในการเปลี่ยน Google Maps ให้เป็นระบบปฏิบัติการใหม่สำหรับการค้นหาธุรกิจ "ใกล้ฉัน" ในท้องถิ่น*


เจ้าของธุรกิจ 10 ล้านรายที่ใช้แอป Google My Business อาจได้รับข้อความเมื่อเร็วๆ นี้ที่ประกาศการแทนที่ Google My Business ด้วย Google Maps และ Search:

<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-GMB_replaced.png"/>

*Google My Business เกษียณอย่างเป็นทางการแล้ว*
</center>

มีข่าวลือมานานแล้วว่า Google จะทำอะไรบางอย่างกับแอปนี้ โดยอิงจากการสังเกตสองประการ:
1. Google My Business เวอร์ชันเว็บออนไลน์เพิ่งเปลี่ยนชื่อเป็น Google Business Profile
2. Google ช่วยให้คุณสามารถจัดการธุรกิจได้โดยตรงผ่าน Google Search เมื่อคุณค้นหาธุรกิจของคุณเองบน Google


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/0-google_search.png"/>

*การจัดการธุรกิจผ่าน Google Search.*
</center>

เราสงสัยว่า Google จะเปลี่ยนชื่อ Google My Business (แอป) เป็น Google Business Profile เพื่อให้สอดคล้องกับชื่อเวอร์ชันเว็บ ท้ายที่สุด Google ดูเหมือนจะเข้าใจกลุ่มผลิตภัณฑ์ของตนแล้ว: **Google Business Profile** และ **Google Business Messages** ดังนั้นข่าวที่ Google กำลังเลิกใช้แอป Google My Business ที่เป็นที่รักอย่างสมบูรณ์จึงเป็นเรื่องที่น่าประหลาดใจ

มันสมเหตุสมผลสำหรับเจ้าของธุรกิจและ Google หรือไม่? แน่นอนว่ามันสมเหตุสมผลในหลายๆ ด้าน นี่คือสิ่งที่เราคิดเกี่ยวกับการเคลื่อนไหวนี้

## สำหรับธุรกิจ: แอปน้อยลงและบริบทมากขึ้น

การยกเลิกข้อกำหนดในการดาวน์โหลดแอปเพิ่มเติมเป็นประโยชน์อย่างยิ่งสำหรับเจ้าของ SME ทำไม? เพราะแม้ว่าจะเป็นเพียงร้านค้าเล็กๆ แต่โดยปกติแล้วจะมีผู้จัดการมากกว่าหนึ่งคนสำหรับธุรกิจ และแต่ละคนจำเป็นต้องดาวน์โหลดและติดตั้งแอป ตัวอย่างเช่น เจ้าของร้านค้ามักจะให้สิทธิ์ผู้จัดการหรือพนักงานในการให้ข้อมูลอัปเดตแก่ลูกค้า เช่น การตอบคำถาม การตอบกลับรีวิว และแม้แต่การเปลี่ยนแปลงกะทันหันในเวลาทำการของร้านค้า/วันหยุด

พนักงานมักจะต้องจำไว้ว่าต้องใช้แอป “Google My Business” เพื่อทำการเปลี่ยนแปลง ตอนนี้ง่ายแล้ว: เพียงแค่เปิด Google Maps และคนส่วนใหญ่ก็มีอยู่แล้ว นี่เป็นการประหยัดเวลาอย่างมากสำหรับทั้งเจ้าของและพนักงาน

นอกจากนี้ ทุกครั้งที่เปิด Google Maps จะเห็นธุรกิจคู่แข่งและธุรกิจเสริมในละแวกใกล้เคียงมากขึ้น ข้อมูลนี้มักจะรวมถึงรีวิว การจัดอันดับ และความหนาแน่นของธุรกิจอื่นๆ ก่อนหน้านี้ เมื่อเปิด Google My Business เจ้าของจะเห็นเฉพาะธุรกิจของตนเองเท่านั้น ตอนนี้ด้วยแอป Google Maps เจ้าของจะเห็นธุรกิจทั้งหมดพร้อมบริบทที่มากขึ้น


<center>
<img width="550" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/1-comparison.png"/>

*จากซ้ายไปขวา: อินเทอร์เฟซ Google My Business และ Google Maps สำหรับการจัดการธุรกิจของคุณ*
</center>

## สำหรับ Google: การยอมรับธุรกิจมากขึ้น

เปิดพื้นที่สุ่มใดๆ บน Google Maps ก็สามารถพบโปรไฟล์ธุรกิจที่ยังไม่ได้ "อ้างสิทธิ์" โดยเจ้าของกับ Google ได้ทันที เจ้าของดูรีวิวของผู้บริโภคและบางครั้งก็ไม่รู้ว่าจะให้ข้อเสนอแนะอย่างไร เพราะพวกเขาต้องใช้แอปอื่นในการทำเช่นนั้น

เพื่อช่วยให้เจ้าของธุรกิจดำเนินธุรกิจได้อย่างราบรื่น Google ได้เริ่มโครงการ [Grow With Google](https://grow.google/intl/ALL_ca/) เพื่อให้การฝึกอบรม เครื่องมือ และทรัพยากรแก่เจ้าของธุรกิจ อย่างไรก็ตาม อุปสรรคยังคงอยู่ที่แอปเดียว หากเจ้าของธุรกิจดูธุรกิจของตนบน Google Maps และตระหนักว่าพวกเขาสามารถอ้างสิทธิ์และควบคุมธุรกิจของตนได้ทันที (หลังจากการยืนยัน) การนำ Google Business Profile มาใช้ก็จะง่ายขึ้นมาก

## ทำไมต้อง Google Maps? มันคือระบบปฏิบัติการใหม่สำหรับโลกทางกายภาพของเรา!

ทำไม Google Maps ถึงต้องการสิ่งนี้? เราสามารถคิดได้สามเหตุผลหลัก:

**แข่งขันกับ Apple/Bing Maps**

Google Maps ต้องการก้าวล้ำหน้าบริการแผนที่คู่แข่งอย่าง Apple Maps และ Bing Maps มีจำนวนโปรไฟล์ธุรกิจที่เจ้าของต้องการจัดการอย่างจำกัด: เมื่อลงทะเบียนกับ Google แล้ว โอกาสที่พวกเขาจะไปลงทะเบียนเพิ่มจาก Apple และ Bing ก็จะน้อยลง

**แข่งขันกับบริการรวบรวมข้อมูล**

บริการรวบรวมข้อมูลเช่น Yelp และ OpenTable เรากำลังพูดถึงคุณ หากความปรารถนาสุดท้ายในการเรียกดูธุรกิจคือการไปที่นั่นจริงๆ ผมก็หวังเป็นอย่างยิ่งว่าจะสามารถอ่านรีวิวทั้งหมดหรือทำการจองจากอินเทอร์เฟซแผนที่หรือการนำทางของผม ซึ่งโดยปกติแล้วคือ Google Maps

Google Maps มีทางลัดที่สะดวกสบายไปยังลิงก์ของร้านค้าสำหรับเมนู การสั่งซื้อ การจอง การนัดหมาย จุดเด่นของสิ่งอำนวยความสะดวก ฯลฯ การยอมรับของผู้บริโภคจำนวนมากทำให้ธุรกิจที่ติดต่อกับผู้บริโภคจาก Yelp/OpenTable/Foursquare ตกอยู่ในสถานการณ์ที่ท้าทายอย่างมาก

**ให้บริการที่ดีขึ้นแก่ผู้บริโภค**

ผู้บริโภคต้องการข้อมูลที่ละเอียดและครบถ้วนเกี่ยวกับธุรกิจ บางครั้งพวกเขามีปัญหาในการติดต่อธุรกิจ บางธุรกิจถึงกับมีกล่องข้อความเสียงเต็มจนไม่สามารถฝากข้อความเสียงได้ ด้วยการนำ Google Maps มาใช้ในการจัดการธุรกิจโดยตรง ธุรกิจต่างๆ ได้รับการสนับสนุนให้ให้ข้อมูลเพิ่มเติมที่จะสะท้อนโดยตรงในโปรไฟล์ Google Maps ของพวกเขา ในทางกลับกัน ผู้บริโภคจะใช้ Google Maps มากขึ้น โดยไม่ต้องพึ่งพาแหล่งข้อมูลอื่น

## Google Maps: เชื่อมโยงผู้บริโภคและธุรกิจอย่างแท้จริง

ก่อนหน้านี้ Google Maps ให้บริการแก่ธุรกิจที่ต้องการข้อมูลทางภูมิศาสตร์โดยการให้บริการ API บน Google Cloud ดังนั้นจึงสามารถพิมพ์ชื่อธุรกิจได้อย่างรวดเร็วและค้นหาที่อยู่ หรือทำการ geocoding ย้อนกลับเพื่อแปลงละติจูดและลองจิจูดเป็นที่อยู่ หรือค้นหาธุรกิจทั้งหมดในที่อยู่หนึ่ง Google Maps ยังให้บริการแผนที่และการนำทางที่มีความแม่นยำสูงเพื่อแข่งขันกับ [HERE Maps](https://www.here.com/) ซึ่งขับเคลื่อนการขับขี่อัตโนมัติของยานพาหนะจำนวนมาก

แต่ทั้งหมดนี้เกิดขึ้นเบื้องหลังและไม่เกี่ยวข้องกับผู้บริโภคในชีวิตประจำวันมากนัก จากนั้นก็มีการเปลี่ยนแปลงที่สำคัญ:

<center>

*คุณรู้หรือไม่ว่า Google Maps เป็นแอปแชทระหว่างผู้บริโภคและธุรกิจด้วย?*
</center>

ใช่ ผู้บริโภคสามารถส่งข้อความถึงธุรกิจบน Google Maps โดยใช้ Google Maps ได้แล้ว! นี่เป็นอีกหนึ่งความพยายามของ Google ในการท้าทาย iMessage ในฐานะเครื่องมือสื่อสารทางธุรกิจ หลังจากต่อสู้กับผู้ให้บริการที่ [นำมาตรฐานการส่งข้อความ RCS มาใช้ช้า](https://android.gadgethacks.com/news/always-updated-list-carriers-support-rcs-universal-profile-0191610/) บนโทรศัพท์ Android

การเชื่อมต่อธุรกิจกับผู้บริโภคโดยตรงผ่าน Google Maps มอบประสบการณ์ที่ราบรื่นสำหรับการช้อปปิ้งของผู้บริโภค นี่คือการเคลื่อนไหวเชิงกลยุทธ์ที่ยอดเยี่ยมสำหรับ Google ในการเปลี่ยน Google Maps ให้เป็นระบบปฏิบัติการใหม่สำหรับการค้นหาธุรกิจ "ใกล้ฉัน" ในท้องถิ่น


หากคุณตอบว่า "ไม่" สำหรับคำถามข้างต้น แสดงว่ายังต้องมีการค้นพบเล็กน้อยเพื่อใช้ Google Maps ในการจัดการธุรกิจของคุณหรือส่งข้อความถึงลูกค้าของคุณ โปรดอ่านต่อสำหรับบทช่วยสอนทีละขั้นตอนเกี่ยวกับวิธีใช้ Google Maps สำหรับธุรกิจของคุณ!

## บทช่วยสอนทีละขั้นตอนเกี่ยวกับวิธีใช้ Google Maps เพื่อจัดการธุรกิจของคุณ

ก่อนอื่น ตรวจสอบให้แน่ใจว่าคุณได้อัปเดตแอป Google Maps เป็นเวอร์ชันล่าสุดแล้ว ที่นี่ เรากำลังใช้เวอร์ชัน 6.12 บน iOS เราสามารถยืนยันได้ว่าเวอร์ชัน 11.24 บน Android มีความสามารถเดียวกัน

### 1. ไปที่แอป Google Maps แล้วคลิกโปรไฟล์ของคุณ
ไปที่แอป Google Maps ของคุณและตรวจสอบให้แน่ใจว่าคุณใช้บัญชีเดียวกับที่คุณใช้สำหรับโปรไฟล์ Google Maps คลิกโปรไฟล์ของคุณ

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/2-google_maps_interface.png"/>

*อินเทอร์เฟซแอป Google Maps.*
</center>

### 2. คลิก "โปรไฟล์ธุรกิจของคุณ"
หากคุณใช้บัญชีที่ถูกต้องที่เชื่อมโยงกับรายชื่อธุรกิจของคุณ คุณควรจะเห็นตัวเลือก "โปรไฟล์ธุรกิจของคุณ" คลิกตัวเลือก "โปรไฟล์ธุรกิจของคุณ"

<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/3-dropdown.png"/>

*คลิก "โปรไฟล์ธุรกิจของคุณ" เพื่อดูโปรไฟล์ธุรกิจของคุณ*
</center>

### 3. เลือกธุรกิจที่คุณต้องการอัปเดต

หากคุณมีธุรกิจหลายแห่ง คุณควรจะเห็นธุรกิจทั้งหมดของคุณ เลือกธุรกิจที่คุณต้องการอัปเดตหรือจัดการในขณะนี้ ในตัวอย่างของเรา เราต้องการจัดการ Seasalt AI


<center>
<img height="400" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/4-business_profiles.png"/>

*เราสามารถดูธุรกิจที่เราจัดการอยู่ในปัจจุบัน*
</center>

### 4. คลิกตัวเลือก "แก้ไขโปรไฟล์"
เมื่อคุณคลิกปุ่ม "แก้ไขโปรไฟล์" คุณจะเห็นข้อมูลทั้งหมดที่คุณสามารถแก้ไขได้ ซึ่งรวมถึงข้อมูลธุรกิจ เวลาทำการ โลโก้ และรูปภาพหน้าปก สำหรับวัตถุประสงค์ของบทช่วยสอนนี้ เราจะอัปเดตข้อมูลธุรกิจ


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/5-edit_profile.png"/>

*คลิกปุ่ม "แก้ไขโปรไฟล์"*
</center>

<center>
<img height="350" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/6-business_info.png">

*ข้อมูลที่คุณสามารถแก้ไขเกี่ยวกับธุรกิจของคุณ*
</center>


### 5. เลือกข้อมูลใดๆ ที่คุณต้องการแก้ไข

เมื่อคุณคลิกข้อมูลธุรกิจ คุณจะเห็นข้อมูลที่คุณสามารถแก้ไขได้ เช่น ชื่อธุรกิจ หมวดหมู่ธุรกิจ หมายเลขโทรศัพท์ เว็บไซต์ และอื่นๆ คุณสามารถเลือกข้อมูลใดๆ ที่คุณต้องการอัปเดต


<center>
<img height="500" src="/images/blog/11-Google-Maps-replaces-Google-My-Business/7-edit_business_info.png"/>

*ตัวเลือกข้อมูลธุรกิจที่คุณสามารถแก้ไขได้*
</center>


การแทนที่ Google My Business ด้วย Google Maps และ Search นั้นสมเหตุสมผลอย่างยิ่งสำหรับเจ้าของธุรกิจและ Google สำหรับธุรกิจแล้ว หมายถึงแอปที่ต้องดาวน์โหลดน้อยลงเพื่อจัดการข้อมูลธุรกิจของตน ด้วยการเคลื่อนไหวนี้ Google Maps ยังเชื่อมโยงผู้บริโภคและธุรกิจอย่างแท้จริง ผู้บริโภคสามารถส่งข้อความถึงธุรกิจบน Google Maps ด้วย Google Maps และในทางกลับกัน การเชื่อมต่อกับผู้บริโภคผ่าน Google Maps ยังมอบประสบการณ์ที่ราบรื่นสำหรับผู้บริโภค สำหรับ Google การทำให้สิ่งต่างๆ ง่ายขึ้นสำหรับเจ้าของธุรกิจหมายถึงการยอมรับธุรกิจมากขึ้น

เรียนรู้เพิ่มเติมเกี่ยวกับวิธี [จัดการโปรไฟล์ธุรกิจของคุณโดยตรงบน Google](https://support.google.com/business/answer/7039811?hl=en&co=GENIE.Platform%3DAndroid) ติดต่อกับเราโดยติดตามเราบน [LinkedIn](https://www.linkedin.com/company/seasalt-ai)!
`;export{e as default};
