const e=`---
title: "Near Me Messaging مکمل پیام‌های کسب‌وکار Google"
metatitle: "Near Me Messaging مکمل پیام‌های کسب‌وکار Google"
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "Near Me Messaging هوش مصنوعی مکالمه‌ای را با پیام‌های کسب‌وکار Google ادغام می‌کند و از طریق دکمه چت در نمایه Google Maps شما، پشتیبانی 24/7 را فراهم می‌کند."
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


در یکی از وبلاگ‌های قبلی ما، شما را با [مزایا و محدودیت‌های پیام‌های کسب‌وکار Google](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/) آشنا کردیم. دو محدودیت اصلی در پیاده‌سازی‌های رایج پیام‌های کسب‌وکار Google وجود دارد. اولین محدودیت این است که برای پرداخت به یک آژانس مشاوره حرفه‌ای برای ایجاد یک عامل مجازی سفارشی برای کسب‌وکار شما از ابتدا، پول و زمان زیادی لازم است. محدودیت دوم این است که صاحبان کسب‌وکار نمی‌توانند مستقیماً با مشتریان صحبت کنند مگر اینکه آژانس مشاوره یک ویژگی چت زنده را به عنوان بخشی از پیاده‌سازی خود ارائه دهد.

اکنون ممکن است از خود بپرسید، آیا راه حلی برای غلبه بر این موانع وجود دارد و در عین حال از مزایای پیام‌های کسب‌وکار Google بهره‌مند شد؟ به همین دلیل می‌خواهیم Near Me Messaging را معرفی کنیم (به‌روزرسانی: ما از آن زمان محصول را به یک سازنده چت‌بات همه‌کاناله تغییر داده‌ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می‌شود!).

## درباره Near Me Messaging

Near Me Messaging هوش مصنوعی مکالمه‌ای پیشرفته را با پیام‌های کسب‌وکار Google ادغام می‌کند و به مشتریان امکان می‌دهد در هر زمان از روز از طریق دکمه چت در نمایه Google Maps شما با کسب‌وکار شما ارتباط برقرار کنند. به این ترتیب، می‌توانید روی رسیدگی به کسب‌وکار خود تمرکز کنید در حالی که Near Me Messaging به پرسش‌های مشتریان شما رسیدگی می‌کند. آنچه Near Me Messaging را از خدمات مشابه متمایز می‌کند، زمان راه‌اندازی 5 دقیقه‌ای، سفارشی‌سازی خودکار و پشتیبانی چت زنده داخلی است.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging پیام‌های کسب‌وکار Google را با دکمه چت در نمایه Google Maps شما ادغام می‌کند."/>

*Near Me Messaging پیام‌های کسب‌وکار Google را با دکمه چت در نمایه Google Maps شما ادغام می‌کند.*
</center>

اول از همه، هنگامی که کسب و کارها پیام‌های کسب‌وکار Google را ادغام می‌کنند، باید به یک آژانس مشاوره حرفه‌ای پول بپردازند تا یک تجربه کاملاً سفارشی برای آنها از ابتدا ایجاد کند. اینها معمولاً گران هستند و زمان می‌برند. ما درک می‌کنیم که سرمایه‌گذاری معمول زمان و منابع برای استفاده از پیام‌های کسب‌وکار Google مانعی برای ورود بسیاری از کسب‌وکارهای کوچک است. Near Me Messaging این محدودیت را با ارائه یک راه‌حل مقرون‌به‌صرفه برای SMEها حل می‌کند. شما می‌توانید در کمتر از 5 دقیقه یک عامل مجازی فعال داشته باشید. علاوه بر این، می‌توانید عامل مجازی خود را در هر زمان از وب‌سایت Near Me Messaging به طور مداوم به‌روزرسانی و سفارشی کنید. تغییراتی که در سایت Near Me Messaging ایجاد می‌کنید، بلافاصله برای مشتریانی که با عامل شما در تعامل هستند، اعمال می‌شود.

علاوه بر آن، هنگامی که دکمه چت را در نمایه کسب‌وکار Google فعال می‌کنید، می‌توانید هر زمان که در دسترس بودید به مشتریان خود پاسخ دهید. اما هنگامی که پیام‌های کسب‌وکار Google را ادغام می‌کنید، پیام‌های ورودی شما به عامل زنده شما هدایت می‌شوند و توانایی چت مستقیم با مشتریان را در نمایه کسب‌وکار Google از دست می‌دهید. Near Me Messaging این محدودیت را با ارائه ویژگی عامل زنده بدون هزینه اضافی یا زمان راه‌اندازی حل می‌کند. با ویژگی عامل زنده، مشتریان می‌توانند در هر زمان درخواست انتقال به یک شخص واقعی را داشته باشند. هنگامی که درخواست عامل زنده را مشاهده می‌کنید، یا اگر می‌خواهید وظایف عامل مجازی را بر عهده بگیرید، می‌توانید به مکالمه بپیوندید و مستقیماً با مشتریان خود صحبت کنید.

## مزایای Near Me Messaging

### 1. صرفه‌جویی در زمان و نیروی انسانی در ارائه خدمات عالی به مشتریان

هنگامی که از Near Me Messaging استفاده می‌کنید، پاسخ به اساسی‌ترین سؤالات به طور خودکار بر اساس اطلاعات نمایه کسب‌وکار Google شما انجام می‌شود. هرچه اطلاعات بیشتری در نمایه کسب‌وکار Google شما باشد، عامل بهتر می‌تواند به سؤالات اساسی پاسخ دهد. و اگر می‌خواهید نمایه کسب‌وکار Google خود را به‌روزرسانی کنید، می‌توانید تغییرات خود را با Near Me همگام‌سازی کنید تا پاسخ‌های ربات به طور خودکار به‌روزرسانی شوند. عامل مجازی همچنین پاسخ‌هایی را از نظرات مرتبط کاربران در نمایه Google Maps شما که دارای رتبه ستاره بالایی هستند، تولید می‌کند. علاوه بر پاسخ‌های تولید شده خودکار، می‌توانید محتوای سفارشی بیشتری را از طریق سؤالات متداول و پایگاه دانش اضافه کنید، که در بخش بعدی با جزئیات بیشتری در مورد آنها بحث خواهیم کرد.

در عرض 5 دقیقه پس از ورود به وب‌سایت Near Me، می‌توانید عامل مجازی فعال خود را آزمایش کنید. عامل مجازی شما می‌تواند به پرسش‌های تکراری مشتریان به صورت 24/7 پاسخ‌های فوری ارائه دهد. به این ترتیب، می‌توانید روابط خود را با مشتریان خود بسازید و حفظ کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging یک ویژگی پرسش‌های متداول سفارشی برای شخصی‌سازی عامل مجازی ارائه می‌دهد"/>

*Near Me Messaging یک ویژگی پرسش‌های متداول سفارشی برای شخصی‌سازی عامل مجازی ارائه می‌دهد.*
</center>

### 2. قابلیت‌های خودکار و قابل تنظیم.

علاوه بر تولید پاسخ‌ها از نمایه کسب‌وکار و نظرات مشتریان، Near Me Messaging مجهز به قابلیت‌های سفارشی‌سازی خودکار است. برای شخصی‌سازی عامل مجازی خود، برخی از ویژگی‌های اساسی که می‌توانید سفارشی کنید عبارتند از نام عامل مجازی، پیام خوش‌آمدگویی و لوگو. مهم‌تر از آن، می‌توانید پاسخ‌های سفارشی به پرسش‌های کاربران را که مختص کسب‌وکار شما هستند، ایجاد کنید. این کار با ایجاد سؤالات متداول (FAQs) و افزودن اطلاعات بیشتر در مورد کسب‌وکار شما (مانند متن وب‌سایت شما) به پایگاه دانش انجام می‌شود.

پس از سفارشی‌سازی عامل خود، می‌توانید آن را به صورت خصوصی آزمایش کنید تا زمانی که از عملکرد آن راضی باشید. وقتی آماده شدید، می‌توانید آن را مستقیماً از وب‌سایت Near Me Messaging به صورت عمومی راه‌اندازی کنید. هنگامی که عامل مجازی خود را به صورت عمومی راه‌اندازی می‌کنید، می‌توانید به طور مداوم آن را بهبود بخشید، مانند افزودن سؤالات متداول بیشتر و تغییر پیام خوش‌آمدگویی. هر بار که عامل مجازی خود را بهبود می‌بخشید، فرصت دارید تغییرات را آزمایش کرده و سپس عامل را دوباره راه‌اندازی کنید. هنگامی که عامل را دوباره راه‌اندازی می‌کنید، تغییراتی که ایجاد کرده‌اید بلافاصله برای کاربران قابل مشاهده خواهد بود. به عنوان صاحبان کسب‌وکار، شما واقعاً آزادی و قدرت ساخت و بهبود عامل مجازی خود را بدون هزینه اضافی یا زمان ارتباط با تیم ما دارید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="رابط صفحه نمای کلی Near Me Messaging که در آن صاحبان کسب‌وکار می‌توانند پیام خوش‌آمدگویی را تغییر داده و عامل مجازی خود را بهبود بخشند"/>

*رابط صفحه نمای کلی Near Me Messaging که در آن صاحبان کسب‌وکار می‌توانند پیام خوش‌آمدگویی را تغییر داده و عامل مجازی خود را بهبود بخشند.*
</center>

### 3. از طریق Near Me Analytics بینش کسب کنید.

Near Me Messaging همچنین یک ویژگی تحلیلی را ارائه می‌دهد تا به شما در کسب بینش در مورد عملکرد عامل مجازی، ساعات اوج شلوغی و پیام‌های مشتریان کمک کند. همچنین می‌توانید در مورد سؤالاتی که عامل مجازی شما نتوانست پاسخی برای آنها پیدا کند، بینش کسب کنید تا بتوانید آنها را به سؤالات متداول سفارشی اضافه کنید. در نهایت، می‌توانید اطلاعات بیشتری در مورد موضوعات پربحث در نظرات Google کسب کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics به شما بینش‌هایی در مورد پیام‌های مشتریان می‌دهد."/>

*Near Me Analytics به شما بینش‌هایی در مورد پیام‌های مشتریان می‌دهد.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics به شما امکان می‌دهد ساعات اوج شلوغی عامل مجازی و سؤالات بی‌پاسخ را مشاهده کنید"/>

*Near Me Analytics به شما امکان می‌دهد ساعات اوج شلوغی عامل مجازی و سؤالات بی‌پاسخ را مشاهده کنید.*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics به شما امکان می‌دهد پربحث‌ترین موضوعات را در نظرات Google پیدا کنید."/>

*Near Me Analytics به شما امکان می‌دهد پربحث‌ترین موضوعات را در نظرات Google پیدا کنید.*
</center>

### 4. نیازهای مشتری خود را از طریق سابقه مکالمه درک کنید.

Near Me Messaging به شما امکان می‌دهد مکالمات بین عامل مجازی و مشتریان خود را مشاهده کنید. این می‌تواند به شما کمک کند تا بدانید چه کسی به کسب‌وکار شما علاقه دارد و عامل مجازی شما چگونه عمل می‌کند. علاوه بر این، شما همچنین می‌توانید برچسب‌هایی ایجاد کنید، آنها را به مکالمات اعمال کنید و سپس بر اساس برچسب فیلتر کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*ویژگی سابقه مکالمه Near Me Messaging.*
</center>

### 5. قابلیت چت مستقیم با مشتریان خود با ویژگی عامل زنده ما

Near Me Messaging همچنین مجهز به ویژگی عامل زنده است. مشتریان می‌توانند از طریق GBM روی "درخواست عامل زنده" کلیک کنند. هنگامی که مشتری یک عامل زنده را درخواست می‌کند، مالک یک اعلان از وب‌سایت Near Me دریافت خواهد کرد.

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="مشتریان می‌توانند از طریق دکمه چت در نمایه Google Maps درخواست عامل زنده کنند."/>

*مشتریان می‌توانند از طریق دکمه چت در نمایه Google Maps درخواست عامل زنده کنند.*
</center>

مالک می‌تواند در هر زمان به هر مکالمه‌ای بپیوندد، تا زمانی که کاربر در 30 روز گذشته پیامی ارسال کرده باشد. مشتری هنگامی که عامل زنده به مکالمه می‌پیوندد/ترک می‌کند، یک اعلان دریافت خواهد کرد. به محض اینکه عامل زنده مکالمه را ترک کند، تمام پیام‌ها دوباره به عامل مجازی هدایت می‌شوند. از سایت Near Me، تمام رویدادهای مکالمه قابل مشاهده است - بنابراین می‌توانید ببینید که کاربر چه زمانی یک عامل را درخواست می‌کند و چه زمانی عامل می‌پیوندد/ترک می‌کند، علاوه بر تمام پیام‌های ربات، کاربر و عامل.


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="هنگامی که مشتری یک عامل زنده را درخواست می‌کند، یک اعلان در وب‌سایت Near Me ظاهر می‌شود."/>

*هنگامی که مشتری یک عامل زنده را درخواست می‌کند، یک اعلان در وب‌سایت Near Me ظاهر می‌شود.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="رابط ویژگی عامل زنده Near Me."/>

*رابط ویژگی عامل زنده Near Me.*
</center>

آیا آماده شروع کار با Near Me Messaging هستید؟ منتظر پست بعدی ما در مورد نحوه راه‌اندازی عامل مجازی خود با Near Me Messaging باشید. [امروز یک دمو با ما رزرو کنید](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) و جزو اولین کسانی باشید که یک آزمایش رایگان از Near Me Messaging دریافت می‌کنید!
`;export{e as default};
