const e=`---
title: "नियर मी मैसेजिंग Google Business Messages का पूरक है"
metatitle: "नियर मी मैसेजिंग Google Business Messages का पूरक है"
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "नियर मी मैसेजिंग Google Business Messages के साथ संवादी AI को एकीकृत करता है, जिससे आपके Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से 24/7 सहायता मिलती है।"
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


हमारे पिछले ब्लॉगों में से एक में, हमने आपको [Google Business Messages के लाभों और सीमाओं](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/) के बारे में बताया था। Google Business Messages के सामान्य कार्यान्वयन के साथ दो मुख्य सीमाएँ हैं। पहली सीमा यह है कि एक पेशेवर परामर्श एजेंसी को आपके व्यवसाय के लिए शुरू से ही एक अनुकूलित वर्चुअल एजेंट बनाने के लिए बहुत पैसा और समय लगता है। दूसरी सीमा यह है कि व्यवसाय के मालिक सीधे ग्राहकों से बात नहीं कर सकते जब तक कि परामर्श एजेंसी अपने कार्यान्वयन के हिस्से के रूप में लाइव-चैट सुविधा प्रदान न करे।

अब आप सोच रहे होंगे, क्या इन बाधाओं को दूर करने का कोई समाधान है लेकिन फिर भी Google Business Messages के लाभ प्राप्त करें? इसीलिए हम नियर मी मैसेजिंग पेश करना चाहते हैं (अपडेट: हमने तब से उत्पाद को एक ओमनी-चैनल चैटबॉट बिल्डर में बदल दिया है। अब इसे [SeaChat](https://chat.seasalt.ai/?utm_source=blog) कहा जाता है!)।

## नियर मी मैसेजिंग के बारे में

नियर मी मैसेजिंग Google Business Messages के साथ अत्याधुनिक संवादी AI को एकीकृत करता है, जिससे ग्राहक आपके Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से दिन के किसी भी समय आपके व्यवसाय तक पहुंच सकते हैं। इस तरह, आप अपने व्यवसाय की देखभाल पर ध्यान केंद्रित कर सकते हैं जबकि नियर मी मैसेजिंग आपके ग्राहक पूछताछ को संभालता है। नियर मी मैसेजिंग को समान सेवाओं से अलग करने वाली बात 5 मिनट का सेटअप समय, सेल्फ-सर्विस अनुकूलन और अंतर्निहित लाइव चैट समर्थन है।

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="नियर मी मैसेजिंग Google Business Messages को आपके Google Maps प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।"/>

*नियर मी मैसेजिंग Google Business Messages को आपके Google Maps प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।*
</center>

सबसे पहले, जब व्यवसाय Google Business Messages को एकीकृत करते हैं, तो उन्हें शुरू से ही उनके लिए पूरी तरह से अनुकूलित अनुभव बनाने के लिए एक पेशेवर परामर्श एजेंसी को भुगतान करना होगा। ये आमतौर पर महंगे होते हैं और इसमें समय लगता है। हम समझते हैं कि Google Business Messages का लाभ उठाने के लिए विशिष्ट समय और संसाधन निवेश कई छोटे व्यवसायों के लिए एक बाधा है। नियर मी मैसेजिंग एसएमई के लिए एक किफायती समाधान प्रदान करके इस सीमा को हल करता है। आप 5 मिनट से भी कम समय में एक कार्यशील वर्चुअल एजेंट प्राप्त कर सकते हैं। इसके अलावा, आप नियर मी मैसेजिंग वेबसाइट से किसी भी समय अपने वर्चुअल एजेंट को लगातार अपडेट और अनुकूलित कर सकते हैं। नियर मी मैसेजिंग साइट पर आपके द्वारा किए गए परिवर्तन उन ग्राहकों के लिए तुरंत प्रभावी होते हैं जो आपके एजेंट के साथ इंटरैक्ट कर रहे हैं।

इसके अतिरिक्त, जब आप Google Business Profile पर चैट बटन सक्षम करते हैं, तो आपके पास उपलब्ध होने पर अपने ग्राहकों को जवाब देने की क्षमता होती है। लेकिन जब आप Google Business Messages को एकीकृत करते हैं, तो आपके आने वाले संदेश आपके लाइव एजेंट को रूट किए जाते हैं, और आप Google Business Profile के भीतर सीधे ग्राहकों के साथ चैट करने की अपनी क्षमता खो देते हैं। नियर मी मैसेजिंग बिना किसी अतिरिक्त लागत या सेटअप समय के लाइव एजेंट सुविधा प्रदान करके इस सीमा को हल करता है। लाइव एजेंट सुविधा के साथ, ग्राहक किसी भी समय एक वास्तविक व्यक्ति को स्थानांतरित करने का अनुरोध कर सकते हैं। जब आप एक लाइव एजेंट अनुरोध देखते हैं, या यदि आप वर्चुअल एजेंट के लिए कार्यभार संभालना चाहते हैं, तो आप बातचीत में शामिल हो सकते हैं और सीधे अपने ग्राहकों से बात कर सकते हैं।

## नियर मी मैसेजिंग के लाभ

### 1. उत्कृष्ट ग्राहक सेवा प्रदान करने में समय और जनशक्ति बचाता है

जब आप नियर मी मैसेजिंग का उपयोग करते हैं, तो सबसे बुनियादी सवालों के जवाब आपके Google Business Profile की जानकारी के आधार पर स्वचालित रूप से संभाले जाते हैं। आपके Google Business Profile पर जितनी अधिक जानकारी होगी, एजेंट बुनियादी सवालों का जवाब देने में उतना ही बेहतर होगा। और यदि आप कभी भी अपने Google Business Profile को अपडेट करना चाहते हैं, तो आप बॉट प्रतिक्रियाओं को स्वचालित रूप से अपडेट करने के लिए अपने परिवर्तनों को नियर मी के साथ सिंक कर सकते हैं। वर्चुअल एजेंट आपके Google Maps प्रोफ़ाइल पर संबंधित उपयोगकर्ता समीक्षाओं से भी प्रतिक्रियाएं उत्पन्न करेगा जिनकी उच्च स्टार रेटिंग है। स्वचालित रूप से उत्पन्न प्रतिक्रियाओं के अलावा, आप अक्सर पूछे जाने वाले प्रश्नों और ज्ञान आधार के माध्यम से अधिक कस्टम सामग्री जोड़ सकते हैं, जिस पर हम अगले खंड में अधिक विस्तार से चर्चा करेंगे।

नियर मी वेबसाइट में लॉग इन करने के 5 मिनट के भीतर, आप अपने स्वयं के कार्यशील वर्चुअल एजेंट का परीक्षण कर सकते हैं। आपका वर्चुअल एजेंट ग्राहकों की दोहराई जाने वाली पूछताछ का 24/7 तुरंत जवाब दे सकता है। इस तरह, आप अपने ग्राहकों के साथ अपने संबंध बना और बनाए रख सकते हैं।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="नियर मी मैसेजिंग वर्चुअल एजेंट को वैयक्तिकृत करने के लिए एक कस्टम FAQ सुविधा प्रदान करता है"/>

*नियर मी मैसेजिंग वर्चुअल एजेंट को वैयक्तिकृत करने के लिए एक कस्टम FAQ सुविधा प्रदान करता है।*
</center>

### 2. सेल्फ-सर्विस और अनुकूलन योग्य क्षमताएं।

आपके व्यवसाय प्रोफ़ाइल और ग्राहक समीक्षाओं से प्रतिक्रियाएँ उत्पन्न करने के अलावा, नियर मी मैसेजिंग सेल्फ-सर्विस अनुकूलन क्षमताओं से लैस है। अपने वर्चुअल एजेंट को वैयक्तिकृत करने के लिए, आप वर्चुअल एजेंट का नाम, स्वागत संदेश और लोगो जैसे कुछ बुनियादी सुविधाओं को अनुकूलित कर सकते हैं। इससे भी महत्वपूर्ण बात यह है कि आप उपयोगकर्ता प्रश्नों के लिए कस्टम प्रतिक्रियाएँ तैयार कर सकते हैं जो आपके व्यवसाय के लिए विशिष्ट हैं। यह अक्सर पूछे जाने वाले प्रश्नों (FAQs) को बनाकर और अपने व्यवसाय के बारे में अधिक जानकारी (जैसे आपकी वेबसाइट से टेक्स्ट) को ज्ञान आधार में जोड़कर किया जाता है।

अपने एजेंट को अनुकूलित करने के बाद, आपके पास प्रदर्शन से संतुष्ट होने तक इसका निजी तौर पर परीक्षण करने की क्षमता होती है। जब आप तैयार हों, तो आप इसे सीधे नियर मी मैसेजिंग वेबसाइट से सार्वजनिक रूप से लॉन्च कर सकते हैं। एक बार जब आप अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च कर देते हैं, तो आपके पास अपने वर्चुअल एजेंट को लगातार बेहतर बनाने की क्षमता होती है, जैसे कि अधिक FAQs जोड़ना और स्वागत संदेश बदलना। हर बार जब आप अपने वर्चुअल एजेंट को बेहतर बनाते हैं, तो आपके पास परिवर्तनों का परीक्षण करने और फिर एजेंट को फिर से लॉन्च करने का अवसर होता है। जब आप एजेंट को फिर से लॉन्च करते हैं, तो आपके द्वारा किए गए परिवर्तन उपयोगकर्ताओं को तुरंत दिखाई देंगे। व्यवसाय के मालिकों के रूप में, आपके पास वास्तव में हमारी टीम के साथ अतिरिक्त लागत या संचार समय के बिना अपने वर्चुअल एजेंट को बनाने और बेहतर बनाने की स्वतंत्रता और शक्ति है।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="नियर मी मैसेजिंग अवलोकन पृष्ठ का इंटरफ़ेस जहां व्यवसाय के मालिक स्वागत संदेश को संशोधित कर सकते हैं और अपने वर्चुअल एजेंट को बेहतर बना सकते हैं"/>

*नियर मी मैसेजिंग अवलोकन पृष्ठ का इंटरफ़ेस जहां व्यवसाय के मालिक स्वागत संदेश को संशोधित कर सकते हैं और अपने वर्चुअल एजेंट को बेहतर बना सकते हैं।*
</center>

### 3. नियर मी एनालिटिक्स के माध्यम से अंतर्दृष्टि प्राप्त करें।

नियर मी मैसेजिंग आपको अपने वर्चुअल एजेंट के प्रदर्शन, व्यस्ततम घंटों और ग्राहक संदेशों में अंतर्दृष्टि प्राप्त करने में मदद करने के लिए एक एनालिटिक्स सुविधा भी प्रदान करता है। आप उन प्रश्नों के बारे में भी अंतर्दृष्टि प्राप्त कर सकते हैं जिनके लिए आपका वर्चुअल एजेंट कोई प्रतिक्रिया नहीं ढूंढ सका ताकि आप उन्हें कस्टम FAQ में जोड़ सकें। अंत में, आप Google समीक्षाओं में सबसे अधिक उल्लिखित विषयों के बारे में भी अधिक जान सकते हैं।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="नियर मी एनालिटिक्स आपको अपने ग्राहक संदेशों में अंतर्दृष्टि देता है।"/>

*नियर मी एनालिटिक्स आपको अपने ग्राहक संदेशों में अंतर्दृष्टि देता है।*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="नियर मी एनालिटिक्स आपको अपने वर्चुअल एजेंट के व्यस्ततम घंटों और अनुत्तरित प्रश्नों को देखने की अनुमति देता है"/>

*नियर मी एनालिटिक्स आपको अपने वर्चुअल एजेंट के व्यस्ततम घंटों और अनुत्तरित प्रश्नों को देखने की अनुमति देता है।*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="नियर मी एनालिटिक्स आपको Google समीक्षाओं में सबसे अधिक उल्लिखित विषयों को खोजने की अनुमति देता है।"/>

*नियर मी एनालिटिक्स आपको Google समीक्षाओं में सबसे अधिक उल्लिखित विषयों को खोजने की अनुमति देता है।*
</center>

### 4. बातचीत के इतिहास के माध्यम से अपने ग्राहक की जरूरतों को समझें।

नियर मी मैसेजिंग आपको अपने वर्चुअल एजेंट और आपके ग्राहकों के बीच बातचीत देखने की अनुमति देता है। यह आपको यह जानने में मदद कर सकता है कि आपके व्यवसाय में कौन रुचि रखता है और आपका वर्चुअल एजेंट कैसा प्रदर्शन कर रहा है। इसके अतिरिक्त, आपके पास लेबल बनाने, उन्हें बातचीत पर लागू करने और फिर लेबल के आधार पर फ़िल्टर करने की क्षमता भी है।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*नियर मी मैसेजिंग बातचीत इतिहास सुविधा।*
</center>

### 5. हमारी लाइव एजेंट सुविधा के साथ अपने ग्राहकों के साथ सीधे चैट करने की क्षमता

नियर मी मैसेजिंग एक लाइव एजेंट सुविधा से भी लैस है। ग्राहक GBM के माध्यम से "लाइव एजेंट का अनुरोध करें" पर क्लिक कर सकते हैं। जब कोई ग्राहक लाइव एजेंट का अनुरोध करता है, तो मालिक को नियर मी वेबसाइट से एक सूचना प्राप्त होगी।

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="ग्राहक Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से लाइव एजेंट का अनुरोध कर सकते हैं।"/>

*ग्राहक Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से लाइव एजेंट का अनुरोध कर सकते हैं।*
</center>

मालिक किसी भी समय किसी भी बातचीत में शामिल हो सकता है जब तक कि उपयोगकर्ता ने पिछले 30 दिनों के भीतर एक संदेश भेजा हो। ग्राहक को एक सूचना प्राप्त होगी जब लाइव एजेंट बातचीत में शामिल होगा/छोड़ेगा। जैसे ही लाइव एजेंट बातचीत छोड़ता है, सभी संदेशों को फिर से वर्चुअल एजेंट को रूट किया जाएगा। नियर मी साइट से, सभी बातचीत की घटनाओं को देखा जा सकता है - ताकि आप देख सकें कि उपयोगकर्ता कब एक एजेंट का अनुरोध करता है और एजेंट कब शामिल होता है/छोड़ता है, बॉट, उपयोगकर्ता और एजेंट के सभी संदेशों के अतिरिक्त।


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="जब कोई ग्राहक लाइव एजेंट का अनुरोध करेगा तो नियर मी वेबसाइट पर एक सूचना पॉप अप होगी।"/>

*जब कोई ग्राहक लाइव एजेंट का अनुरोध करेगा तो नियर मी वेबसाइट पर एक सूचना पॉप अप होगी।*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="नियर मी लाइव एजेंट सुविधा का इंटरफ़ेस।"/>

*नियर मी लाइव एजेंट सुविधा का इंटरफ़ेस।*
</center>

क्या आप नियर मी मैसेजिंग के साथ शुरुआत करने के लिए तैयार हैं? नियर मी मैसेजिंग के साथ अपने वर्चुअल एजेंट को कैसे लॉन्च करें, इस बारे में हमारी अगली पोस्ट के लिए बने रहें। [आज ही हमारे साथ एक डेमो बुक करें](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) और नियर मी मैसेजिंग का मुफ्त परीक्षण प्राप्त करने वाले पहले लोगों में से एक बनें!
`;export{e as default};
