const e=`---
title: "Near Me Messaging дополняет Google Business Messages"
metatitle: "Near Me Messaging дополняет Google Business Messages"
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "Near Me Messaging интегрирует разговорный ИИ с Google Business Messages, обеспечивая круглосуточную поддержку через кнопку чата в вашем профиле Google Maps."
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


В одном из наших предыдущих блогов мы рассказали вам о [преимуществах и ограничениях Google Business Messages](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/). Существует два основных ограничения в распространенных реализациях Google Business Messages. Первое ограничение заключается в том, что требуется много денег и времени, чтобы заплатить профессиональному консалтинговому агентству за создание индивидуального виртуального агента для вашего бизнеса с нуля. Второе ограничение заключается в том, что владельцы бизнеса не могут напрямую общаться с клиентами, если консалтинговое агентство не предоставляет функцию живого чата как часть своей реализации.

Теперь вы можете задаться вопросом, есть ли решение для преодоления этих барьеров, но при этом получить преимущества Google Business Messages? Именно поэтому мы хотим представить Near Me Messaging (Обновление: с тех пор мы переориентировали продукт на создание омниканальных чат-ботов. Теперь он называется [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!).

## О Near Me Messaging

Near Me Messaging интегрирует передовой разговорный ИИ с Google Business Messages, позволяя клиентам связываться с вашим бизнесом в любое время суток через кнопку чата в вашем профиле Google Maps. Таким образом, вы можете сосредоточиться на ведении своего бизнеса, пока Near Me Messaging обрабатывает запросы ваших клиентов. Что отличает Near Me Messaging от аналогичных сервисов, так это 5-минутное время настройки, самостоятельная настройка и встроенная поддержка живого чата.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Maps."/>

*Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Maps.*
</center>

Прежде всего, когда компании интегрируют Google Business Messages, им необходимо заплатить профессиональному консалтинговому агентству за создание полностью индивидуального опыта с нуля. Это обычно дорого и занимает много времени. Мы понимаем, что типичные временные и ресурсные затраты для использования Google Business Messages являются барьером для входа для многих малых предприятий. Near Me Messaging решает это ограничение, предоставляя доступное решение для малых и средних предприятий. Вы можете получить работающего виртуального агента менее чем за 5 минут. Более того, вы можете постоянно обновлять и настраивать своего виртуального агента в любое время с веб-сайта Near Me Messaging. Изменения, которые вы вносите на сайте Near Me Messaging, вступают в силу немедленно для клиентов, которые взаимодействуют с вашим агентом.

В дополнение к этому, когда вы включаете кнопку чата в профиле Google Business, у вас есть возможность отвечать своим клиентам, когда вы доступны. Но когда вы интегрируете Google Business Messages, ваши входящие сообщения направляются вашему живому агенту, и вы теряете возможность напрямую общаться с клиентами в профиле Google Business. Near Me Messaging решает это ограничение, предоставляя функцию живого агента без дополнительных затрат или времени на настройку. С функцией живого агента клиенты могут запросить перевод на реального человека в любое время. Когда вы видите запрос живого агента, или если вы хотите взять на себя управление виртуальным агентом, вы можете присоединиться к разговору и напрямую общаться со своими клиентами.

## Преимущества Near Me Messaging

### 1. Экономит время и трудозатраты при предоставлении отличного обслуживания клиентов

При использовании Near Me Messaging ответы на самые основные вопросы обрабатываются автоматически на основе информации из вашего профиля Google Business. Чем больше информации в вашем профиле Google Business, тем лучше агент сможет отвечать на основные вопросы. И если вы когда-либо захотите обновить свой профиль Google Business, вы можете синхронизировать свои изменения с Near Me, чтобы автоматически обновлять ответы бота. Виртуальный агент также будет генерировать ответы из соответствующих отзывов пользователей в вашем профиле Google Maps, которые имеют высокий рейтинг. Помимо автоматически генерируемых ответов, вы можете добавлять больше пользовательского контента через часто задаваемые вопросы и базу знаний, которые мы обсудим более подробно в следующем разделе.

В течение 5 минут после входа на веб-сайт Near Me вы можете протестировать своего собственного работающего виртуального агента. Ваш виртуальный агент может предоставлять мгновенные ответы на повторяющиеся запросы клиентов 24/7. Таким образом, вы можете строить и поддерживать свои отношения с клиентами.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging предоставляет настраиваемую функцию часто задаваемых вопросов для персонализации виртуального агента"/>

*Near Me Messaging предоставляет настраиваемую функцию часто задаваемых вопросов для персонализации виртуального агента.*
</center>

### 2. Возможности самообслуживания и настройки.

Помимо генерации ответов из вашего бизнес-профиля и отзывов клиентов, Near Me Messaging оснащен возможностями самообслуживания и настройки. Чтобы персонализировать вашего виртуального агента, некоторые из основных функций, которые вы можете настроить, — это имя виртуального агента, приветственное сообщение и логотип. Что еще более важно, вы можете создавать пользовательские ответы на запросы пользователей, которые специфичны для вашего бизнеса. Это делается путем создания часто задаваемых вопросов (FAQ) и добавления дополнительной информации о вашем бизнесе (например, текста с вашего веб-сайта) в базу знаний.

После настройки вашего агента вы можете тестировать его в частном порядке, пока не будете удовлетворены производительностью. Когда вы будете готовы, вы можете запустить его публично прямо с веб-сайта Near Me Messaging. После публичного запуска вашего виртуального агента у вас есть возможность постоянно улучшать его, например, добавлять больше часто задаваемых вопросов и изменять приветственное сообщение. Каждый раз, когда вы улучшаете своего виртуального агента, у вас есть возможность протестировать изменения, а затем перезапустить агента. Когда вы перезапускаете агента, внесенные вами изменения будут немедленно видны пользователям. Как владельцы бизнеса, вы действительно имеете свободу и власть создавать и улучшать своего виртуального агента без дополнительных затрат или времени на общение с нашей командой.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="Интерфейс страницы обзора Near Me Messaging, где владельцы бизнеса могут изменять приветственное сообщение и улучшать своего виртуального агента"/>

*Интерфейс страницы обзора Near Me Messaging, где владельцы бизнеса могут изменять приветственное сообщение и улучшать своего виртуального агента.*
</center>

### 3. Получайте инсайты через Near Me Analytics.

Near Me Messaging также предлагает функцию аналитики, которая поможет вам получить представление о производительности вашего виртуального агента, самых загруженных часах и сообщениях клиентов. Вы также можете получить представление о вопросах, на которые ваш виртуальный агент не смог найти ответ, чтобы вы могли добавить их в пользовательские часто задаваемые вопросы. Наконец, вы также можете узнать больше о наиболее часто упоминаемых темах в отзывах Google.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics дает вам представление о сообщениях ваших клиентов."/>

*Near Me Analytics дает вам представление о сообщениях ваших клиентов.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics позволяет вам видеть самые загруженные часы вашего виртуального агента и неотвеченные вопросы"/>

*Near Me Analytics позволяет вам видеть самые загруженные часы вашего виртуального агента и неотвеченные вопросы.*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics позволяет вам найти наиболее часто упоминаемые темы в отзывах Google."/>

*Near Me Analytics позволяет вам найти наиболее часто упоминаемые темы в отзывах Google.*
</center>

### 4. Поймите, что нужно вашему клиенту, через историю разговоров.

Near Me Messaging позволяет вам просматривать разговоры между вашим виртуальным агентом и вашими клиентами. Это может помочь вам узнать, кто заинтересован в вашем бизнесе и как работает ваш виртуальный агент. Кроме того, у вас также есть возможность создавать метки, применять их к разговорам, а затем фильтровать по метке.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*Функция истории разговоров Near Me Messaging.*
</center>

### 5. Возможность напрямую общаться с вашими клиентами с помощью нашей функции живого агента

Near Me Messaging также оснащен функцией живого агента. Клиенты могут нажать «запросить живого агента» через GBM. Когда клиент запрашивает живого агента, владелец получит уведомление с веб-сайта Near Me.

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="Клиенты могут запросить живого агента через кнопку чата в профиле Google Maps."/>

*Клиенты могут запросить живого агента через кнопку чата в профиле Google Maps.*
</center>

Владелец может присоединиться к любому разговору в любое время, если пользователь отправил сообщение в течение последних 30 дней. Клиент получит уведомление, когда живой агент присоединится/покинет разговор. Как только живой агент покинет разговор, все сообщения будут перенаправлены обратно виртуальному агенту. На сайте Near Me можно увидеть все события разговора — так что вы можете видеть, когда пользователь запрашивает агента и когда агент присоединяется/покидает, в дополнение ко всем сообщениям от бота, пользователя и агента.


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="Уведомление появится на веб-сайте Near Me, когда клиент запросит живого агента."/>

*Уведомление появится на веб-сайте Near Me, когда клиент запросит живого агента.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="Интерфейс функции живого агента Near Me."/>

*Интерфейс функции живого агента Near Me.*
</center>

Готовы начать работу с Near Me Messaging? Следите за нашей следующей публикацией о том, как запустить вашего виртуального агента с помощью Near Me Messaging. [Забронируйте демонстрацию с нами](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) сегодня и станьте одним из первых, кто получит бесплатную пробную версию Near Me Messaging!
`;export{e as default};
