const e=`---
title: "Near Me Messaging يكمل رسائل Google Business"
metatitle: "Near Me Messaging يكمل رسائل Google Business"
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "Near Me Messaging يدمج الذكاء الاصطناعي للمحادثة مع رسائل Google Business، مما يتيح الدعم على مدار الساعة طوال أيام الأسبوع عبر زر الدردشة في ملفك الشخصي على خرائط Google."
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


في إحدى مدوناتنا السابقة، قمنا بتوضيح [فوائد وقيود رسائل Google Business](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/). هناك قيودان رئيسيان على التطبيقات الشائعة لرسائل Google Business. القيد الأول هو أن الأمر يتطلب الكثير من المال والوقت لدفع وكالة استشارية محترفة لإنشاء وكيل افتراضي مخصص لعملك من الألف إلى الياء. القيد الثاني هو أن أصحاب الأعمال لا يستطيعون التحدث مباشرة إلى العملاء ما لم توفر الوكالة الاستشارية ميزة الدردشة المباشرة كجزء من تطبيقها.

الآن قد تتساءل، هل هناك حل للتغلب على هذه الحواجز ولكن لا يزال بإمكانك الاستفادة من رسائل Google Business؟ لهذا السبب نريد تقديم Near Me Messaging (تحديث: لقد قمنا منذ ذلك الحين بتحويل المنتج ليكون منشئ روبوتات محادثة متعددة القنوات. يسمى الآن [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!).

## حول Near Me Messaging

يدمج Near Me Messaging الذكاء الاصطناعي للمحادثة المتطور مع رسائل Google Business، مما يسمح للعملاء بالوصول إلى عملك في أي وقت من اليوم عبر زر الدردشة في ملفك الشخصي على خرائط Google. بهذه الطريقة، يمكنك التركيز على رعاية عملك بينما يتعامل Near Me Messaging مع استفسارات عملائك. ما يميز Near Me Messaging عن الخدمات المماثلة هو وقت الإعداد الذي يستغرق 5 دقائق، والتخصيص الذاتي، ودعم الدردشة المباشرة المدمج.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging يدمج رسائل Google Business مع زر الدردشة في ملفك الشخصي على خرائط Google."/>

*Near Me Messaging يدمج رسائل Google Business مع زر الدردشة في ملفك الشخصي على خرائط Google.*
</center>

أولاً وقبل كل شيء، عندما تدمج الشركات رسائل Google Business، فإنها تحتاج إلى دفع وكالة استشارية محترفة لإنشاء تجربة مخصصة بالكامل لهم من الألف إلى الياء. عادة ما تكون هذه مكلفة وتستغرق وقتًا. نحن ندرك أن الاستثمار النموذجي للوقت والموارد للاستفادة من رسائل Google Business يمثل حاجزًا أمام دخول العديد من الشركات الصغيرة. يحل Near Me Messaging هذا القيد من خلال توفير حل ميسور التكلفة للشركات الصغيرة والمتوسطة. يمكنك الحصول على وكيل افتراضي يعمل في أقل من 5 دقائق. علاوة على ذلك، يمكنك تحديث وكيلك الافتراضي وتخصيصه باستمرار في أي وقت من موقع Near Me Messaging. التغييرات التي تجريها على موقع Near Me Messaging تصبح سارية المفعول على الفور للعملاء الذين يتفاعلون مع وكيلك.

بالإضافة إلى ذلك، عند تمكين زر الدردشة في ملف Google Business، لديك القدرة على الرد على عملائك متى كنت متاحًا. ولكن عند دمج رسائل Google Business، يتم توجيه رسائلك الواردة إلى وكيلك المباشر، وتفقد قدرتك على الدردشة مباشرة مع العملاء داخل ملف Google Business. يحل Near Me Messaging هذا القيد من خلال توفير ميزة وكيل مباشر بدون تكلفة إضافية أو وقت إعداد. باستخدام ميزة الوكيل المباشر، يمكن للعملاء طلب التحويل إلى شخص حقيقي في أي وقت. عندما ترى طلب وكيل مباشر، أو إذا كنت ترغب في تولي مهام الوكيل الافتراضي، يمكنك الانضمام إلى المحادثة والتحدث مباشرة إلى عملائك.

## فوائد Near Me Messaging

### 1. يوفر الوقت والقوى العاملة في تقديم خدمة عملاء ممتازة

عند استخدام Near Me Messaging، يتم التعامل مع الردود على الأسئلة الأساسية تلقائيًا بناءً على المعلومات من ملف Google Business الخاص بك. كلما زادت المعلومات في ملف Google Business الخاص بك، كان الوكيل أفضل في الرد على الأسئلة الأساسية. وإذا أردت تحديث ملف Google Business الخاص بك، يمكنك مزامنة تغييراتك مع Near Me لتحديث استجابات الروبوت تلقائيًا. سيقوم الوكيل الافتراضي أيضًا بإنشاء ردود من مراجعات المستخدم ذات الصلة على ملف Google Maps الخاص بك والتي تحتوي على تصنيف عالٍ بالنجوم. بالإضافة إلى الردود التي يتم إنشاؤها تلقائيًا، يمكنك إضافة المزيد من المحتوى المخصص عبر الأسئلة الشائعة وقاعدة المعرفة، والتي سنناقشها بمزيد من التفصيل في القسم التالي. 

في غضون 5 دقائق من تسجيل الدخول إلى موقع Near Me، يمكنك اختبار وكيلك الافتراضي العامل. يمكن لوكيلك الافتراضي تقديم إجابات فورية لاستفسارات العملاء المتكررة على مدار الساعة طوال أيام الأسبوع. بهذه الطريقة، يمكنك بناء علاقاتك مع عملائك والحفاظ عليها.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="يوفر Near Me Messaging ميزة الأسئلة الشائعة المخصصة لتخصيص الوكيل الافتراضي"/>

*يوفر Near Me Messaging ميزة الأسئلة الشائعة المخصصة لتخصيص الوكيل الافتراضي.*
</center>

### 2. إمكانيات الخدمة الذاتية والتخصيص.

بالإضافة إلى إنشاء الردود من ملفك التجاري ومراجعات العملاء، تم تجهيز Near Me Messaging بقدرات تخصيص ذاتية الخدمة. من أجل تخصيص وكيلك الافتراضي، بعض الميزات الأساسية التي يمكنك تخصيصها هي اسم الوكيل الافتراضي، رسالة الترحيب، والشعار. والأهم من ذلك، يمكنك صياغة ردود مخصصة لاستفسارات المستخدمين الخاصة بعملك. يتم ذلك عن طريق إنشاء أسئلة متكررة (FAQs) وإضافة المزيد من المعلومات حول عملك (مثل النص من موقع الويب الخاص بك) إلى قاعدة المعرفة.

بعد تخصيص وكيلك، يمكنك اختباره بشكل خاص حتى تكون راضيًا عن الأداء. عندما تكون جاهزًا، يمكنك إطلاقه للجمهور مباشرة من موقع Near Me Messaging. بمجرد إطلاق وكيلك الافتراضي علنًا، يمكنك تحسين وكيلك الافتراضي باستمرار مثل إضافة المزيد من الأسئلة الشائعة وتغيير رسالة الترحيب. في كل مرة تقوم فيها بتحسين وكيلك الافتراضي، لديك الفرصة لاختبار التغييرات ثم إعادة إطلاق الوكيل. عند إعادة إطلاق الوكيل، ستكون التغييرات التي أجريتها مرئية للمستخدمين على الفور. بصفتك أصحاب أعمال، لديك حقًا الحرية والقوة لبناء وتحسين وكيلك الافتراضي دون تكلفة إضافية أو وقت اتصال مع فريقنا. 

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="واجهة صفحة نظرة عامة على Near Me Messaging حيث يمكن لأصحاب الأعمال تعديل رسالة الترحيب وتحسين وكيلهم الافتراضي"/>

*واجهة صفحة نظرة عامة على Near Me Messaging حيث يمكن لأصحاب الأعمال تعديل رسالة الترحيب وتحسين وكيلهم الافتراضي.*
</center>

### 3. اكتساب رؤى من خلال Near Me Analytics.

يوفر Near Me Messaging أيضًا ميزة التحليلات لمساعدتك في الحصول على رؤى حول أداء وكيلك الافتراضي، وساعات الذروة، ورسائل العملاء. يمكنك أيضًا الحصول على رؤى حول الأسئلة التي لم يتمكن وكيلك الافتراضي من العثور على رد لها حتى تتمكن من إضافتها إلى الأسئلة الشائعة المخصصة. أخيرًا، يمكنك أيضًا معرفة المزيد حول الموضوعات الأكثر ذكرًا في مراجعات Google.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="تمنحك تحليلات Near Me رؤى حول رسائل عملائك."/>

*تمنحك تحليلات Near Me رؤى حول رسائل عملائك.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="تسمح لك تحليلات Near Me برؤية ساعات الذروة لوكيلك الافتراضي والأسئلة التي لم يتم الرد عليها"/>

*تسمح لك تحليلات Near Me برؤية ساعات الذروة لوكيلك الافتراضي والأسئلة التي لم يتم الرد عليها.*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="تسمح لك تحليلات Near Me بالعثور على الموضوعات الأكثر ذكرًا في مراجعات Google."/>

*تسمح لك تحليلات Near Me بالعثور على الموضوعات الأكثر ذكرًا في مراجعات Google.*
</center>

### 4. فهم ما يحتاجه عميلك من خلال سجل المحادثات.

يتيح لك Near Me Messaging رؤية المحادثات بين وكيلك الافتراضي وعملائك. يمكن أن يساعدك هذا في معرفة من يهتم بعملك وكيف يعمل وكيلك الافتراضي. بالإضافة إلى ذلك، لديك أيضًا القدرة على إنشاء تسميات وتطبيقها على المحادثات ثم التصفية بناءً على التسمية.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*ميزة سجل المحادثات في Near Me Messaging.*
</center>

### 5. القدرة على الدردشة مباشرة مع عملائك من خلال ميزة الوكيل المباشر لدينا

تم تجهيز Near Me Messaging أيضًا بميزة الوكيل المباشر. يمكن للعملاء النقر على "طلب وكيل مباشر" عبر GBM. عندما يطلب العميل وكيلًا مباشرًا، سيتلقى المالك إشعارًا من موقع Near Me.

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="يمكن للعملاء طلب وكيل مباشر عبر زر الدردشة في ملف Google Maps."/>

*يمكن للعملاء طلب وكيل مباشر عبر زر الدردشة في ملف Google Maps.*
</center>

يمكن للمالك الانضمام إلى أي محادثة في أي وقت طالما أن المستخدم قد أرسل رسالة خلال آخر 30 يومًا. سيتلقى العميل إشعارًا عندما ينضم الوكيل المباشر إلى المحادثة/يغادرها. بمجرد مغادرة الوكيل المباشر للمحادثة، سيتم توجيه جميع الرسائل مرة أخرى إلى الوكيل الافتراضي. من موقع Near Me، يمكن رؤية جميع أحداث المحادثة - حتى تتمكن من رؤية متى يطلب المستخدم وكيلًا ومتى ينضم الوكيل/يغادر، بالإضافة إلى جميع الرسائل من الروبوت والمستخدم والوكيل.


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="سيظهر إشعار على موقع Near Me عندما يطلب العميل وكيلًا مباشرًا."/>

*سيظهر إشعار على موقع Near Me عندما يطلب العميل وكيلًا مباشرًا.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="واجهة ميزة الوكيل المباشر في Near Me."/>

*واجهة ميزة الوكيل المباشر في Near Me.*
</center>

هل أنت مستعد للبدء باستخدام Near Me Messaging؟ ترقبوا منشورنا التالي حول كيفية إطلاق وكيلك الافتراضي باستخدام Near Me Messaging. [احجز عرضًا توضيحيًا معنا](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) اليوم وكن من أوائل من يحصل على نسخة تجريبية مجانية من Near Me Messaging!
`;export{e as default};
