const e=`---
title: "Near Me Messaging เสริม Google Business Messages"
metatitle: "Near Me Messaging เสริม Google Business Messages"
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "Near Me Messaging ผสานรวม AI เชิงสนทนากับ Google Business Messages ทำให้สามารถรองรับการสนับสนุนตลอด 24 ชั่วโมงทุกวันผ่านปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ"
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


ในบล็อกก่อนหน้าของเรา เราได้แนะนำคุณเกี่ยวกับ [ประโยชน์และข้อจำกัดของ Google Business Messages](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/) มีข้อจำกัดหลักสองประการในการใช้งาน Google Business Messages ทั่วไป ข้อจำกัดแรกคือต้องใช้เงินและเวลามากในการจ่ายเงินให้บริษัทที่ปรึกษามืออาชีพเพื่อสร้างตัวแทนเสมือนที่ปรับแต่งสำหรับธุรกิจของคุณตั้งแต่เริ่มต้น ข้อจำกัดที่สองคือเจ้าของธุรกิจไม่สามารถพูดคุยกับลูกค้าได้โดยตรง เว้นแต่บริษัทที่ปรึกษาจะจัดหาคุณสมบัติแชทสดเป็นส่วนหนึ่งของการใช้งาน

ตอนนี้คุณอาจสงสัยว่ามีวิธีแก้ไขเพื่อเอาชนะอุปสรรคเหล่านี้แต่ยังคงได้รับประโยชน์จาก Google Business Messages หรือไม่ นั่นคือเหตุผลที่เราต้องการแนะนำ Near Me Messaging (อัปเดต: เราได้เปลี่ยนผลิตภัณฑ์ให้เป็นเครื่องมือสร้างแชทบอทแบบ omni-channel แล้ว ตอนนี้เรียกว่า [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!) 

## เกี่ยวกับ Near Me Messaging

Near Me Messaging ผสานรวม AI เชิงสนทนาที่ล้ำสมัยเข้ากับ Google Business Messages ทำให้ลูกค้าสามารถติดต่อธุรกิจของคุณได้ตลอดเวลาผ่านปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ ด้วยวิธีนี้ คุณสามารถมุ่งเน้นไปที่การดูแลธุรกิจของคุณในขณะที่ Near Me Messaging จัดการคำถามของลูกค้าของคุณ สิ่งที่ทำให้ Near Me Messaging แตกต่างจากบริการที่คล้ายกันคือเวลาตั้งค่า 5 นาที การปรับแต่งด้วยตนเอง และการสนับสนุนแชทสดในตัว

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging ผสานรวม Google Business Messages กับปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ"/>

*Near Me Messaging ผสานรวม Google Business Messages กับปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ*
</center>

ประการแรก เมื่อธุรกิจรวม Google Business Messages เข้าด้วยกัน พวกเขาจำเป็นต้องจ่ายเงินให้บริษัทที่ปรึกษามืออาชีพเพื่อสร้างประสบการณ์ที่ปรับแต่งได้อย่างเต็มที่ตั้งแต่เริ่มต้น ซึ่งโดยปกติแล้วจะมีราคาแพงและใช้เวลามาก เราเข้าใจว่าการลงทุนเวลาและทรัพยากรโดยทั่วไปเพื่อใช้ประโยชน์จาก Google Business Messages เป็นอุปสรรคต่อธุรกิจขนาดเล็กจำนวนมาก Near Me Messaging แก้ไขข้อจำกัดนี้โดยการนำเสนอโซลูชันราคาไม่แพงสำหรับ SMEs คุณสามารถมีตัวแทนเสมือนที่ทำงานได้ภายในเวลาไม่ถึง 5 นาที นอกจากนี้ คุณสามารถอัปเดตและปรับแต่งตัวแทนเสมือนของคุณได้อย่างต่อเนื่องตลอดเวลาจากเว็บไซต์ Near Me Messaging การเปลี่ยนแปลงที่คุณทำบนเว็บไซต์ Near Me Messaging จะมีผลทันทีสำหรับลูกค้าที่โต้ตอบกับตัวแทนของคุณ

นอกจากนั้น เมื่อคุณเปิดใช้งานปุ่มแชทบน Google Business Profile คุณจะสามารถตอบกลับลูกค้าได้ทุกเมื่อที่คุณว่าง แต่เมื่อคุณรวม Google Business Messages ข้อความขาเข้าของคุณจะถูกส่งไปยังตัวแทนสดของคุณ และคุณจะสูญเสียความสามารถในการแชทโดยตรงกับลูกค้าภายใน Google Business Profile Near Me Messaging แก้ไขข้อจำกัดนี้โดยการจัดหาคุณสมบัติตัวแทนสดโดยไม่มีค่าใช้จ่ายเพิ่มเติมหรือเวลาในการตั้งค่า ด้วยคุณสมบัติตัวแทนสด ลูกค้าสามารถขอโอนสายไปยังบุคคลจริงได้ตลอดเวลา เมื่อคุณเห็นคำขอตัวแทนสด หรือหากคุณต้องการเข้าควบคุมตัวแทนเสมือน คุณสามารถเข้าร่วมการสนทนาและพูดคุยกับลูกค้าของคุณได้โดยตรง

## ประโยชน์ของ Near Me Messaging

### 1. ประหยัดเวลาและกำลังคนในการให้บริการลูกค้าที่เป็นเลิศ

เมื่อคุณใช้ Near Me Messaging การตอบคำถามพื้นฐานที่สุดจะถูกจัดการโดยอัตโนมัติโดยอิงจากข้อมูลใน Google Business Profile ของคุณ ยิ่งมีข้อมูลใน Google Business Profile ของคุณมากเท่าไร ตัวแทนก็จะสามารถตอบคำถามพื้นฐานได้ดีขึ้นเท่านั้น และหากคุณต้องการอัปเดต Google Business Profile ของคุณ คุณสามารถซิงค์การเปลี่ยนแปลงของคุณกับ Near Me เพื่ออัปเดตการตอบกลับของบอทโดยอัตโนมัติ ตัวแทนเสมือนจะสร้างการตอบกลับจากรีวิวของผู้ใช้ที่เกี่ยวข้องบนโปรไฟล์ Google Maps ของคุณที่มีคะแนนดาวสูง นอกเหนือจากการตอบกลับที่สร้างขึ้นโดยอัตโนมัติ คุณสามารถเพิ่มเนื้อหาที่กำหนดเองได้มากขึ้นผ่านคำถามที่พบบ่อยและฐานความรู้ ซึ่งเราจะกล่าวถึงรายละเอียดเพิ่มเติมในส่วนถัดไป

ภายใน 5 นาทีหลังจากเข้าสู่ระบบเว็บไซต์ Near Me คุณสามารถทดสอบตัวแทนเสมือนที่ทำงานอยู่ของคุณได้ ตัวแทนเสมือนของคุณสามารถให้คำตอบได้ทันทีสำหรับคำถามที่ซ้ำซากของลูกค้าตลอด 24 ชั่วโมงทุกวัน ด้วยวิธีนี้ คุณสามารถสร้างและรักษาความสัมพันธ์กับลูกค้าของคุณได้

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging มีคุณสมบัติ FAQ ที่กำหนดเองเพื่อปรับแต่งตัวแทนเสมือน"/>

*Near Me Messaging มีคุณสมบัติ FAQ ที่กำหนดเองเพื่อปรับแต่งตัวแทนเสมือน*
</center>

### 2. ความสามารถในการบริการตนเองและปรับแต่งได้

นอกจากการสร้างการตอบกลับจากโปรไฟล์ธุรกิจและรีวิวของลูกค้าแล้ว Near Me Messaging ยังมาพร้อมกับความสามารถในการปรับแต่งด้วยตนเอง เพื่อปรับแต่งตัวแทนเสมือนของคุณ คุณสมบัติพื้นฐานบางอย่างที่คุณสามารถปรับแต่งได้คือชื่อตัวแทนเสมือน ข้อความต้อนรับ และโลโก้ ที่สำคัญกว่านั้น คุณสามารถสร้างการตอบกลับที่กำหนดเองสำหรับคำถามของผู้ใช้ที่เฉพาะเจาะจงสำหรับธุรกิจของคุณ ซึ่งทำได้โดยการสร้างคำถามที่พบบ่อย (FAQ) และเพิ่มข้อมูลเพิ่มเติมเกี่ยวกับธุรกิจของคุณ (เช่น ข้อความจากเว็บไซต์ของคุณ) ลงในฐานความรู้

หลังจากปรับแต่งตัวแทนของคุณแล้ว คุณสามารถทดสอบแบบส่วนตัวได้จนกว่าคุณจะพอใจกับประสิทธิภาพ เมื่อคุณพร้อม คุณสามารถเปิดตัวสู่สาธารณะได้โดยตรงจากเว็บไซต์ Near Me Messaging เมื่อคุณเปิดตัวตัวแทนเสมือนของคุณสู่สาธารณะ คุณจะสามารถปรับปรุงตัวแทนเสมือนของคุณได้อย่างต่อเนื่อง เช่น การเพิ่มคำถามที่พบบ่อยมากขึ้นและการเปลี่ยนข้อความต้อนรับ ทุกครั้งที่คุณปรับปรุงตัวแทนเสมือนของคุณ คุณจะมีโอกาสทดสอบการเปลี่ยนแปลงแล้วเปิดตัวตัวแทนอีกครั้ง เมื่อคุณเปิดตัวตัวแทนอีกครั้ง การเปลี่ยนแปลงที่คุณทำจะปรากฏให้ผู้ใช้เห็นทันที ในฐานะเจ้าของธุรกิจ คุณมีอิสระและอำนาจในการสร้างและปรับปรุงตัวแทนเสมือนของคุณโดยไม่มีค่าใช้จ่ายเพิ่มเติมหรือเวลาในการสื่อสารกับทีมของเรา

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="อินเทอร์เฟซของหน้าภาพรวม Near Me Messaging ที่เจ้าของธุรกิจสามารถแก้ไขข้อความต้อนรับและปรับปรุงตัวแทนเสมือนของตนได้"/>

*อินเทอร์เฟซของหน้าภาพรวม Near Me Messaging ที่เจ้าของธุรกิจสามารถแก้ไขข้อความต้อนรับและปรับปรุงตัวแทนเสมือนของตนได้*
</center>

### 3. รับข้อมูลเชิงลึกผ่าน Near Me Analytics

Near Me Messaging ยังมีคุณสมบัติการวิเคราะห์เพื่อช่วยให้คุณได้รับข้อมูลเชิงลึกเกี่ยวกับประสิทธิภาพของตัวแทนเสมือน ชั่วโมงที่ยุ่งที่สุด และข้อความของลูกค้า คุณยังสามารถรับข้อมูลเชิงลึกเกี่ยวกับคำถามที่ตัวแทนเสมือนของคุณไม่สามารถหาคำตอบได้ เพื่อให้คุณสามารถเพิ่มลงใน FAQ ที่กำหนดเองได้ สุดท้าย คุณยังสามารถเรียนรู้เพิ่มเติมเกี่ยวกับหัวข้อที่กล่าวถึงบ่อยที่สุดใน Google Reviews

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics ให้ข้อมูลเชิงลึกเกี่ยวกับข้อความของลูกค้าของคุณ"/>

*Near Me Analytics ให้ข้อมูลเชิงลึกเกี่ยวกับข้อความของลูกค้าของคุณ*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics ช่วยให้คุณเห็นชั่วโมงที่ยุ่งที่สุดของตัวแทนเสมือนและคำถามที่ยังไม่ได้รับคำตอบ"/>

*Near Me Analytics ช่วยให้คุณเห็นชั่วโมงที่ยุ่งที่สุดของตัวแทนเสมือนและคำถามที่ยังไม่ได้รับคำตอบ*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics ช่วยให้คุณค้นหาหัวข้อที่กล่าวถึงบ่อยที่สุดใน Google Reviews"/>

*Near Me Analytics ช่วยให้คุณค้นหาหัวข้อที่กล่าวถึงบ่อยที่สุดใน Google Reviews*
</center>

### 4. ทำความเข้าใจสิ่งที่ลูกค้าของคุณต้องการผ่านประวัติการสนทนา

Near Me Messaging ช่วยให้คุณสามารถดูการสนทนาระหว่างตัวแทนเสมือนของคุณกับลูกค้าของคุณได้ ซึ่งจะช่วยให้คุณทราบว่าใครสนใจธุรกิจของคุณและตัวแทนเสมือนของคุณทำงานอย่างไร นอกจากนั้น คุณยังสามารถสร้างป้ายกำกับ นำไปใช้กับการสนทนา แล้วกรองตามป้ายกำกับได้อีกด้วย

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*คุณสมบัติประวัติการสนทนาของ Near Me Messaging*
</center>

### 5. ความสามารถในการแชทโดยตรงกับลูกค้าของคุณด้วยคุณสมบัติตัวแทนสดของเรา

Near Me Messaging ยังมาพร้อมกับคุณสมบัติตัวแทนสด ลูกค้าสามารถคลิก “ขอตัวแทนสด” ผ่าน GBM เมื่อลูกค้าขอตัวแทนสด เจ้าของจะได้รับการแจ้งเตือนจากเว็บไซต์ Near Me

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="ลูกค้าสามารถขอตัวแทนสดผ่านปุ่มแชทบนโปรไฟล์ Google Maps ได้"/>

*ลูกค้าสามารถขอตัวแทนสดผ่านปุ่มแชทบนโปรไฟล์ Google Maps ได้*
</center>

เจ้าของสามารถเข้าร่วมการสนทนาใดๆ ได้ตลอดเวลา ตราบใดที่ผู้ใช้ได้ส่งข้อความภายใน 30 วันที่ผ่านมา ลูกค้าจะได้รับการแจ้งเตือนเมื่อตัวแทนสดเข้าร่วม/ออกจากบทสนทนา ทันทีที่ตัวแทนสดออกจากบทสนทนา ข้อความทั้งหมดจะถูกส่งกลับไปยังตัวแทนเสมือนอีกครั้ง จากเว็บไซต์ Near Me สามารถดูเหตุการณ์การสนทนาทั้งหมดได้ ดังนั้นคุณสามารถดูได้ว่าเมื่อใดที่ผู้ใช้ขอตัวแทน และเมื่อใดที่ตัวแทนเข้าร่วม/ออกจากบทสนทนา นอกเหนือจากข้อความทั้งหมดจากบอท ผู้ใช้ และตัวแทน


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="การแจ้งเตือนจะปรากฏขึ้นบนเว็บไซต์ Near Me เมื่อลูกค้าขอตัวแทนสด"/>

*การแจ้งเตือนจะปรากฏขึ้นบนเว็บไซต์ Near Me เมื่อลูกค้าขอตัวแทนสด*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="อินเทอร์เฟซของคุณสมบัติตัวแทนสดของ Near Me"/>

*อินเทอร์เฟซของคุณสมบัติตัวแทนสดของ Near Me*
</center>

คุณพร้อมที่จะเริ่มต้นใช้งาน Near Me Messaging แล้วหรือยัง? โปรดติดตามโพสต์ถัดไปของเราเกี่ยวกับวิธีเปิดตัวตัวแทนเสมือนของคุณด้วย Near Me Messaging [จองการสาธิตกับเรา](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) วันนี้ และเป็นคนแรกๆ ที่จะได้รับทดลองใช้ Near Me Messaging ฟรี!
`;export{e as default};
