const e=`---
title: "Near Me Messaging Google Business Messages ஐ நிறைவு செய்கிறது"
metatitle: "Near Me Messaging Google Business Messages ஐ நிறைவு செய்கிறத..."
date: 2022-04-12 21:12:16-07:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Ruli Setiawati
description: "Near Me Messaging ஆனது உரையாடல் AI ஐ Google Business Messages உடன் ஒருங்கிணைக்கிறது, இது உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தான் வழியாக 24/7 ஆதரவை அனுமதிக்கிறது."
weight: 1
tags:
  - NearMe
image: images/blog/12-near-me-messaging-complements-google-business-messages/logo.png
canonicalURL: /blog/near-me-messaging-complements-google-business-messages/
url: /blog/near-me-messaging-complements-google-business-messages/
---


எங்கள் முந்தைய வலைப்பதிவுகளில் ஒன்றில், [Google Business Messages இன் நன்மைகள் மற்றும் வரம்புகள்](https://seasalt.ai/blog/10-use-google-business-messages-off-hours/) பற்றி நாங்கள் உங்களுக்கு விளக்கினோம். Google Business Messages இன் பொதுவான செயலாக்கங்களில் இரண்டு முக்கிய வரம்புகள் உள்ளன. முதல் வரம்பு என்னவென்றால், உங்கள் வணிகத்திற்கான தனிப்பயனாக்கப்பட்ட மெய்நிகர் முகவரை புதிதாக உருவாக்க ஒரு தொழில்முறை ஆலோசனை நிறுவனத்திற்கு பணம் செலுத்த நிறைய பணமும் நேரமும் ஆகும். இரண்டாவது வரம்பு என்னவென்றால், ஆலோசனை நிறுவனம் தங்கள் செயலாக்கத்தின் ஒரு பகுதியாக நேரடி அரட்டை அம்சத்தை வழங்காத வரை வணிக உரிமையாளர்கள் வாடிக்கையாளர்களுடன் நேரடியாக பேச முடியாது.

இப்போது நீங்கள் ஆச்சரியப்படலாம், இந்த தடைகளை கடக்க ஒரு தீர்வு இருக்கிறதா, ஆனால் Google Business Messages இன் நன்மைகளைப் பெற முடியுமா? அதனால்தான் நாங்கள் Near Me Messaging ஐ அறிமுகப்படுத்த விரும்புகிறோம் (புதுப்பிப்பு: நாங்கள் இப்போது தயாரிப்பை ஒரு ஓம்னி-சேனல் சாட்போட் பில்டராக மாற்றியுள்ளோம். இப்போது [SeaChat](https://chat.seasalt.ai/?utm_source=blog) என்று அழைக்கப்படுகிறது!).

## Near Me Messaging பற்றி

Near Me Messaging ஆனது அதிநவீன உரையாடல் AI ஐ Google Business Messages உடன் ஒருங்கிணைக்கிறது, இது உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தான் வழியாக வாடிக்கையாளர்கள் உங்கள் வணிகத்தை எந்த நேரத்திலும் அணுக அனுமதிக்கிறது. இதன் மூலம், Near Me Messaging உங்கள் வாடிக்கையாளர் விசாரணைகளைக் கையாளும் போது உங்கள் வணிகத்தை கவனிப்பதில் நீங்கள் கவனம் செலுத்தலாம். Near Me Messaging ஐ ஒத்த சேவைகளிலிருந்து வேறுபடுத்துவது 5 நிமிட அமைவு நேரம், சுய சேவை தனிப்பயனாக்கம் மற்றும் உள்ளமைக்கப்பட்ட நேரடி அரட்டை ஆதரவு ஆகும்.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging ஆனது Google Business Messages ஐ உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தானுடன் ஒருங்கிணைக்கிறது."/>

*Near Me Messaging ஆனது Google Business Messages ஐ உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தானுடன் ஒருங்கிணைக்கிறது.*
</center>

முதலாவதாக, வணிகங்கள் Google Business Messages ஐ ஒருங்கிணைக்கும்போது, ​​அவர்களுக்கு புதிதாக ஒரு முழுமையான தனிப்பயனாக்கப்பட்ட அனுபவத்தை உருவாக்க ஒரு தொழில்முறை ஆலோசனை நிறுவனத்திற்கு பணம் செலுத்த வேண்டும். இவை பொதுவாக விலை உயர்ந்தவை மற்றும் நேரம் எடுக்கும். Google Business Messages இன் நன்மைகளைப் பெற வழக்கமான நேரம் மற்றும் வள முதலீடு பல சிறு வணிகங்களுக்கு ஒரு நுழைவுத் தடையாக இருப்பதை நாங்கள் புரிந்துகொள்கிறோம். Near Me Messaging ஆனது SME களுக்கு மலிவு விலையில் தீர்வை வழங்குவதன் மூலம் இந்த வரம்பை தீர்க்கிறது. 5 நிமிடங்களுக்குள் ஒரு செயல்படும் மெய்நிகர் முகவரைப் பெறலாம். மேலும், Near Me Messaging வலைத்தளத்திலிருந்து எந்த நேரத்திலும் உங்கள் மெய்நிகர் முகவரை தொடர்ந்து புதுப்பிக்கலாம் மற்றும் தனிப்பயனாக்கலாம். Near Me Messaging தளத்தில் நீங்கள் செய்யும் மாற்றங்கள் உங்கள் முகவருடன் தொடர்பு கொள்ளும் வாடிக்கையாளர்களுக்கு உடனடியாக நடைமுறைக்கு வரும்.

கூடுதலாக, Google Business Profile இல் அரட்டை பொத்தானை நீங்கள் இயக்கும்போது, ​​நீங்கள் கிடைக்கும்போது உங்கள் வாடிக்கையாளர்களுக்கு பதிலளிக்கும் திறன் உங்களுக்கு உள்ளது. ஆனால் நீங்கள் Google Business Messages ஐ ஒருங்கிணைக்கும்போது, ​​உங்கள் உள்வரும் செய்திகள் உங்கள் நேரடி முகவருக்கு அனுப்பப்படும், மேலும் Google Business Profile இல் வாடிக்கையாளர்களுடன் நேரடியாக அரட்டை அடிக்கும் திறனை நீங்கள் இழக்கிறீர்கள். Near Me Messaging ஆனது கூடுதல் செலவு அல்லது அமைவு நேரம் இல்லாமல் நேரடி முகவர் அம்சத்தை வழங்குவதன் மூலம் இந்த வரம்பை தீர்க்கிறது. நேரடி முகவர் அம்சத்துடன், வாடிக்கையாளர்கள் எந்த நேரத்திலும் ஒரு உண்மையான நபருக்கு மாற்றப்பட வேண்டும் என்று கோரலாம். நீங்கள் ஒரு நேரடி முகவர் கோரிக்கையைப் பார்க்கும்போது, ​​அல்லது மெய்நிகர் முகவருக்காக நீங்கள் பொறுப்பேற்க விரும்பினால், நீங்கள் உரையாடலில் சேர்ந்து உங்கள் வாடிக்கையாளர்களுடன் நேரடியாக பேசலாம்.

## Near Me Messaging இன் நன்மைகள்

### 1. சிறந்த வாடிக்கையாளர் சேவையை வழங்குவதில் நேரத்தையும் மனிதவளத்தையும் சேமிக்கிறது

நீங்கள் Near Me Messaging ஐப் பயன்படுத்தும்போது, ​​உங்கள் Google Business Profile இலிருந்து கிடைக்கும் தகவல்களின் அடிப்படையில் மிக அடிப்படையான கேள்விகளுக்கான பதில்கள் தானாகவே கையாளப்படும். உங்கள் Google Business Profile இல் அதிக தகவல்கள் இருந்தால், அடிப்படை கேள்விகளுக்கு முகவர் சிறப்பாக பதிலளிக்க முடியும். மேலும் உங்கள் Google Business Profile ஐப் புதுப்பிக்க விரும்பினால், போட் பதில்களை தானாகவே புதுப்பிக்க உங்கள் மாற்றங்களை Near Me உடன் ஒத்திசைக்கலாம். மெய்நிகர் முகவர் உங்கள் Google Maps சுயவிவரத்தில் அதிக நட்சத்திர மதிப்பீட்டைக் கொண்ட தொடர்புடைய பயனர் மதிப்புரைகளிலிருந்து பதில்களை உருவாக்கும். தானாக உருவாக்கப்பட்ட பதில்களுக்கு அப்பால், நீங்கள் அடிக்கடி கேட்கப்படும் கேள்விகள் மற்றும் அறிவுத் தளத்தின் மூலம் மேலும் தனிப்பயன் உள்ளடக்கத்தைச் சேர்க்கலாம், இது பற்றி அடுத்த பிரிவில் விரிவாக விவாதிப்போம்.

Near Me வலைத்தளத்தில் உள்நுழைந்த 5 நிமிடங்களுக்குள், உங்கள் சொந்த செயல்படும் மெய்நிகர் முகவரை நீங்கள் சோதிக்கலாம். உங்கள் மெய்நிகர் முகவர் வாடிக்கையாளர்களின் மீண்டும் மீண்டும் வரும் விசாரணைகளுக்கு 24/7 உடனடி பதில்களை வழங்க முடியும். இதன் மூலம், உங்கள் வாடிக்கையாளர்களுடனான உறவுகளை நீங்கள் உருவாக்கலாம் மற்றும் பராமரிக்கலாம்.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging ஆனது மெய்நிகர் முகவரை தனிப்பயனாக்க ஒரு தனிப்பயன் FAQ அம்சத்தை வழங்குகிறது"/>

*Near Me Messaging ஆனது மெய்நிகர் முகவரை தனிப்பயனாக்க ஒரு தனிப்பயன் FAQ அம்சத்தை வழங்குகிறது.*
</center>

### 2. சுய சேவை மற்றும் தனிப்பயனாக்கக்கூடிய திறன்கள்.

உங்கள் வணிக சுயவிவரம் மற்றும் வாடிக்கையாளர் மதிப்புரைகளிலிருந்து பதில்களை உருவாக்குவதோடு, Near Me Messaging ஆனது சுய சேவை தனிப்பயனாக்குதல் திறன்களுடன் பொருத்தப்பட்டுள்ளது. உங்கள் மெய்நிகர் முகவரை தனிப்பயனாக்க, நீங்கள் தனிப்பயனாக்கக்கூடிய சில அடிப்படை அம்சங்கள் மெய்நிகர் முகவர் பெயர், வரவேற்பு செய்தி மற்றும் லோகோ ஆகும். மிக முக்கியமாக, உங்கள் வணிகத்திற்கு குறிப்பிட்ட பயனர் வினவல்களுக்கு தனிப்பயன் பதில்களை நீங்கள் உருவாக்கலாம். இது அடிக்கடி கேட்கப்படும் கேள்விகள் (FAQs) உருவாக்குவதன் மூலமும், உங்கள் வணிகத்தைப் பற்றிய கூடுதல் தகவல்களை (உங்கள் வலைத்தளத்திலிருந்து உரை போன்றவை) அறிவுத் தளத்தில் சேர்ப்பதன் மூலமும் செய்யப்படுகிறது.

உங்கள் முகவரைத் தனிப்பயனாக்கிய பிறகு, செயல்திறனில் நீங்கள் திருப்தி அடையும் வரை அதைத் தனிப்பட்ட முறையில் சோதிக்கும் திறன் உங்களுக்கு உள்ளது. நீங்கள் தயாராக இருக்கும்போது, ​​Near Me Messaging வலைத்தளத்திலிருந்து நேரடியாக அதை பொதுமக்களுக்கு வெளியிடலாம். உங்கள் மெய்நிகர் முகவரை நீங்கள் பொதுவில் வெளியிட்டவுடன், மேலும் அடிக்கடி கேட்கப்படும் கேள்விகளைச் சேர்ப்பது மற்றும் வரவேற்பு செய்தியை மாற்றுவது போன்ற உங்கள் மெய்நிகர் முகவரை தொடர்ந்து மேம்படுத்தும் திறன் உங்களுக்கு உள்ளது. ஒவ்வொரு முறையும் உங்கள் மெய்நிகர் முகவரை மேம்படுத்தும்போது, ​​மாற்றங்களைச் சோதித்து பின்னர் முகவரை மீண்டும் தொடங்குவதற்கான வாய்ப்பு உங்களுக்கு உள்ளது. நீங்கள் முகவரை மீண்டும் தொடங்கும்போது, ​​நீங்கள் செய்த மாற்றங்கள் பயனர்களுக்கு உடனடியாகத் தெரியும். வணிக உரிமையாளர்களாக, எங்கள் குழுவுடன் கூடுதல் செலவு அல்லது தொடர்பு நேரம் இல்லாமல் உங்கள் மெய்நிகர் முகவரை உருவாக்க மற்றும் மேம்படுத்த உங்களுக்கு சுதந்திரமும் அதிகாரமும் உள்ளது.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="Near Me Messaging கண்ணோட்டப் பக்கத்தின் இடைமுகம், அங்கு வணிக உரிமையாளர்கள் வரவேற்பு செய்தியை மாற்றியமைத்து தங்கள் மெய்நிகர் முகவரை மேம்படுத்தலாம்"/>

*Near Me Messaging கண்ணோட்டப் பக்கத்தின் இடைமுகம், அங்கு வணிக உரிமையாளர்கள் வரவேற்பு செய்தியை மாற்றியமைத்து தங்கள் மெய்நிகர் முகவரை மேம்படுத்தலாம்.*
</center>

### 3. Near Me Analytics மூலம் நுண்ணறிவுகளைப் பெறுங்கள்.

Near Me Messaging ஆனது உங்கள் மெய்நிகர் முகவர் செயல்திறன், பரபரப்பான நேரங்கள் மற்றும் வாடிக்கையாளர் செய்திகள் பற்றிய நுண்ணறிவுகளைப் பெற உதவும் ஒரு பகுப்பாய்வு அம்சத்தையும் வழங்குகிறது. உங்கள் மெய்நிகர் முகவர் பதிலைக் கண்டுபிடிக்க முடியாத கேள்விகள் பற்றிய நுண்ணறிவுகளையும் நீங்கள் பெறலாம், இதனால் அவற்றை தனிப்பயன் FAQ இல் சேர்க்கலாம். இறுதியாக, Google மதிப்புரைகளில் அதிகம் குறிப்பிடப்பட்ட தலைப்புகள் பற்றியும் நீங்கள் மேலும் அறியலாம்.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics உங்கள் வாடிக்கையாளர் செய்திகள் பற்றிய நுண்ணறிவுகளை வழங்குகிறது."/>

*Near Me Analytics உங்கள் வாடிக்கையாளர் செய்திகள் பற்றிய நுண்ணறிவுகளை வழங்குகிறது.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics உங்கள் மெய்நிகர் முகவரின் பரபரப்பான நேரங்களையும் பதிலளிக்கப்படாத கேள்விகளையும் பார்க்க உங்களை அனுமதிக்கிறது"/>

*Near Me Analytics உங்கள் மெய்நிகர் முகவரின் பரபரப்பான நேரங்களையும் பதிலளிக்கப்படாத கேள்விகளையும் பார்க்க உங்களை அனுமதிக்கிறது.*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics Google மதிப்புரைகளில் அதிகம் குறிப்பிடப்பட்ட தலைப்புகளைக் கண்டறிய உங்களை அனுமதிக்கிறது."/>

*Near Me Analytics Google மதிப்புரைகளில் அதிகம் குறிப்பிடப்பட்ட தலைப்புகளைக் கண்டறிய உங்களை அனுமதிக்கிறது.*
</center>

### 4. உரையாடல் வரலாறு மூலம் உங்கள் வாடிக்கையாளரின் தேவைகளைப் புரிந்து கொள்ளுங்கள்.

Near Me Messaging ஆனது உங்கள் மெய்நிகர் முகவருக்கும் உங்கள் வாடிக்கையாளர்களுக்கும் இடையிலான உரையாடல்களைப் பார்க்க உங்களை அனுமதிக்கிறது. உங்கள் வணிகத்தில் யார் ஆர்வமாக உள்ளனர் மற்றும் உங்கள் மெய்நிகர் முகவர் எவ்வாறு செயல்படுகிறார் என்பதை அறிய இது உதவும். கூடுதலாக, நீங்கள் லேபிள்களை உருவாக்கவும், அவற்றை உரையாடல்களில் பயன்படுத்தவும், பின்னர் லேபிளின் அடிப்படையில் வடிகட்டவும் உங்களுக்கு திறன் உள்ளது.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*Near Me Messaging உரையாடல் வரலாற்று அம்சம்.*
</center>

### 5. எங்கள் நேரடி முகவர் அம்சத்துடன் உங்கள் வாடிக்கையாளர்களுடன் நேரடியாக அரட்டை அடிக்கும் திறன்

Near Me Messaging ஆனது நேரடி முகவர் அம்சத்துடன் பொருத்தப்பட்டுள்ளது. வாடிக்கையாளர்கள் GBM வழியாக "நேரடி முகவரைக் கோரு" என்பதைக் கிளிக் செய்யலாம். ஒரு வாடிக்கையாளர் நேரடி முகவரைக் கோரும்போது, ​​உரிமையாளர் Near Me வலைத்தளத்திலிருந்து ஒரு அறிவிப்பைப் பெறுவார்.

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="வாடிக்கையாளர்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தான் வழியாக நேரடி முகவரைக் கோரலாம்."/>

*வாடிக்கையாளர்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தான் வழியாக நேரடி முகவரைக் கோரலாம்.*
</center>

பயனர் கடந்த 30 நாட்களுக்குள் ஒரு செய்தியை அனுப்பியிருந்தால், உரிமையாளர் எந்த நேரத்திலும் எந்த உரையாடலிலும் சேரலாம். நேரடி முகவர் உரையாடலில் சேரும்போது/வெளியேறும்போது வாடிக்கையாளர் ஒரு அறிவிப்பைப் பெறுவார். நேரடி முகவர் உரையாடலை விட்டு வெளியேறியவுடன், அனைத்து செய்திகளும் மீண்டும் மெய்நிகர் முகவருக்கு அனுப்பப்படும். Near Me தளத்திலிருந்து, அனைத்து உரையாடல் நிகழ்வுகளையும் காணலாம் - எனவே பயனர் எப்போது ஒரு முகவரைக் கோருகிறார் மற்றும் முகவர் எப்போது சேருகிறார்/வெளியேறுகிறார் என்பதை நீங்கள் பார்க்கலாம், கூடுதலாக போட், பயனர் மற்றும் முகவர் ஆகியோரிடமிருந்து வரும் அனைத்து செய்திகளையும் பார்க்கலாம்.


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="ஒரு வாடிக்கையாளர் நேரடி முகவரைக் கோரும்போது Near Me வலைத்தளத்தில் ஒரு அறிவிப்பு தோன்றும்."/>

*ஒரு வாடிக்கையாளர் நேரடி முகவரைக் கோரும்போது Near Me வலைத்தளத்தில் ஒரு அறிவிப்பு தோன்றும்.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="Near Me நேரடி முகவர் அம்சத்தின் இடைமுகம்."/>

*Near Me நேரடி முகவர் அம்சத்தின் இடைமுகம்.*
</center>

Near Me Messaging உடன் தொடங்க நீங்கள் தயாரா? Near Me Messaging உடன் உங்கள் மெய்நிகர் முகவரை எவ்வாறு தொடங்குவது என்பது பற்றிய எங்கள் அடுத்த இடுகைக்கு காத்திருங்கள். [இன்றே எங்களுடன் ஒரு டெமோவை முன்பதிவு செய்யுங்கள்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) மற்றும் Near Me Messaging இன் இலவச சோதனையைப் பெறும் முதல் நபர்களில் ஒருவராக இருங்கள்!
`;export{e as default};
