const n=`---
title: "راه اندازی عامل مجازی خود در Google Maps با پیام رسانی نزدیک من"
metatitle: "راه اندازی عامل مجازی Google Maps خود با پیام رسانی نزدیک من"
date: 2022-04-19 15:27:21-07:00
modified_date: 2025-07-29 17:35:15+00:00
draft: false
author: Ruli Setiawati
description: "عامل مجازی خود را در Google Business Messages با پیام رسانی نزدیک من راه اندازی کنید."
weight: 1
tags:
  - NearMe
image: images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/thumbnail.png
canonicalURL: /blog/virtual-agent-on-Google-Maps-with-near-me-messaging/
url: /blog/virtual-agent-on-Google-Maps-with-near-me-messaging/
---

ما قبلاً شما را با [پیام رسانی نزدیک من](https://seasalt.ai/blog/12-near-me-messaging-google-business-messages/) و مزایای آن آشنا کرده ایم. پیام رسانی نزدیک من یک عامل مجازی Google Business Messages را پیاده سازی می کند که مستقیماً از دکمه چت در نمایه Google Maps یک کسب و کار در دسترس است. عامل مجازی پیام رسانی نزدیک من توسط درک زبان طبیعی پیشرفته ای که پاسخ های شبیه انسان را ارائه می دهد، پشتیبانی می شود. آنچه پیام رسانی نزدیک من را از خدمات مشابه متمایز می کند، زمان راه اندازی 5 دقیقه ای، سفارشی سازی خودکار و پشتیبانی چت زنده داخلی است.

مزایای پیام رسانی نزدیک من عبارتند از:
- صرفه جویی در زمان و نیروی انسانی در ارائه خدمات عالی به مشتریان
- سفارشی سازی عامل خود از طریق پلتفرم خودکار
- کسب بینش مشتری از طریق Near Me Analytics
- درک نیازهای مشتری از طریق تاریخچه مکالمه
- چت مستقیم با مشتریان خود با ویژگی عامل زنده ما

ما در حال حاضر به دنبال آزمایش کنندگان بتا برای پیام رسانی نزدیک من هستیم. برای آزمایش کنندگان بتا، ما خدمات خود را به هزینه خود برای مدت زمان محدود و بدون نیاز به قرارداد ارائه می دهیم. این فرصت را از دست ندهید تا یک عامل مجازی را امتحان کنید و ببینید آیا برای کسب و کار شما مناسب است یا خیر. برای شروع، این راهنمای گام به گام را در مورد نحوه راه اندازی عامل مجازی خود با پیام رسانی نزدیک من دنبال کنید!


## راهنمای گام به گام برای راه اندازی عامل مجازی خود با پیام رسانی نزدیک من

### مرحله 1. از وب سایت پیام رسانی نزدیک من بازدید کنید (به روز رسانی: ما از آن زمان محصول را به یک سازنده چت بات چند کاناله تغییر داده ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می شود!).

به وب سایت پیام رسانی نزدیک من (به روز رسانی: ما از آن زمان محصول را به یک سازنده چت بات چند کاناله تغییر داده ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می شود!) بروید و روی دکمه *«ورود»* کلیک کنید. پس از ورود با حسابی که برای Google Business Profile استفاده می کنید، مطمئن شوید که تمام کادرهای موجود را علامت زده اید و به Seasalt AI اجازه راه اندازی عامل مجازی خود را داده اید. Seasalt.ai یک [شریک رسمی Google](https://developers.google.com/business-communications/business-messages/partners) است، بنابراین می توانید مطمئن باشید که ما از این مجوزها مسئولانه استفاده خواهیم کرد. **ما از این مجوزها برای دو عملکرد استفاده می کنیم: اول، برای دسترسی به اطلاعات از Google Business Profile شما تا عامل مجازی شما بتواند پاسخ های دقیق ارائه دهد، و دوم برای اینکه بتوانیم عامل را به صفحه Google Maps کسب و کار شما از طرف شما راه اندازی کنیم.**

ما هرگز از این مجوزها برای ویرایش یا حذف نمایه کسب و کار شما استفاده نخواهیم کرد. ما هنوز از شما می خواهیم که به همه آنها اجازه دهید زیرا Google مجوزهای جداگانه ای برای *«مشاهده»*، *«ویرایش»* و *«حذف»* ارائه نمی دهد. ما فقط از مجوز *«مشاهده»* استفاده خواهیم کرد.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="با حسابی که برای Google Business Profile استفاده می کنید وارد شوید"/>

*روی «ورود با Google» کلیک کنید و با حساب Google Business Profile خود وارد شوید.*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*اعطای مجوز به Seasalt AI به ما این امکان را می دهد که عامل مجازی برند شما را به صورت عمومی در صفحه Google Maps شما از طرف شما راه اندازی کنیم.*
</center>


### مرحله 2. عامل مجازی خود را بسازید.

پس از ورود و اعطای مجوز، تمام کسب و کارهایی را که با حساب Google Business Profile خود مدیریت می کنید، مشاهده خواهید کرد. اگر کسب و کار خود را نمی بینید، مطمئن شوید که از حساب Google Business Profile صحیح برای ورود استفاده می کنید. همچنین می توانید روی دکمه *«همگام سازی»* کلیک کنید تا کسب و کارهای خود را همگام سازی کنید. توجه داشته باشید که باید عامل مجازی را به صورت جداگانه برای هر یک از مکان های کسب و کار خود تنظیم کنید. برای تنظیم عامل مجازی خود، روی دکمه *«افزودن عامل»* در یکی از کسب و کارهای خود کلیک کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*کسب و کارهای مرتبط با نمایه Google Business ما.*
</center>

پیام رسانی نزدیک من با همگام سازی اطلاعات از Google Business Profile شما، ساخت عامل مجازی شما را آغاز خواهد کرد. ساخت عامل مجازی شما باید کمتر از 5 دقیقه طول بکشد و می توانید پیشرفت را در هر مرحله مشاهده کنید.


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*می توانید پیشرفت عامل مجازی خود را مشاهده کنید.*
</center>

### مرحله 3. عامل مجازی خود را به صورت خصوصی آزمایش کنید.

هنگامی که ساخت عامل شما به پایان رسید، کدهای QR روی صفحه نمایش شما ظاهر می شوند. از تلفن همراه خود برای اسکن کد QR و آزمایش عامل مجازی خود استفاده کنید. این هنوز یک نسخه خصوصی از عامل مجازی شما است و هنوز در نمایه Google Maps شما ظاهر نخواهد شد. توجه داشته باشید که این عامل مجازی یک نسخه اولیه است که فقط از اطلاعات نمایه Google Business شما همراه با نظرات مشتریان از Google Maps برای تولید پاسخ استفاده می کند. اگر آن را آزمایش کردید و احساس می کنید که عامل مجازی شما نیاز به بهبود دارد، می توانید با ایجاد سوالات متداول سفارشی، افزودن اطلاعات از وب سایت خود و تنظیم نظرات Google خود، پاسخ ها را به شدت بهبود بخشید. برای راهنمای دقیق تر در مورد سفارشی سازی، به [راهنمای ما برای بهبود عامل مجازی خود](https://wiki.seasalt.ai/nearme/maintain_agent/improve_agent/) مراجعه کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*کدهای QR برای عامل مجازی خصوصی شما پس از اتمام ساخت عامل شما ظاهر می شوند.*
</center>

### مرحله 4. عامل مجازی خود را به صورت عمومی راه اندازی کنید.


پس از آزمایش عامل مجازی خود و رضایت از پاسخ ها، می توانید عامل مجازی خود را راه اندازی کنید. با راه اندازی عمومی عامل مجازی خود، عامل شما برای مشتریان شما در Google Maps در دسترس خواهد بود تا با آن چت کنند. در این وبلاگ، من شما را از طریق فرآیند اصلی راهنمایی خواهم کرد، اما می توانید برای اطلاعات دقیق تر به مستندات و ویدیوهای ما در مورد [نحوه راه اندازی عامل مجازی خود در نمایه Google Maps خود](https://wiki.seasalt.ai/nearme/setup/03-publish_agent/) مراجعه کنید.

ابتدا، به تب «عامل مجازی» بروید و مطمئن شوید که *نام عامل* و *تصویر آواتار عامل* شما دقیقاً همان چیزی است که می خواهید ظاهر شوند. هنگامی که *نام عامل* و *تصویر آواتار* توسط Google به عنوان بخشی از فرآیند راه اندازی تأیید شوند، **شما قادر به تغییر آنها از طریق سایت Near Me نخواهید بود**.

پس از تأیید جزئیات عامل خود، به تب *«راه اندازی عمومی»* بروید. روی دکمه *«تأیید»* کلیک کنید تا برند و مکان خود را با Google تأیید کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="برند و مکان خود را با Google تأیید کنید"/>

*با کلیک بر روی دکمه "تأیید"، برند و مکان شما با Google تأیید می شود.*
</center>

پس از تأیید برند و مکان شما، می توانید روی دکمه *«راه اندازی»* کلیک کنید تا عامل مجازی خود را به صورت عمومی راه اندازی کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="راه اندازی عامل مجازی خود در دکمه چت نمایه Google Maps خود"/>

*با کلیک بر روی دکمه “راه اندازی”، عامل مجازی شما در دکمه چت نمایه Google Maps شما راه اندازی می شود.*
</center>

ممکن است تا چهار ساعت طول بکشد تا دکمه چت در Google Maps ظاهر شود. پس از ظاهر شدن دکمه چت، عامل مجازی شما برای چت با مشتریان شما در دسترس است. پس از راه اندازی عمومی، شما همچنان می توانید به طور مداوم تغییراتی ایجاد کرده و عامل مجازی خود را بیشتر سفارشی کنید. هنگامی که تغییراتی ایجاد می کنید، می توانید به تب *«آزمایش خصوصی»* بروید تا آنها را قبل از عمومی کردن آزمایش کنید. هنگامی که از تغییرات راضی بودید، می توانید از صفحه *«راه اندازی عمومی»* روی *«راه اندازی مجدد»* کلیک کنید تا نسخه عمومی عامل مجازی خود را فوراً به روز کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="پیام رسانی نزدیک من، Google Business Messages را با دکمه چت در نمایه Google Maps شما ادغام می کند."/>

*پس از اتمام تغییرات/بهبودهای عامل مجازی خود، می توانید روی دکمه "راه اندازی مجدد" کلیک کنید.*
</center>

[یک دمو با ما رزرو کنید](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) و ما خوشحال خواهیم شد که به شما کمک کنیم!

به روز رسانی: ما از آن زمان محصول را به یک سازنده چت بات چند کاناله تغییر داده ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می شود!


`;export{n as default};
