const n=`---
title: "नियर मी मैसेजिंग के साथ Google मैप्स पर अपना वर्चुअल एजेंट लॉन्च करें"
metatitle: "नियर मी मैसेजिंग के साथ अपना Google मैप्स वर्चुअल एजेंट लॉन्च करें"
date: 2022-04-19 15:27:21-07:00
modified_date: 2025-07-29 17:35:15+00:00
draft: false
author: Ruli Setiawati
description: "नियर मी मैसेजिंग के साथ Google Business Messages पर अपना वर्चुअल एजेंट लॉन्च करें।"
weight: 1
tags:
  - NearMe
image: images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/thumbnail.png
canonicalURL: /blog/virtual-agent-on-Google-Maps-with-near-me-messaging/
url: /blog/virtual-agent-on-Google-Maps-with-near-me-messaging/
---

हमने पहले आपको [नियर मी मैसेजिंग](https://seasalt.ai/blog/12-near-me-messaging-google-business-messages/) और इसके लाभों से परिचित कराया है। नियर मी मैसेजिंग एक Google Business Messages वर्चुअल एजेंट को लागू करता है, जो किसी व्यवसाय के Google मैप्स प्रोफ़ाइल पर चैट बटन से सीधे उपलब्ध होता है। नियर मी मैसेजिंग का वर्चुअल एजेंट अत्याधुनिक प्राकृतिक भाषा समझ द्वारा संचालित है जो मानव-जैसी प्रतिक्रियाएं प्रदान करता है। नियर मी मैसेजिंग को समान सेवाओं से अलग करने वाली बात 5 मिनट का सेटअप समय, स्व-सेवा अनुकूलन और अंतर्निहित लाइव चैट समर्थन है।

नियर मी मैसेजिंग के लाभों में शामिल हैं:
- उत्कृष्ट ग्राहक सेवा प्रदान करने में समय और जनशक्ति की बचत
- स्व-सेवा प्लेटफॉर्म के माध्यम से अपने एजेंट को अनुकूलित करना
- नियर मी एनालिटिक्स के माध्यम से ग्राहक अंतर्दृष्टि प्राप्त करना
- बातचीत के इतिहास के माध्यम से अपने ग्राहक की ज़रूरतों को समझना
- हमारी लाइव एजेंट सुविधा के साथ सीधे अपने ग्राहकों के साथ चैट करना

हम वर्तमान में नियर मी मैसेजिंग के लिए बीटा परीक्षकों की तलाश कर रहे हैं। हमारे बीटा परीक्षकों के लिए, हम सीमित समय के लिए अपने खर्च पर अपनी सेवा प्रदान कर रहे हैं, जिसमें किसी अनुबंध की आवश्यकता नहीं है। एक वर्चुअल एजेंट को आज़माने और यह देखने का यह अवसर न चूकें कि क्या यह आपके व्यवसाय के लिए उपयुक्त है। आरंभ करने के लिए, नियर मी मैसेजिंग के साथ अपना वर्चुअल एजेंट कैसे लॉन्च करें, इस चरण-दर-चरण मार्गदर्शिका का पालन करें!


## नियर मी मैसेजिंग के साथ अपना वर्चुअल एजेंट लॉन्च करने के लिए चरण-दर-चरण मार्गदर्शिका

### चरण 1. नियर मी मैसेजिंग वेबसाइट पर जाएँ (अपडेट: हमने तब से उत्पाद को एक ओमनी-चैनल चैटबॉट बिल्डर में बदल दिया है। अब इसे [सीचैट](https://chat.seasalt.ai/?utm_source=blog) कहा जाता है!)।

नियर मी मैसेजिंग वेबसाइट (अपडेट: हमने तब से उत्पाद को एक ओमनी-चैनल चैटबॉट बिल्डर में बदल दिया है। अब इसे [सीचैट](https://chat.seasalt.ai/?utm_source=blog) कहा जाता है!) पर जाएँ और *“साइन इन”* बटन पर क्लिक करें। एक बार जब आप Google Business Profile के लिए उपयोग किए जाने वाले खाते से साइन इन कर लेते हैं, तो सुनिश्चित करें कि आपने सभी उपलब्ध बॉक्सों को चेक किया है और सीसॉल्ट एआई को अपना वर्चुअल एजेंट लॉन्च करने की अनुमति दी है। सीसॉल्ट.एआई एक [आधिकारिक Google पार्टनर](https://developers.google.com/business-communications/business-messages/partners) है, इसलिए आप निश्चिंत हो सकते हैं कि हम इन अनुमतियों का जिम्मेदारी से उपयोग करेंगे। **हम इन अनुमतियों का उपयोग दो कार्यों के लिए कर रहे हैं: पहला, आपके Google Business Profile से जानकारी तक पहुंचने के लिए ताकि आपका वर्चुअल एजेंट सटीक प्रतिक्रियाएं प्रदान कर सके, और दूसरा ताकि हम आपकी ओर से आपके व्यवसाय के Google मैप्स पेज पर एजेंट को लॉन्च कर सकें।**

हम आपके व्यवसाय प्रोफ़ाइल को संपादित या हटाने के लिए इन अनुमतियों का कभी भी उपयोग नहीं करेंगे। हमें अभी भी आपको उन सभी को अनुमति देने की आवश्यकता है क्योंकि Google *“देखने”*, *“संपादित करने”* और *“हटाने”* के लिए अलग-अलग अनुमतियां प्रदान नहीं करता है। हम केवल *“देखने”* की अनुमति का उपयोग करेंगे।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="Google Business Profile के लिए उपयोग किए जाने वाले खाते से साइन इन करें"/>

*“Google के साथ साइन इन करें” पर क्लिक करें और अपने Google Business Profile खाते से साइन इन करें।*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*सीसॉल्ट एआई को अनुमति देने से हमें आपकी ओर से आपके ब्रांड के वर्चुअल एजेंट को आपके Google मैप्स पेज पर सार्वजनिक रूप से लॉन्च करने की क्षमता मिलती है।*
</center>


### चरण 2. अपना वर्चुअल एजेंट बनाएं।

एक बार जब आप साइन इन कर लेते हैं और अनुमति दे देते हैं, तो आपको वे सभी व्यवसाय दिखाई देंगे जिन्हें आप अपने Google Business Profile खाते से प्रबंधित करते हैं। यदि आपको अपना व्यवसाय दिखाई नहीं देता है, तो सुनिश्चित करें कि आप लॉग इन करने के लिए सही Google Business Profile खाते का उपयोग कर रहे हैं। आप अपने व्यवसायों को सिंक्रनाइज़ करने के लिए *“सिंक”* बटन पर भी क्लिक कर सकते हैं। ध्यान दें कि आपको अपने प्रत्येक व्यवसाय स्थान के लिए व्यक्तिगत रूप से वर्चुअल एजेंट सेट करना होगा। अपना वर्चुअल एजेंट सेट करने के लिए, अपने किसी एक व्यवसाय पर *“एजेंट जोड़ें”* बटन पर क्लिक करें।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*हमारे Google Business Profile से जुड़े व्यवसाय।*
</center>

नियर मी मैसेजिंग आपके Google Business Profile से जानकारी को सिंक्रनाइज़ करके आपके वर्चुअल एजेंट का निर्माण शुरू कर देगा। आपके वर्चुअल एजेंट को बनाने में 5 मिनट से भी कम समय लगना चाहिए, और आप प्रत्येक चरण के पूरा होने पर प्रगति देख सकते हैं।


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*आप अपने वर्चुअल एजेंट की प्रगति देख सकते हैं।*
</center>

### चरण 3. अपने वर्चुअल एजेंट का निजी परीक्षण करें।

जब आपका एजेंट बनाना समाप्त हो जाता है, तो आपकी स्क्रीन पर क्यूआर कोड दिखाई देंगे। क्यूआर कोड को स्कैन करने और अपने वर्चुअल एजेंट का परीक्षण करने के लिए अपने मोबाइल फोन का उपयोग करें। यह अभी भी आपके वर्चुअल एजेंट का एक निजी संस्करण है और अभी तक आपके Google मैप्स प्रोफ़ाइल पर दिखाई नहीं देगा। ध्यान दें कि यह वर्चुअल एजेंट एक प्रारंभिक संस्करण है जो प्रतिक्रियाएं उत्पन्न करने के लिए आपके Google Business Profile की जानकारी के साथ-साथ Google मैप्स से ग्राहक समीक्षाओं का उपयोग करता है। यदि आप इसका परीक्षण करते हैं और आपको लगता है कि आपके वर्चुअल एजेंट को कुछ सुधारों की आवश्यकता है, तो आप कस्टम एफएक्यू बनाकर, अपनी वेबसाइट से जानकारी जोड़कर और अपनी Google समीक्षाओं को क्यूरेट करके प्रतिक्रियाओं में काफी सुधार कर सकते हैं। अनुकूलन पर अधिक विस्तृत जानकारी के लिए, [अपने वर्चुअल एजेंट को बेहतर बनाने के लिए हमारी मार्गदर्शिका](https://wiki.seasalt.ai/nearme/maintain_agent/improve_agent/) देखें।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*आपके एजेंट के निर्माण समाप्त होने के बाद आपके निजी वर्चुअल एजेंट के लिए क्यूआर कोड दिखाई देंगे।*
</center>

### चरण 4. अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करें।


एक बार जब आप अपने वर्चुअल एजेंट का परीक्षण कर लेते हैं और प्रतिक्रियाओं से संतुष्ट हो जाते हैं, तो आप अपने वर्चुअल एजेंट को लॉन्च कर सकते हैं। अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करके, आपका एजेंट Google मैप्स पर आपके ग्राहकों के लिए चैट करने के लिए उपलब्ध होगा। इस ब्लॉग में, मैं आपको बुनियादी प्रक्रिया के माध्यम से मार्गदर्शन करूंगा, लेकिन आप अधिक विस्तृत जानकारी के लिए [अपने Google मैप्स प्रोफ़ाइल पर अपना वर्चुअल एजेंट कैसे लॉन्च करें](https://wiki.seasalt.ai/nearme/setup/03-publish_agent/) पर हमारे दस्तावेज़ और वीडियो देख सकते हैं।

सबसे पहले, “वर्चुअल एजेंट” टैब पर जाएं और सुनिश्चित करें कि आपका *एजेंट नाम* और *एजेंट अवतार छवि* बिल्कुल वैसे ही हैं जैसे आप उन्हें दिखाना चाहते हैं। एक बार जब *एजेंट नाम* और *अवतार छवि* को लॉन्च प्रक्रिया के हिस्से के रूप में Google द्वारा सत्यापित कर लिया जाता है, तो **आप उन्हें नियर मी साइट के माध्यम से संशोधित नहीं कर पाएंगे**।

एक बार जब आप अपने एजेंट के विवरण की पुष्टि कर लेते हैं, तो *“सार्वजनिक लॉन्च”* टैब पर नेविगेट करें। Google के साथ अपने ब्रांड और स्थान को सत्यापित करने के लिए *“सत्यापित करें”* बटन पर क्लिक करें।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="Google के साथ अपने ब्रांड और स्थान को सत्यापित करें"/>

*“सत्यापित करें” बटन पर क्लिक करने से Google के साथ आपका ब्रांड और स्थान सत्यापित हो जाएगा।*
</center>

एक बार जब आपका ब्रांड और स्थान सत्यापित हो जाता है, तो आप अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करने के लिए *“लॉन्च करें”* बटन पर क्लिक कर सकते हैं।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="अपने Google मैप्स प्रोफ़ाइल के चैट बटन पर अपना वर्चुअल एजेंट लॉन्च करना"/>

*“लॉन्च करें” बटन पर क्लिक करने से आपका वर्चुअल एजेंट आपके Google मैप्स प्रोफ़ाइल पर चैट बटन पर लॉन्च हो जाएगा।*
</center>

चैट बटन को Google मैप्स पर दिखाई देने में चार घंटे तक लग सकते हैं। एक बार चैट बटन दिखाई देने के बाद, आपका वर्चुअल एजेंट आपके ग्राहकों के लिए चैट करने के लिए उपलब्ध है। सार्वजनिक लॉन्च के बाद, आप अपने वर्चुअल एजेंट में लगातार बदलाव कर सकते हैं और उसे और अनुकूलित कर सकते हैं। जब आप बदलाव करते हैं, तो आप उन्हें सार्वजनिक करने से पहले उनका परीक्षण करने के लिए *“निजी परीक्षण”* टैब पर जा सकते हैं। एक बार जब आप बदलावों से खुश हो जाते हैं, तो आप अपने वर्चुअल एजेंट के सार्वजनिक संस्करण को तुरंत अपडेट करने के लिए *“सार्वजनिक लॉन्च”* पेज से *“पुनः लॉन्च करें”* पर क्लिक कर सकते हैं।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="नियर मी मैसेजिंग Google Business Messages को आपके Google मैप्स प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।"/>

*अपने वर्चुअल एजेंट में बदलाव/सुधार करने के बाद आप "पुनः लॉन्च करें" बटन पर क्लिक कर सकते हैं।*
</center>

[हमारे साथ एक डेमो बुक करें](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) और हमें आपकी मदद करने में खुशी होगी!

अपडेट: हमने तब से उत्पाद को एक ओमनी-चैनल चैटबॉट बिल्डर में बदल दिया है। अब इसे [सीचैट](https://chat.seasalt.ai/?utm_source=blog) कहा जाता है!


`;export{n as default};
