const e=`---
title: "Запустите своего виртуального агента на Google Картах с помощью сообщений Near Me"
metatitle: "Запустите своего виртуального агента Google Карт с помощью сообщений Near Me"
date: 2022-04-19 15:27:21-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "Запустите своего виртуального агента в Google Business Messages с помощью сообщений Near Me."
weight: 1
tags:
  - NearMe
image: images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/thumbnail.png
canonicalURL: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
url: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
---

Ранее мы уже знакомили вас с [Near Me Messaging](https://seasalt.ai/blog/12-near-me-messaging-google-business-messages/) и его преимуществами. Near Me Messaging реализует виртуального агента Google Business Messages, доступного прямо из кнопки чата в профиле компании на Google Картах. Виртуальный агент Near Me Messaging работает на основе передовой технологии понимания естественного языка, которая обеспечивает человекоподобные ответы. Что отличает Near Me Messaging от аналогичных сервисов, так это 5-минутное время настройки, самообслуживание и встроенная поддержка живого чата.

Преимущества Near Me Messaging включают:
- Экономия времени и рабочей силы при предоставлении отличного обслуживания клиентов
- Настройка вашего агента через платформу самообслуживания
- Получение информации о клиентах через Near Me Analytics
- Понимание потребностей ваших клиентов через историю разговоров
- Прямое общение с вашими клиентами с помощью нашей функции живого агента

В настоящее время мы ищем бета-тестеров для Near Me Messaging. Для наших бета-тестеров мы предлагаем наши услуги за наш счет в течение ограниченного времени, без необходимости заключения контракта. Не упустите эту возможность попробовать виртуального агента и посмотреть, подходит ли он для вашего бизнеса. Чтобы начать, следуйте этому пошаговому руководству по запуску вашего виртуального агента с помощью Near Me Messaging!


## Пошаговое руководство по запуску вашего виртуального агента с помощью сообщений Near Me

### Шаг 1. Посетите веб-сайт Near Me Messaging (Обновление: С тех пор мы переориентировали продукт на создание омниканальных чат-ботов. Теперь он называется [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!).

Перейдите на веб-сайт Near Me Messaging (Обновление: С тех пор мы переориентировали продукт на создание омниканальных чат-ботов. Теперь он называется [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!) и нажмите кнопку *«Войти»*. После входа в систему с учетной записью, которую вы используете для Google Business Profile, убедитесь, что вы отметили все доступные поля и предоставили Seasalt AI разрешение на запуск вашего виртуального агента. Seasalt.ai является [официальным партнером Google](https://developers.google.com/business-communications/business-messages/partners), поэтому вы можете быть уверены, что мы будем использовать эти разрешения ответственно. **Мы используем эти разрешения для двух функций: во-первых, для доступа к информации из вашего Google Business Profile, чтобы ваш виртуальный агент мог предоставлять точные ответы, и, во-вторых, чтобы мы могли запустить агента на странице Google Карт вашего бизнеса от вашего имени.**

Мы никогда не будем использовать эти разрешения для редактирования или удаления вашего бизнес-профиля. Нам все еще нужно, чтобы вы предоставили разрешение на все из них, потому что Google не предоставляет отдельные разрешения для *«просмотра»*, *«редактирования»* и *«удаления»*. Мы будем использовать только разрешение *«просмотра»*.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="Войдите в систему с учетной записью, которую вы используете для Google Business Profile"/>

*Нажмите «Войти с Google» и войдите в свою учетную запись Google Business Profile.*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*Предоставление Seasalt AI разрешений дает нам возможность публично запустить виртуального агента вашего бренда на вашей странице Google Карт от вашего имени.*
</center>


### Шаг 2. Создайте своего виртуального агента.

После того, как вы войдете в систему и предоставите разрешение, вы увидите все компании, которыми вы управляете с помощью своей учетной записи Google Business Profile. Если вы не видите свою компанию, убедитесь, что вы используете правильную учетную запись Google Business Profile для входа. Вы также можете нажать кнопку *«Синхронизировать»*, чтобы синхронизировать свои компании. Обратите внимание, что вам нужно будет настроить виртуального агента индивидуально для каждого из ваших бизнес-местоположений. Чтобы настроить своего виртуального агента, нажмите кнопку *«добавить агента»* в одной из ваших компаний.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*Компании, связанные с нашим Google Business Profile.*
</center>

Near Me Messaging начнет создавать вашего виртуального агента, синхронизируя информацию из вашего Google Business Profile. Создание вашего виртуального агента должно занять менее 5 минут, и вы можете наблюдать за прогрессом по мере завершения каждого шага.


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*Вы можете просмотреть прогресс вашего виртуального агента.*
</center>

### Шаг 3. Протестируйте своего виртуального агента в частном порядке.

Когда ваш агент будет готов, на экране появятся QR-коды. Используйте свой мобильный телефон, чтобы отсканировать QR-код и протестировать своего виртуального агента. Это все еще частная версия вашего виртуального агента и пока не появится в вашем профиле Google Карт. Обратите внимание, что этот виртуальный агент является начальной версией, которая использует только информацию из вашего Google Business Profile вместе с отзывами клиентов из Google Карт для генерации ответов. Если вы протестируете его и почувствуете, что ваш виртуальный агент нуждается в некоторых улучшениях, вы можете значительно улучшить ответы, создавая пользовательские часто задаваемые вопросы, добавляя информацию с вашего веб-сайта и курируя свои отзывы Google. Для более подробного руководства по настройке, ознакомьтесь с нашим [руководством по улучшению вашего виртуального агента](https://wiki.seasalt.ai/nearme/maintain_agent/improve_agent/).

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*QR-коды для вашего частного виртуального агента появятся после завершения создания агента.*
</center>

### Шаг 4. Публично запустите своего виртуального агента.


После того, как вы протестируете своего виртуального агента и будете удовлетворены ответами, вы можете продолжить и запустить своего виртуального агента публично. Публичный запуск вашего виртуального агента сделает его доступным для ваших клиентов на Google Картах. В этом блоге я проведу вас через базовый процесс, но вы можете обратиться к нашей документации и видео о том, [как запустить своего виртуального агента в своем профиле Google Карт](https://wiki.seasalt.ai/nearme/setup/03-publish_agent/) для получения более подробной информации.

Сначала перейдите на вкладку «Виртуальный агент» и убедитесь, что *имя агента* и *изображение аватара агента* точно соответствуют тому, как вы хотите, чтобы они отображались. После того, как *имя агента* и *изображение аватара* будут проверены Google в рамках процесса запуска, **вы не сможете изменить их через сайт Near Me**.

После того, как вы подтвердили данные своего агента, перейдите на вкладку *«Публичный запуск»*. Нажмите кнопку *«Проверить»*, чтобы подтвердить свой бренд и местоположение в Google.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="проверьте свой бренд и местоположение в Google"/>

*Нажатие кнопки «Проверить» проверит ваш бренд и местоположение в Google.*
</center>

После того, как ваш бренд и местоположение будут проверены, вы можете нажать кнопку *«Запустить»*, чтобы публично запустить своего виртуального агента.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="запуск вашего виртуального агента на кнопке чата вашего профиля Google Карт"/>

*Нажатие кнопки «Запустить» запустит вашего виртуального агента на кнопке чата в вашем профиле Google Карт.*
</center>

Появление кнопки чата на Google Картах может занять до четырех часов. Как только кнопка чата появится, ваш виртуальный агент будет доступен для общения с вашими клиентами. После публичного запуска вы все еще можете постоянно вносить изменения и дополнительно настраивать своего виртуального агента. Когда вы вносите изменения, вы можете перейти на вкладку *«Частный тест»*, чтобы протестировать их, прежде чем делать их общедоступными. Как только вы будете довольны изменениями, вы можете нажать *«Перезапустить»* на странице *«Публичный запуск»*, чтобы мгновенно обновить публичную версию вашего виртуального агента.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Карт."/>

*Вы можете нажать кнопку «Перезапустить» после того, как закончите вносить изменения/улучшения в своего виртуального агента.*
</center>

[Закажите демонстрацию у нас](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting), и мы будем рады вам помочь!

Обновление: С тех пор мы переориентировали продукт на создание омниканальных чат-ботов. Теперь он называется [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!
`;export{e as default};
