const n=`---
title: "أطلق وكيلك الافتراضي على خرائط Google باستخدام ميزة المراسلة القريبة مني"
metatitle: "أطلق وكيلك الافتراضي على خرائط Google باستخدام ميزة المراسلة القريبة مني"
date: 2022-04-19 15:27:21-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "أطلق وكيلك الافتراضي على رسائل Google Business باستخدام ميزة المراسلة القريبة مني."
weight: 1
tags:
  - NearMe
image: images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/thumbnail.png
canonicalURL: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
url: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
---

لقد قدمنا لك سابقًا [ميزة المراسلة القريبة مني](https://seasalt.ai/blog/12-near-me-messaging-google-business-messages/) وفوائدها. تنفذ ميزة المراسلة القريبة مني وكيلًا افتراضيًا لرسائل Google Business، متاحًا مباشرةً من زر الدردشة في ملف تعريف Google Maps الخاص بالنشاط التجاري. يتم تشغيل الوكيل الافتراضي لميزة المراسلة القريبة مني بواسطة أحدث تقنيات فهم اللغة الطبيعية التي تقدم استجابات شبيهة بالبشر. ما يميز ميزة المراسلة القريبة مني عن الخدمات المماثلة هو وقت الإعداد الذي يستغرق 5 دقائق، والتخصيص الذاتي، ودعم الدردشة المباشرة المدمج.

تشمل فوائد ميزة المراسلة القريبة مني ما يلي:
- توفير الوقت والقوى العاملة في تقديم خدمة عملاء ممتازة
- تخصيص وكيلك من خلال منصة الخدمة الذاتية
- الحصول على رؤى العملاء من خلال تحليلات ميزة المراسلة القريبة مني
- فهم ما يحتاجه عميلك من خلال سجل المحادثات
- الدردشة مباشرة مع عملائك باستخدام ميزة الوكيل المباشر لدينا

نحن نبحث حاليًا عن مختبرين تجريبيين لميزة المراسلة القريبة مني. لمختبرينا التجريبيين، نقدم خدمتنا على نفقتنا لفترة محدودة، دون الحاجة إلى عقد. لا تفوت هذه الفرصة لتجربة وكيل افتراضي ومعرفة ما إذا كان مناسبًا لعملك. للبدء، اتبع هذا الدليل خطوة بخطوة حول كيفية إطلاق وكيلك الافتراضي باستخدام ميزة المراسلة القريبة مني!


## دليل خطوة بخطوة لإطلاق وكيلك الافتراضي باستخدام ميزة المراسلة القريبة مني

### الخطوة 1. قم بزيارة موقع ميزة المراسلة القريبة مني (تحديث: لقد قمنا منذ ذلك الحين بتحويل المنتج ليكون منشئ روبوتات محادثة متعددة القنوات. يسمى الآن [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!).

انتقل إلى موقع ميزة المراسلة القريبة مني (تحديث: لقد قمنا منذ ذلك الحين بتحويل المنتج ليكون منشئ روبوتات محادثة متعددة القنوات. يسمى الآن [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!) وانقر على زر *"تسجيل الدخول"*. بمجرد تسجيل الدخول باستخدام الحساب الذي تستخدمه لملف تعريف نشاطي التجاري على Google، تأكد من تحديد جميع المربعات المتاحة ومنح Seasalt AI الإذن لإطلاق وكيلك الافتراضي. Seasalt.ai هو [شريك Google رسمي](https://developers.google.com/business-communications/business-messages/partners)، لذا يمكنك الاطمئنان إلى أننا سنستخدم هذه الأذونات بمسؤولية. **نحن نستخدم هذه الأذونات لوظيفتين: أولاً، للوصول إلى المعلومات من ملف تعريف نشاطي التجاري على Google الخاص بك حتى يتمكن وكيلك الافتراضي من تقديم استجابات دقيقة، وثانيًا حتى نتمكن من إطلاق الوكيل إلى صفحة Google Maps الخاصة بنشاطك التجاري نيابة عنك.**

لن نستخدم هذه الأذونات أبدًا لتعديل أو حذف ملف تعريف نشاطك التجاري. ما زلنا بحاجة إلى منحك الإذن لجميعها لأن Google لا يوفر أذونات منفصلة لـ *"العرض"* و *"التحرير"* و *"الحذف"*. سنستخدم فقط إذن *"العرض"*.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="سجل الدخول باستخدام الحساب الذي تستخدمه لملف تعريف نشاطي التجاري على Google"/>

*انقر على "تسجيل الدخول باستخدام Google" وسجل الدخول باستخدام حساب ملف تعريف نشاطي التجاري على Google الخاص بك.*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*يمنح منح Seasalt AI الأذونات القدرة على إطلاق وكيلك الافتراضي لعلامتك التجارية علنًا إلى صفحة Google Maps الخاصة بك نيابة عنك.*
</center>


### الخطوة 2. قم ببناء وكيلك الافتراضي.

بمجرد تسجيل الدخول ومنح الإذن، سترى جميع الأنشطة التجارية التي تديرها باستخدام حساب ملف تعريف نشاطي التجاري على Google الخاص بك. إذا لم ترَ نشاطك التجاري، فتأكد من أنك تستخدم حساب ملف تعريف نشاطي التجاري على Google الصحيح لتسجيل الدخول. يمكنك أيضًا النقر على زر *"مزامنة"* لمزامنة أنشطتك التجارية. لاحظ أنك ستحتاج إلى إعداد الوكيل الافتراضي بشكل فردي لكل موقع من مواقع عملك. لإعداد وكيلك الافتراضي، انقر على زر *"إضافة وكيل"* في أحد أنشطتك التجارية.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*الأنشطة التجارية المرتبطة بملف تعريف نشاطي التجاري على Google.*
</center>

ستبدأ ميزة المراسلة القريبة مني في بناء وكيلك الافتراضي عن طريق مزامنة المعلومات من ملف تعريف نشاطي التجاري على Google الخاص بك. يجب أن يستغرق بناء وكيلك الافتراضي أقل من 5 دقائق، ويمكنك مشاهدة التقدم مع اكتمال كل خطوة.


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*يمكنك عرض تقدم وكيلك الافتراضي.*
</center>

### الخطوة 3. اختبر وكيلك الافتراضي بشكل خاص.

عندما ينتهي وكيلك من البناء، ستظهر رموز QR على شاشتك. استخدم هاتفك المحمول لمسح رمز QR واختبار وكيلك الافتراضي. لا يزال هذا إصدارًا خاصًا من وكيلك الافتراضي ولن يظهر في ملف تعريف Google Maps الخاص بك بعد. لاحظ أن هذا الوكيل الافتراضي هو إصدار أولي يستخدم فقط المعلومات من ملف تعريف نشاطي التجاري على Google الخاص بك جنبًا إلى جنب مع مراجعات العملاء من Google Maps لإنشاء الردود. إذا قمت باختباره وشعرت أن وكيلك الافتراضي يحتاج إلى بعض التحسينات، يمكنك تحسين الردود بشكل كبير عن طريق إنشاء أسئلة متكررة مخصصة، وإضافة معلومات من موقع الويب الخاص بك، وتنظيم مراجعات Google الخاصة بك. للحصول على دليل أكثر تفصيلاً حول التخصيص، ألقِ نظرة على [دليلنا لتحسين وكيلك الافتراضي](https://wiki.seasalt.ai/nearme/maintain_agent/improve_agent/).

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*ستظهر رموز QR لوكيلك الافتراضي الخاص بمجرد الانتهاء من بناء وكيلك.*
</center>

### الخطوة 4. أطلق وكيلك الافتراضي علنًا.


بمجرد اختبار وكيلك الافتراضي ورضاك عن الردود، يمكنك المضي قدمًا وإطلاق وكيلك الافتراضي. من خلال إطلاق وكيلك الافتراضي علنًا، سيكون وكيلك متاحًا لعملائك على خرائط Google. في هذه المدونة، سأرشدك خلال العملية الأساسية، ولكن يمكنك الرجوع إلى وثائقنا ومقاطع الفيديو الخاصة بنا حول [كيفية إطلاق وكيلك الافتراضي على ملف تعريف Google Maps الخاص بك](https://wiki.seasalt.ai/nearme/setup/03-publish_agent/) للحصول على معلومات أكثر تفصيلاً.

أولاً، انتقل إلى علامة التبويب "الوكيل الافتراضي" وتأكد من أن *اسم الوكيل* و *صورة رمز الوكيل* هما بالضبط كما تريد أن يظهرا. بمجرد التحقق من *اسم الوكيل* و *صورة الرمز* بواسطة Google كجزء من عملية الإطلاق، **لن تتمكن من تعديلهما عبر موقع ميزة المراسلة القريبة مني**.

بمجرد تأكيد تفاصيل وكيلك، انتقل إلى علامة التبويب *"الإطلاق العام"*. انقر على زر *"التحقق"* للتحقق من علامتك التجارية وموقعك مع Google.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="تحقق من علامتك التجارية وموقعك مع Google"/>

*سيؤدي النقر على زر "التحقق" إلى التحقق من علامتك التجارية وموقعك مع Google.*
</center>

بمجرد التحقق من علامتك التجارية وموقعك، يمكنك النقر على زر *"إطلاق"* لإطلاق وكيلك الافتراضي علنًا.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="إطلاق وكيلك الافتراضي على زر الدردشة في ملف تعريف Google Maps الخاص بك"/>

*سيؤدي النقر على زر "إطلاق" إلى إطلاق وكيلك الافتراضي إلى زر الدردشة في ملف تعريف Google Maps الخاص بك.*
</center>

قد يستغرق ظهور زر الدردشة على خرائط Google ما يصل إلى أربع ساعات. بمجرد ظهور زر الدردشة، يصبح وكيلك الافتراضي متاحًا لعملائك للدردشة معه. بعد الإطلاق العام، لا يزال بإمكانك إجراء تغييرات باستمرار وتخصيص وكيلك الافتراضي بشكل أكبر. عند إجراء تغييرات، يمكنك الانتقال إلى علامة التبويب *"الاختبار الخاص"* لاختبارها قبل جعلها عامة. بمجرد رضاك عن التغييرات، يمكنك النقر على *"إعادة الإطلاق"* من صفحة *"الإطلاق العام"* لتحديث الإصدار العام من وكيلك الافتراضي على الفور.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="تدمج ميزة المراسلة القريبة مني رسائل Google Business مع زر الدردشة في ملف تعريف Google Maps الخاص بك."/>

*يمكنك النقر على زر "إعادة الإطلاق" بمجرد الانتهاء من إجراء التغييرات/التحسينات على وكيلك الافتراضي.*
</center>

[احجز عرضًا توضيحيًا معنا](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) وسنكون أكثر من سعداء لمساعدتك!

تحديث: لقد قمنا منذ ذلك الحين بتحويل المنتج ليكون منشئ روبوتات محادثة متعددة القنوات. يسمى الآن [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!
`;export{n as default};
