const e=`---
title: "เปิดตัวตัวแทนเสมือนของคุณบน Google Maps ด้วย Near Me Messaging"
metatitle: "เปิดตัวตัวแทนเสมือน Google Maps ของคุณด้วย Near Me Messaging"
date: 2022-04-19 15:27:21-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "เปิดตัวตัวแทนเสมือนของคุณบน Google Business Messages ด้วย Near Me Messaging."
weight: 1
tags:
  - NearMe
image: images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/thumbnail.png
canonicalURL: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
url: /blog/virtual-agent-on-google-maps-with-near-me-messaging/
---

เราได้แนะนำให้คุณรู้จักกับ [Near Me Messaging](https://seasalt.ai/blog/12-near-me-messaging-google-business-messages/) และประโยชน์ของมันไปแล้ว Near Me Messaging ใช้ตัวแทนเสมือนของ Google Business Messages ซึ่งสามารถเข้าถึงได้โดยตรงจากปุ่มแชทบนโปรไฟล์ Google Maps ของธุรกิจ ตัวแทนเสมือนของ Near Me Messaging ขับเคลื่อนโดยเทคโนโลยีการทำความเข้าใจภาษาธรรมชาติที่ล้ำสมัย ซึ่งให้การตอบสนองที่เหมือนมนุษย์ สิ่งที่ทำให้ Near Me Messaging แตกต่างจากบริการที่คล้ายกันคือเวลาตั้งค่าเพียง 5 นาที การปรับแต่งด้วยตนเอง และการสนับสนุนแชทสดในตัว

ประโยชน์ของ Near Me Messaging ได้แก่:
- ประหยัดเวลาและกำลังคนในการให้บริการลูกค้าที่เป็นเลิศ
- ปรับแต่งตัวแทนของคุณผ่านแพลตฟอร์มบริการตนเอง
- รับข้อมูลเชิงลึกของลูกค้าผ่าน Near Me Analytics
- ทำความเข้าใจความต้องการของลูกค้าผ่านประวัติการสนทนา
- แชทโดยตรงกับลูกค้าของคุณด้วยคุณสมบัติ Live Agent ของเรา

ขณะนี้เรากำลังมองหาผู้ทดสอบเบต้าสำหรับ Near Me Messaging สำหรับผู้ทดสอบเบต้าของเรา เรากำลังเสนอบริการของเราโดยไม่มีค่าใช้จ่ายเป็นระยะเวลาจำกัด โดยไม่จำเป็นต้องมีสัญญา อย่าพลาดโอกาสนี้ในการทดลองใช้ตัวแทนเสมือนและดูว่าเหมาะสมกับธุรกิจของคุณหรือไม่ หากต้องการเริ่มต้น ให้ทำตามคำแนะนำทีละขั้นตอนนี้เกี่ยวกับวิธีเปิดตัวตัวแทนเสมือนของคุณด้วย Near Me Messaging!


## คำแนะนำทีละขั้นตอนในการเปิดตัวตัวแทนเสมือนของคุณด้วย Near Me Messaging

### ขั้นตอนที่ 1. เยี่ยมชมเว็บไซต์ Near Me Messaging (อัปเดต: เราได้เปลี่ยนผลิตภัณฑ์ให้เป็นเครื่องมือสร้างแชทบอทแบบ Omnichannel แล้ว ตอนนี้เรียกว่า [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!).

ไปที่เว็บไซต์ Near Me Messaging (อัปเดต: เราได้เปลี่ยนผลิตภัณฑ์ให้เป็นเครื่องมือสร้างแชทบอทแบบ Omnichannel แล้ว ตอนนี้เรียกว่า [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!) และคลิกปุ่ม *“ลงชื่อเข้าใช้”* เมื่อคุณลงชื่อเข้าใช้ด้วยบัญชีที่คุณใช้สำหรับ Google Business Profile ตรวจสอบให้แน่ใจว่าคุณได้เลือกช่องที่มีอยู่ทั้งหมดและให้สิทธิ์ Seasalt AI ในการเปิดตัวตัวแทนเสมือนของคุณ Seasalt.ai เป็น [พันธมิตรอย่างเป็นทางการของ Google](https://developers.google.com/business-communications/business-messages/partners) ดังนั้นคุณจึงมั่นใจได้ว่าเราจะใช้สิทธิ์เหล่านี้อย่างรับผิดชอบ **เราใช้สิทธิ์เหล่านี้สำหรับสองฟังก์ชัน: ประการแรก เพื่อเข้าถึงข้อมูลจาก Google Business Profile ของคุณ เพื่อให้ตัวแทนเสมือนของคุณสามารถให้การตอบสนองที่ถูกต้อง และประการที่สอง เพื่อให้เราสามารถเปิดตัวตัวแทนไปยังหน้า Google Maps ของธุรกิจของคุณในนามของคุณ**

เราจะไม่ใช้สิทธิ์เหล่านี้เพื่อแก้ไขหรือลบโปรไฟล์ธุรกิจของคุณ เรายังคงต้องการให้คุณให้สิทธิ์ทั้งหมด เนื่องจาก Google ไม่ได้ให้สิทธิ์แยกต่างหากสำหรับ *“ดู”*, *“แก้ไข”* และ *“ลบ”* เราจะใช้เฉพาะสิทธิ์ *“ดู”* เท่านั้น

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="ลงชื่อเข้าใช้ด้วยบัญชีที่คุณใช้สำหรับ Google Business Profile"/>

*คลิก “ลงชื่อเข้าใช้ด้วย Google” และลงชื่อเข้าใช้ด้วยบัญชี Google Business Profile ของคุณ.*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*การให้สิทธิ์แก่ Seasalt AI ทำให้เราสามารถเปิดตัวตัวแทนเสมือนของแบรนด์ของคุณสู่สาธารณะบนหน้า Google Maps ของคุณในนามของคุณ.*
</center>


### ขั้นตอนที่ 2. สร้างตัวแทนเสมือนของคุณ

เมื่อคุณลงชื่อเข้าใช้และให้สิทธิ์แล้ว คุณจะเห็นธุรกิจทั้งหมดที่คุณจัดการด้วยบัญชี Google Business Profile ของคุณ หากคุณไม่เห็นธุรกิจของคุณ ตรวจสอบให้แน่ใจว่าคุณใช้บัญชี Google Business Profile ที่ถูกต้องในการลงชื่อเข้าใช้ คุณยังสามารถคลิกปุ่ม *“ซิงค์”* เพื่อซิงค์ธุรกิจของคุณได้ โปรดทราบว่าคุณจะต้องตั้งค่าตัวแทนเสมือนทีละรายการสำหรับแต่ละสถานที่ตั้งธุรกิจของคุณ หากต้องการตั้งค่าตัวแทนเสมือนของคุณ ให้คลิกปุ่ม *“เพิ่มตัวแทน”* ในธุรกิจใดธุรกิจหนึ่งของคุณ

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*ธุรกิจที่เกี่ยวข้องกับ Google Business Profile ของเรา.*
</center>

Near Me Messaging จะเริ่มสร้างตัวแทนเสมือนของคุณโดยการซิงค์ข้อมูลจาก Google Business Profile ของคุณ การสร้างตัวแทนเสมือนของคุณควรใช้เวลาน้อยกว่า 5 นาที และคุณสามารถดูความคืบหน้าเมื่อแต่ละขั้นตอนเสร็จสมบูรณ์


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*คุณสามารถดูความคืบหน้าของตัวแทนเสมือนของคุณ.*
</center>

### ขั้นตอนที่ 3. ทดสอบตัวแทนเสมือนของคุณแบบส่วนตัว

เมื่อตัวแทนของคุณสร้างเสร็จแล้ว รหัส QR จะปรากฏบนหน้าจอของคุณ ใช้โทรศัพท์มือถือของคุณเพื่อสแกนรหัส QR และทดสอบตัวแทนเสมือนของคุณ นี่เป็นเวอร์ชันส่วนตัวของตัวแทนเสมือนของคุณและจะยังไม่ปรากฏบนโปรไฟล์ Google Maps ของคุณ โปรดทราบว่าตัวแทนเสมือนนี้เป็นเวอร์ชันเริ่มต้นที่ใช้ข้อมูลจาก Google Business Profile ของคุณพร้อมกับรีวิวของลูกค้าจาก Google Maps เพื่อสร้างการตอบสนองเท่านั้น หากคุณทดสอบแล้วรู้สึกว่าตัวแทนเสมือนของคุณต้องการการปรับปรุง คุณสามารถปรับปรุงการตอบสนองได้อย่างมากโดยการสร้างคำถามที่พบบ่อยที่กำหนดเอง เพิ่มข้อมูลจากเว็บไซต์ของคุณ และดูแลจัดการรีวิว Google ของคุณ สำหรับคำแนะนำโดยละเอียดเพิ่มเติมเกี่ยวกับการปรับแต่ง โปรดดู [คำแนะนำของเราในการปรับปรุงตัวแทนเสมือนของคุณ](https://wiki.seasalt.ai/nearme/maintain_agent/improve_agent/)

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*รหัส QR สำหรับตัวแทนเสมือนส่วนตัวของคุณจะปรากฏขึ้นเมื่อตัวแทนของคุณสร้างเสร็จแล้ว.*
</center>

### ขั้นตอนที่ 4. เปิดตัวตัวแทนเสมือนของคุณสู่สาธารณะ


เมื่อคุณทดสอบตัวแทนเสมือนของคุณและพอใจกับการตอบสนองแล้ว คุณสามารถดำเนินการเปิดตัวตัวแทนเสมือนของคุณสู่สาธารณะได้ ด้วยการเปิดตัวตัวแทนเสมือนของคุณสู่สาธารณะ ตัวแทนของคุณจะพร้อมให้บริการลูกค้าของคุณบน Google Maps ในบล็อกนี้ ฉันจะแนะนำคุณตลอดกระบวนการพื้นฐาน แต่คุณสามารถอ้างอิงเอกสารและวิดีโอของเราเกี่ยวกับ [วิธีเปิดตัวตัวแทนเสมือนของคุณบนโปรไฟล์ Google Maps ของคุณ](https://wiki.seasalt.ai/nearme/setup/03-publish_agent/) สำหรับข้อมูลโดยละเอียดเพิ่มเติม

ขั้นแรก ไปที่แท็บ “ตัวแทนเสมือน” และตรวจสอบให้แน่ใจว่า *ชื่อตัวแทน* และ *รูปภาพอวตารตัวแทน* ของคุณตรงตามที่คุณต้องการให้ปรากฏ เมื่อ *ชื่อตัวแทน* และ *รูปภาพอวตาร* ได้รับการยืนยันโดย Google ซึ่งเป็นส่วนหนึ่งของกระบวนการเปิดตัว **คุณจะไม่สามารถแก้ไขได้ผ่านเว็บไซต์ Near Me**

เมื่อคุณยืนยันรายละเอียดตัวแทนของคุณแล้ว ให้ไปที่แท็บ *“เปิดตัวสู่สาธารณะ”* คลิกปุ่ม *“ยืนยัน”* เพื่อยืนยันแบรนด์และตำแหน่งของคุณกับ Google

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="ยืนยันแบรนด์และตำแหน่งของคุณกับ Google"/>

*การคลิกปุ่ม "ยืนยัน" จะยืนยันแบรนด์และตำแหน่งของคุณกับ Google.*
</center>

เมื่อแบรนด์และตำแหน่งของคุณได้รับการยืนยันแล้ว คุณสามารถคลิกปุ่ม *“เปิดตัว”* เพื่อเปิดตัวตัวแทนเสมือนของคุณสู่สาธารณะได้

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="การเปิดตัวตัวแทนเสมือนของคุณบนปุ่มแชทของโปรไฟล์ Google Maps ของคุณ"/>

*การคลิกปุ่ม “เปิดตัว” จะเปิดตัวตัวแทนเสมือนของคุณไปยังปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ.*
</center>

อาจใช้เวลาถึงสี่ชั่วโมงกว่าปุ่มแชทจะปรากฏบน Google Maps เมื่อปุ่มแชทปรากฏขึ้น ตัวแทนเสมือนของคุณจะพร้อมให้ลูกค้าของคุณแชทด้วย หลังจากการเปิดตัวสู่สาธารณะ คุณยังคงสามารถทำการเปลี่ยนแปลงและปรับแต่งตัวแทนเสมือนของคุณได้อย่างต่อเนื่อง เมื่อคุณทำการเปลี่ยนแปลง คุณสามารถไปที่แท็บ *“ทดสอบส่วนตัว”* เพื่อทดสอบก่อนที่จะเผยแพร่สู่สาธารณะ เมื่อคุณพอใจกับการเปลี่ยนแปลงแล้ว คุณสามารถคลิก *“เปิดตัวใหม่”* จากหน้า *“เปิดตัวสู่สาธารณะ”* เพื่ออัปเดตเวอร์ชันสาธารณะของตัวแทนเสมือนของคุณทันที

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging ผสานรวม Google Business Messages กับปุ่มแชทบนโปรไฟล์ Google Maps ของคุณ."/>

*คุณสามารถคลิกปุ่ม "เปิดตัวใหม่" เมื่อคุณทำการเปลี่ยนแปลง/ปรับปรุงตัวแทนเสมือนของคุณเสร็จแล้ว.*
</center>

[จองการสาธิตกับเรา](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) และเรายินดีที่จะช่วยเหลือคุณ!

อัปเดต: เราได้เปลี่ยนผลิตภัณฑ์ให้เป็นเครื่องมือสร้างแชทบอทแบบ Omnichannel แล้ว ตอนนี้เรียกว่า [SeaChat](https://chat.seasalt.ai/?utm_source=blog)!
`;export{e as default};
