const e=`---
title: "راهنمای نهایی برای فعال کردن چت در Google Maps برای ارتباط با مشتریان"
metatitle: "راهنمای نهایی برای فعال کردن چت در Google Maps"
date: 2022-04-29 20:39:13-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Ruli Setiawati
description: "در این وبلاگ، سه روش مختلف برای فعال کردن چت Google Maps را بررسی خواهیم کرد تا ارتباط بهتری با مشتریان برقرار شود."
weight: 1
tags:
  - NearMe
image: images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/ultimate_guide_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps-to-connect-with-customers/
url: /blog/enable-chat-on-google-maps-to-connect-with-customers/
---

*چت Google Maps راهی عالی برای کسب‌وکارها برای ارتباط با مشتریان است. روش‌های مختلفی برای فعال کردن چت Google Maps وجود دارد: یک روش دستی با Google Business Profile، یک روش خودکار با Google Business Messages، و روشی که بهترین‌های هر دو دنیا را با Near Me Messaging ترکیب می‌کند. این وبلاگ شما را در مورد نحوه فعال کردن چت Google Maps با این سه روش مختلف راهنمایی می‌کند.*

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/comparison_table.jpg" alt="مقایسه 3 روش مختلف پیاده‌سازی چت Google Maps با Google Business Profile، Google Business Messages و Near Me Messaging"/>

*مقایسه 3 روش مختلف پیاده‌سازی چت Google Maps با [Google Business Profile](https://www.google.com/intl/en_us/business/)، [Google Business Messages](https://businessmessages.google/) و Near Me Messaging.*
</center>

# فهرست مطالب
- [چت Google Maps چیست و چرا باید آن را فعال کنید](#what-is-google-maps-chat-and-why-you-should-enable-it)
- [1. چت Google Maps با Google Business Profile](#1-google-maps-chat-with-google-business-profile)
    - [راهنمای گام به گام برای فعال کردن چت Google Maps با Google Business Profile](#step-1-sign-in-to-your-google-business-profile-account)
- [2. چت Google Maps با Google Business Messages](#2-google-maps-chat-with-google-business-messages)
    - [نحوه پیاده‌سازی Google Business Messages توسط کسب‌وکارها](#how-businesses-implement-google-business-messages)
    - [موانع پیاده‌سازی](#barriers-for-implementation)
- [3. چت Google Maps با Near Me Messaging](#3-google-maps-chat-with-near-me-messaging)
    - [مزایای Near Me Messaging](#benefits-of-near-me-messaging)
    - [راهنمای گام به گام برای فعال کردن چت Google Maps با Near Me Messaging](#step-by-step-guide-to-launching-your-virtual-agent-with-near-me-messaging)

# چت Google Maps چیست و چرا باید آن را فعال کنید

هنگامی که به یک فروشگاه، باشگاه ورزشی، نمایندگی خودرو یا سایر کسب‌وکارها با استفاده از برنامه Google Maps می‌روید، ممکن است متوجه شده باشید که برخی از آنها دکمه چت در خود دارند. این دکمه چت به شما، به عنوان صاحب کسب‌وکار، امکان می‌دهد با مشتریان خود ارتباط برقرار کنید. مشتریان شما می‌توانند مستقیماً از طریق دکمه چت در Google Maps یا در Google Search با شما تماس بگیرند و شما می‌توانید هر زمان که در دسترس بودید پاسخ دهید. 

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/chat_button.png" alt="یک لیست کسب‌وکار با قابلیت چت فعال در پروفایل Google Maps"/>

*نحوه نمایش قابلیت چت در یک لیست کسب‌وکار از برنامه Google Maps.*
</center>

چرا این یک ویژگی مهم برای صاحبان کسب‌وکار است؟ اول، کسب‌وکار شما در میان سایر کسب‌وکارها برجسته خواهد شد زیرا شما ارتباط با مشتریان را آسان می‌کنید. در واقع، [72 درصد از مشتریان](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) احتمال بیشتری دارد که محصولاتی را از فروشگاهی خریداری کنند که می‌توانند از طریق پیام‌رسانی چت درباره محصولات سؤال کنند. دوم، Google Maps به یک مرکز اطلاعات محلی 411 برای مصرف‌کنندگان تبدیل شده است، زمانی که آنها به دنبال اطلاعات کسب‌وکار هستند، به لطف انواع اطلاعات کسب‌وکار جمع‌آوری شده (مانند منو، رزرو، امکانات، نکات برجسته، پیش‌نمایش‌ها، تصاویر). Google Maps به [سیستم عامل جدید برای کسب‌وکارها](/blog/11-google-maps-replaces-google-my-business/) تبدیل شده است.


اکنون، روش‌های مختلفی برای فعال کردن چت Google Maps وجود دارد: یک روش دستی با Google Business Profile، یک روش خودکار با Google Business Messages، و روشی که بهترین‌های هر دو دنیا را با Near Me Messaging ترکیب می‌کند. ما شما را در مورد نحوه استفاده از چت Google Maps با Google Business Profile و Google Business Messages، همراه با مزایا و معایب آن راهنمایی خواهیم کرد. در نهایت، شما را در مورد نحوه استفاده از چت Google Maps با Near Me Messaging راهنمایی خواهیم کرد. 

# 1. چت Google Maps با Google Business Profile

Google Business Profile ابزاری است که به کسب‌وکارها امکان می‌دهد یک پروفایل یا لیست کسب‌وکار رایگان ایجاد کنند که در سراسر خدمات Google مانند Google Search و Google Maps ظاهر می‌شود. می‌توانید به منابع Google در مورد [نحوه افزودن یا ادعای پروفایل کسب‌وکار خود در Google](https://support.google.com/business/answer/2911778?hl=en&co=GENIE.Platform%3DDesktop) مراجعه کنید. مزایای داشتن یک لیست Google Business Profile شامل موارد زیر است:

- جذب مشتری و افزایش دید از طریق Google Search و Google Maps
- ارائه اطلاعات به‌روز درباره کسب‌وکار شما مانند ساعات کاری و ویژگی‌ها
- ایجاد شهرت از طریق رتبه‌بندی ستاره‌ای و نظرات
- کسب بینش در مورد عملکرد جستجوی شما در سراسر خدمات Google

با Google Business Profile، می‌توانید قابلیت چت را در این سه مرحله آسان فعال کنید:

## مرحله 1. وارد حساب Google Business Profile خود شوید. 

از [صفحه اصلی Google Business Profile](https://www.google.com/business/) بازدید کنید و وارد لیست کسب‌وکار خود شوید.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="صفحه Google Business Profile پس از ورود صاحب کسب‌وکار"/>

*صفحه Google Business Profile پس از ورود صاحب کسب‌وکار.*
</center>

## مرحله 2. به تب پیام‌ها بروید.

مرحله بعدی کلیک بر روی تب *"Messages"* در سمت چپ صفحه است. 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="رابط کاربری تب پیام‌ها در Google Business Profile"/>

*رابط کاربری تب پیام‌ها.*
</center>

## مرحله 3. قابلیت «چت» را در لیست خود فعال کنید.

روی دکمه *"turn on chat"* همانطور که در زیر نشان داده شده است کلیک کنید.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "با کلیک بر روی دکمه فعال کردن چت، قابلیت چت فعال می‌شود"/>

*برای فعال کردن قابلیت چت، روی دکمه فعال کردن چت کلیک کنید.*
</center>

به محض کلیک بر روی دکمه *"Turn on chat"*، یک پنجره پاپ‌آپ ظاهر می‌شود تا به شما اطلاع دهد که چت شما فعال شده است. Google همچنین یک اعلان ایمیل در مورد قابلیت چت تازه فعال شده شما ارسال خواهد کرد.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png"/>

*یک صفحه پاپ‌آپ که به صاحب کسب‌وکار اطلاع می‌دهد قابلیت چت فعال شده است.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="اعلان ایمیل از Google در مورد قابلیت چت تازه فعال شده در Google Maps"/>

*اعلان ایمیل از Google در مورد قابلیت «چت» تازه فعال شده.*
</center>

## پاسخ به پیام‌های مشتریان شما

هنگامی که سرویس پیام‌رسانی Google Business Profile را فعال می‌کنید، می‌توانید دکمه چت را در لیست خود مشاهده کنید و مشتریان می‌توانند با هرگونه سؤالی که ممکن است داشته باشند با کسب‌وکار شما تماس بگیرند. به خاطر داشته باشید که هنگام استفاده از این ویژگی، باید اطمینان حاصل کنید که برای پاسخگویی به سؤالات در دسترس خواهید بود. مشتریان می‌توانند میانگین زمان پاسخگویی شما را ببینند و اگر زمان پاسخگویی طولانی‌تری را مشاهده کنند، ممکن است از تماس با شما منصرف شوند. بسیار مهم است که ظرف 24 ساعت به پیام‌های مشتریان خود پاسخ دهید. طبق [صفحه پرسش‌های متداول Google Business Profile](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google)، اگر ظرف یک روز پاسخ ندهید، Google ممکن است دکمه «چت» را از لیست شما حذف کند.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="زمان پاسخگویی در قابلیت چت در Google Maps نشان داده می‌شود، زمانی که مشتریان در شرف تایپ سؤال هستند"/>

*زمان پاسخگویی در قابلیت چت در Google Maps نشان داده می‌شود 
زمانی که مشتریان در شرف تایپ سؤال هستند.*
</center>

اکنون که می‌دانید چت Google Maps چگونه با Google Business Profile کار می‌کند، چگونه مطمئن می‌شوید که کسب‌وکار شما می‌تواند با تعداد فزاینده‌ای از سؤالات مشتریان همگام باشد؟ با افزایش تماس مشتریان با شما از طریق چت، ممکن است زمان و منابع لازم برای پاسخگویی به هر چت را نداشته باشید، به خصوص در ساعات تعطیلی. علاوه بر این، بیشتر سؤالات می‌توانند تکراری باشند. در عین حال، مشتریان از کسب‌وکارها انتظار پاسخ‌های فوری دارند. اگر کسب‌وکارها نیازهای مشتریان خود را برآورده نکنند، در معرض خطر از دست دادن مشتریان فعلی و بالقوه قرار می‌گیرند. پاسخگویی به چت‌های تکراری زمان و هزینه زیادی می‌برد. 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="مصرف‌کنندگان از عدم پاسخگویی به سؤالاتشان و گیر افتادن در انتظار برای مدت طولانی ناراحت هستند"/>

*چه چیزی آینده پیام‌رسانی در ایالات متحده را هدایت می‌کند؟ ([منبع](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="یک امتیاز 1 ستاره توسط یک مشتری ناراضی در Google Maps به دلیل عدم ارتباط توسط صاحب کسب‌وکار."/>

*یک امتیاز 1 ستاره توسط یک مشتری ناراضی به دلیل عدم ارتباط توسط صاحب کسب‌وکار.*
</center>


به همین دلیل می‌خواهیم روش دوم را به شما معرفی کنیم، روشی خودکار برای استفاده از چت Google Maps با Google Business Messages.


# 2. چت Google Maps با Google Business Messages

[Google Business Messages](https://businessmessages.google/) یک تجربه مکالمه‌ای نسل بعدی است که مشکل ارائه پاسخ‌های بی‌درنگ به مشتریان شما را در زمانی که انسانی در دسترس نیست، حل می‌کند. در حالی که Google Business Profile به صاحبان کسب‌وکار اجازه می‌دهد مستقیماً از طریق دکمه چت در Google Maps با مشتریان چت کنند، Google Business Messages با فعال کردن ادغام با یک عامل مجازی، یک گام فراتر می‌رود. طبق [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6)، یک عامل مجازی «یک شخصیت مجازی هوش مصنوعی متحرک و تولید شده توسط کامپیوتر (معمولاً با ظاهر انسان‌نما) است که به عنوان نماینده خدمات مشتری آنلاین عمل می‌کند».


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="تصمیم‌گیرندگان کسب‌وکار معتقدند که پیام‌های کسب‌وکار Google تعامل با مشتریان را بهبود می‌بخشد"/>

*شخصی‌سازی: چگونه ابزارهای ارتباطی هوشمند نتایج کسب‌وکار را هدایت می‌کنند ([منبع](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>


یک عامل مجازی اغلب به عنوان دستیار دیجیتال شناخته می‌شود. عوامل مجازی از فناوری به نام پردازش زبان طبیعی (NLP) برای ارائه پاسخ‌های خودکار استفاده می‌کنند. عوامل مجازی می‌توانند با کاهش زمان پاسخگویی، ارائه دسترسی 24/7 و بهبود تجربه مشتری، به کسب‌وکار شما سود برسانند. اینگونه است که Google Business Messages می‌تواند به شما در ارائه پاسخ‌های خودکار با کیفیت بالا به مشتریان کمک کند. 

مزایای اضافی Google Business Messages عبارتند از:
- ارائه پاسخ‌های فوری به سؤالات مشتریان شما
- صرفه‌جویی در زمان و هزینه در ارائه خدمات عالی به مشتری
- ایجاد اعتماد با مشتریان شما

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages یک عامل مجازی را مستقیماً در دکمه چت در Google Maps ادغام می‌کند"/>

*Google Business Messages یک عامل مجازی را مستقیماً در دکمه چت شما ادغام می‌کند.*
</center>


## نحوه پیاده‌سازی Google Business Messages توسط کسب‌وکارها

برای درک بهتر اینکه چگونه Google Business Messages می‌تواند به کسب‌وکار شما کمک کند، بیایید به چند نمونه از Walmart، Levi’s و Albertsons Companies نگاهی بیندازیم.

### 1. Walmart

Walmart از اولین شرکت‌هایی است که Business Messages را پیاده‌سازی کرده است ([وبلاگ Google](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). با Google Business Messages، Walmart اطلاعات به‌روز در مورد ساعات کاری فروشگاه، محصولات، واکسن و آزمایش COVID-19، گزینه‌های تحویل و دریافت، سیاست بازگشت و موارد دیگر را ارائه می‌دهد. مشتریان می‌توانند در هر زمان از روز پاسخ‌های فوری دریافت کنند.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="مشتریان می‌توانند از طریق دکمه چت در Google Maps (فقط موبایل) با Walmart تماس بگیرند"/>

*مشتریان می‌توانند از طریق دکمه چت در Google Maps (فقط موبایل) با Walmart تماس بگیرند.*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="مشتریان می‌توانند از عامل مجازی Walmart در مورد ساعات کاری فروشگاه، محصولات، سیاست ماسک، واکسن COVID-19 و موارد دیگر سؤال کنند"/>

*مشتریان می‌توانند در مورد ساعات کاری فروشگاه، محصولات، سیاست ماسک، واکسن COVID-19 و موارد دیگر سؤال کنند.*
</center>

### 2. Levi’s


Levi’s یک شرکت پوشاک است که به دلیل شلوارهای جین Levi’s خود شناخته شده است و 3100 فروشگاه خرده‌فروشی در 110 کشور دارد. در طول همه‌گیری، Levi’s مشاهده کرد که خریداران زمان قابل توجهی را صرف تحقیق قبل از خرید می‌کنند و ساعات کاری فروشگاه ممکن است بیشتر تغییر کند. Levi’s می‌خواست خریداران را به مشتریان واقعی تبدیل کند و به سؤالات خریداران پاسخ‌های سریع ارائه دهد.

در ژوئن 2020، Levi’s با هدف بهبود تجربه مشتری با ارائه اطلاعات به‌روز در مورد فروشگاه‌ها و محصولات، Google Business Messages را پیاده‌سازی کرد. Levi’s از قابلیت Google Business Messages برای کمک به مشتریان در هر زمان از روز استفاده کرد و در نتیجه، توانست به امتیاز رضایت مشتری (CSAT) 85% دست یابد. Levi’s همچنین مشاهده کرد که 30 برابر بیشتر سؤالات مربوط به فروشگاه حل شده است. درباره نحوه پیاده‌سازی Google Business Messages توسط Levi’s [اینجا](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf) بیشتر بیاموزید.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="مشتریان می‌توانند از طریق دکمه چت در Google Maps (فقط موبایل) با Levi’s تماس بگیرند"/>

*مشتریان می‌توانند از طریق دکمه چت (فقط موبایل) با Levi’s تماس بگیرند.*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="مشتریان می‌توانند هنگام تعامل با عامل مجازی Levi’s در Google Maps، محصولات Levi’s را مشاهده کنند"/>

*مشتریان می‌توانند هنگام تعامل با عامل مجازی Levi’s، محصولات Levi’s را مشاهده کنند.*
</center>


### 3. Albertsons Companies

شرکت Albertsons چندین داروخانه در سراسر ایالات متحده از جمله Safeway، Jewel-Osco، Vons، Albertsons، Shaw’s و غیره را در اختیار دارد. در اواخر سال 2020، در طول انتشار اولیه واکسن‌های COVID-19، جستجوهای آنلاین برای واکسن افزایش یافت. سؤالات بیشتری در مورد واجد شرایط بودن واکسن، قرار ملاقات‌ها و مکان‌هایی که افراد می‌توانند واکسن را دریافت کنند، وجود داشت. شرکت Albertsons تصمیم گرفت Google Business Messages را فعال کند تا اطلاعات به‌روز در مورد معیارهای واجد شرایط بودن، قرار ملاقات‌ها، در دسترس بودن و موارد دیگر را ارائه دهد. در نتیجه، آنها توانستند تعداد تماس‌های ورودی را کاهش دهند، از اطلاعات نادرست احتمالی جلوگیری کنند و به مشتریان 24/7 کمک کنند. 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="مشتریان می‌توانند اطلاعات مربوط به واجد شرایط بودن واکسن را دریافت کرده و مستقیماً از عامل مجازی Albertsons Co. قرار ملاقات رزرو کنند"/>

*مشتریان می‌توانند اطلاعات مربوط به واجد شرایط بودن واکسن را دریافت کرده و قرار ملاقات رزرو کنند.*
</center>

Google Business Messages راهی عالی برای صرفه‌جویی در زمان و هزینه در پاسخگویی به سؤالات تکراری، ایجاد روابط با مشتریان و بهبود تجربه کلی مشتری است.


## موانع پیاده‌سازی

دو محدودیت اصلی در پیاده‌سازی رایج Google Business Messages که در بالا مشاهده شد، وجود دارد. 

اول از همه، [ایجاد و نگهداری یک عامل مجازی عالی کار ساده‌ای نیست](https://developers.google.com/business-communications/business-messages/guides/how-it-works)؛ به دانش پیشرفته هوش مصنوعی مکالمه‌ای و زمان توسعه قابل توجهی نیاز دارد. کسب‌وکارهایی که از Google Business Messages استفاده می‌کنند، باید به یک آژانس مشاوره حرفه‌ای هزینه پرداخت کنند تا یک تجربه کاملاً سفارشی برای آنها از پایه ایجاد کند. اینها معمولاً گران هستند و ممکن است ماه‌ها طول بکشد. شرکت‌های بزرگ مانند Levi’s، Walmart و Albertsons Companies، کسانی هستند که می‌توانند چنین خدمات ویژه‌ای را بپردازند. آژانس مشاوره معمولاً کنترل کامل توسعه و نگهداری محصول را نیز بر عهده دارد. اگر مجبور به ایجاد تغییرات باشید، باید از طریق آژانس اقدام کنید و این زمان اضافی می‌برد. 

دوم اینکه، Google Business Messages جایگزینی برای قابلیت پیام‌رسانی داخلی Google Business Profile است. به عنوان صاحبان کسب‌وکار، شما می‌توانید دکمه چت را در Google Business Profiles فعال کنید و هر زمان که در دسترس بودید پاسخ دهید. با این حال، هنگامی که Google Business Messages را پیاده‌سازی می‌کنید، پیام‌های ورودی شما به عامل زنده شما هدایت می‌شوند و شما توانایی چت مستقیم با مشتریان را در Google Business Profile یا با استفاده از برنامه Google My Business از دست می‌دهید. 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="راه حل چت زنده به صاحبان کسب‌وکار امکان می‌دهد مستقیماً با مشتریان صحبت کنند"/>

*اگر راه حل چت زنده فعال باشد، مشتریان می‌توانند روی «پیام به عامل زنده» کلیک کنند تا مستقیماً با صاحبان کسب‌وکار صحبت کنند.*
</center>


اگر همچنان می‌خواهید هنگام استفاده از Google Business Messages مستقیماً با مشتریان خود صحبت کنید، باید [از آژانس مشاوره بخواهید](https://developers.google.com/business-communications/business-messages/partners) که یک راه حل چت زنده ارائه دهد. اگر این ویژگی فعال باشد، مشتریان می‌توانند روی دکمه «پیام به عامل زنده» کلیک کنند و سپس شما می‌توانید به مکالمه بپیوندید و با مشتری چت کنید. از طرف عامل زنده، مکالمات در هر پلتفرمی که آژانس مشاوره برای ادغام انتخاب کرده است، انجام می‌شود؛ این می‌تواند از طریق متن، واتساپ، مسنجر، یک نرم‌افزار خدمات مشتری موجود مانند Zendesk، یا یک وب‌سایت یا برنامه تلفن سفارشی باشد.

اکنون ممکن است تعجب کنید که آیا راه حلی برای غلبه بر این موانع وجود دارد، اما همچنان از مزایای Google Business Messages بهره‌مند شوید؟ به همین دلیل می‌خواهیم جدیدترین راه حل خود، Near Me Messaging را به شما نشان دهیم و اینکه چگونه می‌توانید از چت Google Maps خود با آن نهایت استفاده را ببرید!

# 3. چت Google Maps با Near Me Messaging

Near Me Messaging هوش مصنوعی مکالمه‌ای پیشرفته را با Google Business Messages ادغام می‌کند و به مشتریان امکان می‌دهد در هر زمان از روز از طریق دکمه چت در پروفایل Google Maps شما با کسب‌وکار شما تماس بگیرند. به این ترتیب، شما می‌توانید بر مراقبت از کسب‌وکار خود تمرکز کنید در حالی که Near Me Messaging به سؤالات مشتریان شما رسیدگی می‌کند. آنچه Near Me Messaging را از خدمات مشابه متمایز می‌کند، زمان راه‌اندازی 5 دقیقه‌ای، سفارشی‌سازی خودکار و پشتیبانی چت زنده داخلی است.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging Google Business Messages را با دکمه چت در پروفایل Google Maps شما ادغام می‌کند."/>

*Near Me Messaging Google Business Messages را با دکمه چت در پروفایل Google Maps شما ادغام می‌کند.*
</center>

اول از همه، هنگامی که کسب‌وکارها Google Business Messages را ادغام می‌کنند، باید به یک آژانس مشاوره حرفه‌ای هزینه پرداخت کنند تا یک تجربه کاملاً سفارشی برای آنها از پایه ایجاد کند. اینها معمولاً گران هستند و زمان‌بر هستند. ما درک می‌کنیم که سرمایه‌گذاری معمول زمان و منابع برای استفاده از Google Business Messages مانعی برای ورود بسیاری از کسب‌وکارهای کوچک است. Near Me Messaging این محدودیت را با ارائه یک راه حل مقرون به صرفه برای SMEها حل می‌کند. شما می‌توانید یک عامل مجازی کارآمد را در کمتر از 5 دقیقه راه‌اندازی کنید. علاوه بر این، می‌توانید عامل مجازی خود را در هر زمان از وب‌سایت Near Me Messaging به‌طور مداوم به‌روزرسانی و سفارشی‌سازی کنید. تغییراتی که در سایت Near Me Messaging ایجاد می‌کنید، بلافاصله برای مشتریانی که با عامل شما تعامل دارند، اعمال می‌شود. 

علاوه بر این، هنگامی که دکمه چت را در Google Business Profile فعال می‌کنید، می‌توانید هر زمان که در دسترس بودید به مشتریان خود پاسخ دهید. اما هنگامی که Google Business Messages را ادغام می‌کنید، پیام‌های ورودی شما به عامل زنده شما هدایت می‌شوند و شما توانایی چت مستقیم با مشتریان را در Google Business Profile از دست می‌دهید. Near Me Messaging این محدودیت را با ارائه یک ویژگی عامل زنده بدون هزینه اضافی یا زمان راه‌اندازی حل می‌کند. با ویژگی عامل زنده، مشتریان می‌توانند در هر زمان درخواست انتقال به یک شخص واقعی را داشته باشند. هنگامی که درخواست عامل زنده را مشاهده می‌کنید، یا اگر می‌خواهید کنترل عامل مجازی را به دست بگیرید، می‌توانید به مکالمه بپیوندید و مستقیماً با مشتریان خود صحبت کنید. 

## مزایای Near Me Messaging

### 1. صرفه‌جویی در زمان و نیروی انسانی در ارائه خدمات عالی به مشتری

هنگامی که از Near Me Messaging استفاده می‌کنید، پاسخ به اساسی‌ترین سؤالات به‌طور خودکار بر اساس اطلاعات Google Business Profile شما انجام می‌شود. هرچه اطلاعات بیشتری در Google Business Profile شما باشد، عامل بهتر می‌تواند به سؤالات اساسی پاسخ دهد. و اگر می‌خواهید Google Business Profile خود را به‌روزرسانی کنید، می‌توانید تغییرات خود را با Near Me همگام‌سازی کنید تا پاسخ‌های ربات به‌طور خودکار به‌روزرسانی شوند. عامل مجازی همچنین پاسخ‌هایی را از نظرات کاربران مرتبط در پروفایل Google Maps شما که دارای رتبه ستاره‌ای بالا هستند، تولید می‌کند. فراتر از پاسخ‌های تولید شده خودکار، می‌توانید محتوای سفارشی بیشتری را از طریق سؤالات متداول و پایگاه دانش اضافه کنید، که در بخش بعدی با جزئیات بیشتری به آن خواهیم پرداخت. 

در عرض 5 دقیقه پس از ورود به وب‌سایت Near Me، می‌توانید عامل مجازی کارآمد خود را آزمایش کنید. عامل مجازی شما می‌تواند پاسخ‌های فوری به سؤالات تکراری مشتریان را 24/7 ارائه دهد. به این ترتیب، می‌توانید روابط خود را با مشتریان خود ایجاد و حفظ کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging یک ویژگی سؤالات متداول سفارشی برای شخصی‌سازی عامل مجازی ارائه می‌دهد"/>

*نمونه‌ای از ویژگی سؤالات متداول سفارشی ما.*
</center>

### 2. قابلیت‌های خودکار و قابل تنظیم.

Near Me Messaging علاوه بر تولید پاسخ از پروفایل کسب‌وکار و نظرات مشتریان شما، به قابلیت‌های سفارشی‌سازی خودکار مجهز است. برای شخصی‌سازی عامل مجازی خود، برخی از ویژگی‌های اساسی که می‌توانید سفارشی‌سازی کنید عبارتند از نام عامل مجازی، پیام خوش‌آمدگویی و لوگو. مهم‌تر از آن، می‌توانید پاسخ‌های سفارشی به سؤالات کاربران که مختص کسب‌وکار شما هستند، ایجاد کنید. این کار با ایجاد سؤالات متداول (FAQ) و افزودن اطلاعات بیشتر درباره کسب‌وکار شما (مانند متن وب‌سایت شما) به پایگاه دانش انجام می‌شود. 

پس از سفارشی‌سازی عامل خود، می‌توانید آن را به‌طور خصوصی آزمایش کنید تا زمانی که از عملکرد آن راضی باشید. هنگامی که آماده شدید، می‌توانید آن را مستقیماً از وب‌سایت Near Me Messaging به‌طور عمومی راه‌اندازی کنید. هنگامی که عامل مجازی خود را به‌طور عمومی راه‌اندازی می‌کنید، می‌توانید به‌طور مداوم عامل مجازی خود را بهبود بخشید، مانند افزودن سؤالات متداول بیشتر و تغییر پیام خوش‌آمدگویی. هر بار که عامل مجازی خود را بهبود می‌بخشید، فرصت دارید تغییرات را آزمایش کرده و سپس عامل را دوباره راه‌اندازی کنید. هنگامی که عامل را دوباره راه‌اندازی می‌کنید، تغییراتی که ایجاد کرده‌اید بلافاصله برای کاربران قابل مشاهده خواهد بود. به عنوان صاحبان کسب‌وکار، شما واقعاً آزادی و قدرت ساخت و بهبود عامل مجازی خود را بدون هزینه اضافی یا زمان ارتباط با تیم ما دارید. 

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="رابط کاربری صفحه نمای کلی Near Me Messaging که در آن صاحبان کسب‌وکار می‌توانند پیام خوش‌آمدگویی را تغییر داده و عامل مجازی خود را بهبود بخشند"/>

*رابط کاربری صفحه نمای کلی Near Me Messaging که در آن صاحبان کسب‌وکار می‌توانند پیام خوش‌آمدگویی را تغییر داده و عامل مجازی خود را بهبود بخشند.*
</center>

### 3. از طریق Near Me Analytics بینش کسب کنید.

Near Me Messaging همچنین یک ویژگی تجزیه و تحلیل ارائه می‌دهد تا به شما در کسب بینش در مورد عملکرد عامل مجازی، ساعات شلوغی و پیام‌های مشتری کمک کند. همچنین می‌توانید در مورد سؤالاتی که عامل مجازی شما نتوانسته است پاسخی برای آنها پیدا کند، بینش کسب کنید تا بتوانید آنها را به سؤالات متداول سفارشی اضافه کنید. در نهایت، می‌توانید در مورد پربحث‌ترین موضوعات از نظرات Google نیز اطلاعات بیشتری کسب کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics به شما بینش‌هایی در مورد پیام‌های مشتریان شما می‌دهد."/>

*Near Me Analytics به شما بینش‌هایی در مورد پیام‌های مشتریان شما می‌دهد.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics به شما امکان می‌دهد ساعات شلوغی عامل مجازی و سؤالات بی‌پاسخ خود را مشاهده کنید"/>

*Near Me Analytics به شما امکان می‌دهد ساعات شلوغی عامل مجازی و سؤالات بی‌پاسخ خود را مشاهده کنید.*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics به شما امکان می‌دهد پربحث‌ترین موضوعات را در نظرات Google پیدا کنید."/>

*Near Me Analytics به شما امکان می‌دهد پربحث‌ترین موضوعات را در نظرات Google پیدا کنید.*
</center>

### 4. نیازهای مشتری خود را از طریق تاریخچه مکالمه درک کنید.

Near Me Messaging به شما امکان می‌دهد مکالمات بین عامل مجازی و مشتریان خود را مشاهده کنید. این می‌تواند به شما کمک کند تا بدانید چه کسی به کسب‌وکار شما علاقه‌مند است و عامل مجازی شما چگونه عمل می‌کند. علاوه بر این، شما همچنین می‌توانید برچسب‌هایی ایجاد کنید، آنها را به مکالمات اعمال کنید و سپس بر اساس برچسب فیلتر کنید.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*ویژگی تاریخچه مکالمه Near Me Messaging.*
</center>

### 5. قابلیت چت مستقیم با مشتریان خود با ویژگی عامل زنده ما

Near Me Messaging همچنین به یک ویژگی عامل زنده مجهز است. مشتریان می‌توانند از طریق GBM روی «درخواست عامل زنده» کلیک کنند. هنگامی که مشتری درخواست عامل زنده می‌کند، صاحب کسب‌وکار از وب‌سایت Near Me یک اعلان دریافت می‌کند. 

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="مشتریان می‌توانند از طریق دکمه چت در پروفایل Google Maps درخواست عامل زنده کنند."/>

*مشتریان می‌توانند از طریق دکمه چت در پروفایل Google Maps درخواست عامل زنده کنند.*
</center>

صاحب کسب‌وکار می‌تواند در هر زمان به هر مکالمه‌ای بپیوندد، تا زمانی که کاربر در 30 روز گذشته پیامی ارسال کرده باشد. مشتری هنگام پیوستن/ترک عامل زنده به مکالمه، یک اعلان دریافت می‌کند. به محض اینکه عامل زنده مکالمه را ترک می‌کند، تمام پیام‌ها دوباره به عامل مجازی هدایت می‌شوند. از سایت Near Me، تمام رویدادهای مکالمه قابل مشاهده است - بنابراین می‌توانید ببینید چه زمانی کاربر درخواست عامل می‌کند و چه زمانی عامل می‌پیوندد/ترک می‌کند، علاوه بر تمام پیام‌های ربات، کاربر و عامل.


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="هنگامی که مشتری درخواست عامل زنده می‌کند، یک اعلان در وب‌سایت Near Me ظاهر می‌شود."/>

*هنگامی که مشتری درخواست عامل زنده می‌کند، یک اعلان در وب‌سایت Near Me ظاهر می‌شود.*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="رابط کاربری ویژگی عامل زنده Near Me."/>

*رابط کاربری ویژگی عامل زنده Near Me.*
</center>

برای شروع با Near Me Messaging، این راهنمای گام به گام را در مورد نحوه راه‌اندازی عامل مجازی خود با Near Me Messaging دنبال کنید!

## راهنمای گام به گام برای راه‌اندازی عامل مجازی خود با Near Me Messaging

### مرحله 1. از وب‌سایت Near Me Messaging بازدید کنید و با حسابی که برای Google Business Profile استفاده می‌کنید، وارد شوید.

به وب‌سایت Near Me Messaging بروید و روی دکمه *«ورود»* کلیک کنید. پس از ورود با حسابی که برای Google Business Profile استفاده می‌کنید، مطمئن شوید که تمام کادرهای موجود را علامت زده‌اید و به Seasalt AI اجازه راه‌اندازی عامل مجازی خود را داده‌اید. Seasalt.ai یک [شریک رسمی Google](https://developers.google.com/business-communications/business-messages/partners) است، بنابراین می‌توانید مطمئن باشید که ما از این مجوزها مسئولانه استفاده خواهیم کرد. **ما از این مجوزها برای دو عملکرد استفاده می‌کنیم: اول، برای دسترسی به اطلاعات از Google Business Profile شما تا عامل مجازی شما بتواند پاسخ‌های دقیق ارائه دهد، و دوم، تا بتوانیم عامل را به نمایندگی از شما در صفحه Google Maps کسب‌وکار شما راه‌اندازی کنیم.** 

ما هرگز از این مجوزها برای ویرایش یا حذف پروفایل کسب‌وکار شما استفاده نخواهیم کرد. ما همچنان نیاز داریم که شما به همه آنها اجازه دهید زیرا Google مجوزهای جداگانه برای *«مشاهده»*، *«ویرایش»* و *«حذف»* ارائه نمی‌دهد. ما فقط از مجوز *«مشاهده»* استفاده خواهیم کرد.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="با حسابی که برای Google Business Profile استفاده می‌کنید، وارد شوید"/>

*روی «ورود با Google» کلیک کنید و با حساب Google Business Profile خود وارد شوید.*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*اعطای مجوز به Seasalt AI به ما امکان می‌دهد عامل مجازی برند شما را به نمایندگی از شما در صفحه Google Maps شما به‌طور عمومی راه‌اندازی کنیم.*
</center>


### مرحله 2. عامل مجازی خود را بسازید.

پس از ورود و اعطای مجوز، تمام کسب‌وکارهایی را که با حساب Google Business Profile خود مدیریت می‌کنید، مشاهده خواهید کرد. اگر کسب‌وکار خود را نمی‌بینید، مطمئن شوید که از حساب Google Business Profile صحیح برای ورود استفاده می‌کنید. همچنین می‌توانید روی دکمه *«همگام‌سازی»* کلیک کنید تا کسب‌وکارهای خود را همگام‌سازی کنید. توجه داشته باشید که باید عامل مجازی را به‌صورت جداگانه برای هر یک از مکان‌های کسب‌وکار خود تنظیم کنید. برای تنظیم عامل مجازی خود، روی دکمه *«افزودن عامل»* در یکی از کسب‌وکارهای خود کلیک کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*کسب‌وکارهای مرتبط با Google Business Profile ما.*
</center>

Near Me Messaging با همگام‌سازی اطلاعات از Google Business Profile شما، شروع به ساخت عامل مجازی شما خواهد کرد. ساخت عامل مجازی شما باید کمتر از 5 دقیقه طول بکشد و می‌توانید پیشرفت را در حین تکمیل هر مرحله مشاهده کنید.


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*می‌توانید پیشرفت عامل مجازی خود را مشاهده کنید.*
</center>

### مرحله 3. عامل مجازی خود را به‌صورت خصوصی آزمایش کنید.

هنگامی که ساخت عامل شما به پایان رسید، کدهای QR روی صفحه نمایش شما ظاهر می‌شوند. از تلفن همراه خود برای اسکن کد QR و آزمایش عامل مجازی خود استفاده کنید. این هنوز یک نسخه خصوصی از عامل مجازی شما است و هنوز در پروفایل Google Maps شما ظاهر نخواهد شد. توجه داشته باشید که این عامل مجازی یک نسخه اولیه است که فقط از اطلاعات Google Business Profile شما همراه با نظرات مشتریان از Google Maps برای تولید پاسخ استفاده می‌کند. اگر آن را آزمایش کردید و احساس می‌کنید عامل مجازی شما نیاز به بهبود دارد، می‌توانید با ایجاد سؤالات متداول سفارشی، افزودن اطلاعات از وب‌سایت خود و تنظیم نظرات Google خود، پاسخ‌ها را به شدت بهبود بخشید. برای راهنمای دقیق‌تر در مورد سفارشی‌سازی، به راهنمای ما برای بهبود عامل مجازی خود نگاهی بیندازید. 

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*کدهای QR برای عامل مجازی خصوصی شما پس از اتمام ساخت عامل شما ظاهر می‌شوند.*
</center>

### مرحله 4. عامل مجازی خود را به‌طور عمومی راه‌اندازی کنید.


هنگامی که عامل مجازی خود را آزمایش کردید و از پاسخ‌ها راضی بودید، می‌توانید عامل مجازی خود را راه‌اندازی کنید. با راه‌اندازی عمومی عامل مجازی خود، عامل شما برای مشتریان شما در Google Maps در دسترس خواهد بود. در این وبلاگ، من شما را در مورد فرآیند اصلی راهنمایی خواهم کرد، اما می‌توانید برای اطلاعات دقیق‌تر به مستندات و ویدیوهای ما در مورد نحوه راه‌اندازی عامل مجازی خود در پروفایل Google Maps خود مراجعه کنید. 

ابتدا، به تب «عامل مجازی» بروید و مطمئن شوید که *نام عامل* و *تصویر آواتار عامل* دقیقاً همان چیزی است که می‌خواهید ظاهر شوند. هنگامی که *نام عامل* و *تصویر آواتار* توسط Google به عنوان بخشی از فرآیند راه‌اندازی تأیید شدند، **شما نمی‌توانید آنها را از طریق سایت Near Me تغییر دهید**. 

پس از تأیید جزئیات عامل خود، به تب *«راه‌اندازی عمومی»* بروید. روی دکمه *«تأیید»* کلیک کنید تا برند و مکان خود را با Google تأیید کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="برند و مکان خود را با Google تأیید کنید"/>

*با کلیک بر روی دکمه «تأیید»، برند و مکان شما با Google تأیید می‌شود.*
</center>

پس از تأیید برند و مکان شما، می‌توانید روی دکمه *«راه‌اندازی»* کلیک کنید تا عامل مجازی خود را به‌طور عمومی راه‌اندازی کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="راه‌اندازی عامل مجازی خود در دکمه چت پروفایل Google Maps شما"/>

*با کلیک بر روی دکمه «راه‌اندازی»، عامل مجازی شما در دکمه چت پروفایل Google Maps شما راه‌اندازی می‌شود.*
</center>

ممکن است تا چهار ساعت طول بکشد تا دکمه چت در Google Maps ظاهر شود. هنگامی که دکمه چت ظاهر شد، عامل مجازی شما برای چت با مشتریان شما در دسترس است. پس از راه‌اندازی عمومی، همچنان می‌توانید به‌طور مداوم تغییراتی ایجاد کرده و عامل مجازی خود را بیشتر سفارشی‌سازی کنید. هنگامی که تغییراتی ایجاد می‌کنید، می‌توانید به تب *«آزمایش خصوصی»* بروید تا آنها را قبل از عمومی کردن آزمایش کنید. هنگامی که از تغییرات راضی بودید، می‌توانید از صفحه *«راه‌اندازی عمومی»* روی *«راه‌اندازی مجدد»* کلیک کنید تا نسخه عمومی عامل مجازی خود را فوراً به‌روزرسانی کنید.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging Google Business Messages را با دکمه چت در پروفایل Google Maps شما ادغام می‌کند."/>

*پس از اتمام تغییرات/بهبودهای عامل مجازی خود، می‌توانید روی دکمه «راه‌اندازی مجدد» کلیک کنید.*
</center>


اکنون که روش‌های مختلف پیاده‌سازی چت Google Maps را می‌دانید، آیا می‌خواهید در مورد نحوه استفاده حداکثری از قابلیت چت خود بیشتر بدانید؟ 

ما [یک گروه فیس‌بوک برای صاحبان کسب‌وکار ایجاد کرده‌ایم تا نحوه بهینه‌سازی چت Google Maps خود را به اشتراک بگذارند و بحث کنند](https://www.facebook.com/groups/513092883608553). صاحبان کسب‌وکار می‌توانند از یکدیگر سؤال بپرسند، اطلاعات به اشتراک بگذارند و از آخرین رویدادها یا وبینارها در مورد بهینه‌سازی چت Google Maps مطلع شوند. اکنون بپیوندید تا از این فرصت نهایت استفاده را ببرید!




`;export{e as default};
