const e=`---
title: "Google Maps पर ग्राहकों से जुड़ने के लिए चैट सक्षम करने की अंतिम मार्गदर्शिका"
metatitle: "Google Maps पर चैट सक्षम करने की अंतिम मार्गदर्शिका"
date: 2022-04-29 20:39:13-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Ruli Setiawati
description: "इस ब्लॉग में, हम ग्राहकों से बेहतर ढंग से जुड़ने के लिए Google Maps चैट को सक्षम करने के तीन अलग-अलग तरीकों पर गौर करेंगे।"
weight: 1
tags:
  - NearMe
image: images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/ultimate_guide_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps-to-connect-with-customers/
url: /blog/enable-chat-on-google-maps-to-connect-with-customers/
---

*Google Maps चैट व्यवसायों के लिए ग्राहकों से जुड़ने का एक शानदार तरीका है। Google Maps चैट को सक्षम करने के विभिन्न तरीके हैं, Google Business Profile के साथ एक मैन्युअल तरीका, Google Business Messages के साथ एक स्वचालित तरीका, और एक जो Near Me Messaging के साथ दोनों दुनियाओं का सबसे अच्छा उपयोग करता है। यह ब्लॉग आपको इन तीन अलग-अलग तरीकों से Google Maps चैट को सक्षम करने के तरीके के बारे में बताएगा।*

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/comparison_table.jpg" alt="Google Business Profile, Google Business Messages, और Near Me Messaging के साथ Google Maps चैट को लागू करने के 3 अलग-अलग तरीकों की तुलना"/>

*Google Business Profile, Google Business Messages, और Near Me Messaging के साथ Google Maps चैट को लागू करने के 3 अलग-अलग तरीकों की तुलना।*
</center>

# विषय-सूची
- [Google Maps चैट क्या है और आपको इसे क्यों सक्षम करना चाहिए](#what-is-google-maps-chat-and-why-you-should-enable-it)
- [1. Google Business Profile के साथ Google Maps चैट](#1-google-maps-chat-with-google-business-profile)
    - [Google Business Profile के साथ Google Maps चैट को सक्षम करने के लिए चरण-दर-चरण मार्गदर्शिका](#step-1-sign-in-to-your-google-business-profile-account)
- [2. Google Business Messages के साथ Google Maps चैट](#2-google-maps-chat-with-google-business-messages)
    - [व्यवसाय Google Business Messages को कैसे लागू करते हैं](#how-businesses-implement-google-business-messages)
    - [कार्यान्वयन के लिए बाधाएँ](#barriers-for-implementation)
- [3. Near Me Messaging के साथ Google Maps चैट](#3-google-maps-chat-with-near-me-messaging)
    - [Near Me Messaging के लाभ](#benefits-of-near-me-messaging)
    - [Near Me Messaging के साथ Google Maps चैट को सक्षम करने के लिए चरण-दर-चरण मार्गदर्शिका](#step-by-step-guide-to-launching-your-virtual-agent-with-near-me-messaging)

# Google Maps चैट क्या है और आपको इसे क्यों सक्षम करना चाहिए

जब आप Google Maps ऐप का उपयोग करके किसी स्टोर, जिम, कार डीलरशिप, या अन्य व्यवसायों में जा रहे होते हैं, तो आपने देखा होगा कि उनमें से कुछ में एक चैट बटन एम्बेडेड होता है। यह चैट बटन आपको, एक व्यवसाय के मालिक के रूप में, अपने ग्राहकों के साथ संवाद करने की अनुमति देता है। आपके ग्राहक Google Maps या Google Search पर चैट बटन के माध्यम से सीधे आपसे संपर्क कर सकते हैं और आप जब भी उपलब्ध होंगे, जवाब दे पाएंगे। 

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/chat_button.png" alt="Google Maps प्रोफ़ाइल पर चैट सुविधा सक्षम के साथ एक व्यावसायिक लिस्टिंग"/>

*Google Maps ऐप से एक व्यावसायिक लिस्टिंग पर चैट सुविधा कैसी दिखती है।*
</center>

यह व्यवसाय मालिकों के लिए एक महत्वपूर्ण विशेषता क्यों है? सबसे पहले, आपका व्यवसाय अन्य व्यवसायों के बीच खड़ा होगा क्योंकि आप ग्राहकों के लिए आपसे जुड़ना आसान बना रहे हैं। वास्तव में, [72% ग्राहक](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) एक ऐसे स्टोर से उत्पाद खरीदने की अधिक संभावना रखते हैं जहाँ वे चैट मैसेजिंग के माध्यम से उत्पादों के बारे में पूछ सकते हैं। दूसरा, Google Maps उपभोक्ताओं के लिए स्थानीय जानकारी 411 बन गया है जब वे व्यावसायिक जानकारी खोज रहे होते हैं, सभी प्रकार की एकत्रित व्यावसायिक जानकारी (जैसे मेनू, आरक्षण, सुविधाएं, हाइलाइट्स, पूर्वावलोकन, चित्र) के लिए धन्यवाद। Google Maps [व्यवसायों के लिए नया ऑपरेटिंग सिस्टम](/blog/11-google-maps-replaces-google-my-business/) बन गया है।


अब, Google Maps चैट को सक्षम करने के विभिन्न तरीके हैं, Google Business Profile के साथ एक मैन्युअल तरीका, Google Business Messages के साथ एक स्वचालित तरीका, और एक जो Near Me Messaging के साथ दोनों दुनियाओं का सबसे अच्छा उपयोग करता है। हम आपको Google Business Profile और Google Business Messages के साथ Google Maps चैट का उपयोग करने के तरीके के बारे में बताएंगे, साथ ही इसके फायदे और नुकसान भी। अंत में, हम आपको Near Me Messaging के साथ Google Maps चैट का उपयोग करने के तरीके के बारे में बताएंगे। 

# 1. Google Business Profile के साथ Google Maps चैट

Google Business Profile एक ऐसा टूल है जो व्यवसायों को एक मुफ्त व्यावसायिक प्रोफ़ाइल या लिस्टिंग बनाने में सक्षम बनाता है जो Google Search और Google Maps जैसी Google सेवाओं में दिखाई देगी। आप Google के संसाधनों को [Google पर अपनी व्यावसायिक प्रोफ़ाइल जोड़ने या दावा करने के तरीके](https://support.google.com/business/answer/2911778?hl=en&co=GENIE.Platform%3DDesktop) के बारे में देख सकते हैं। Google Business Profile लिस्टिंग होने के फायदे में शामिल हैं:

- Google Search और Google Maps के माध्यम से ग्राहकों को आकर्षित करें और अधिक दृश्यता प्राप्त करें
- अपने व्यवसाय के बारे में अद्यतन जानकारी प्रदान करें जैसे व्यावसायिक घंटे और विशेषताएँ
- स्टार रेटिंग और समीक्षाओं के माध्यम से प्रतिष्ठा बनाएँ
- Google सेवाओं में अपने खोज प्रदर्शन के बारे में जानकारी प्राप्त करें

Google Business Profile के साथ, आप इन तीन आसान चरणों में चैट सुविधा को सक्षम कर सकते हैं:

## चरण 1. अपने Google Business Profile खाते में साइन इन करें। 

[Google Business Profile होमपेज](https://www.google.com/business/) पर जाएँ, और अपनी व्यावसायिक लिस्टिंग में साइन इन करें।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="एक बार व्यवसाय के मालिक के साइन इन करने के बाद Google Business Profile पेज"/>

*एक बार व्यवसाय के मालिक के साइन इन करने के बाद Google Business Profile पेज।*
</center>

## चरण 2. मैसेजिंग टैब पर जाएँ।

अगला चरण पृष्ठ के बाईं ओर *"Messages"* टैब पर क्लिक करना है। 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Google Business Profile पर मैसेज टैब का इंटरफ़ेस"/>

*मैसेज टैब का इंटरफ़ेस।*
</center>

## चरण 3. अपनी लिस्टिंग पर ‘चैट’ सुविधा को सक्रिय करें।

नीचे दिखाए अनुसार *"turn on chat"* बटन पर क्लिक करें।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "चैट चालू करें बटन पर क्लिक करने से चैट सुविधा सक्रिय हो जाएगी"/>

*चैट सुविधा को सक्रिय करने के लिए चैट चालू करें बटन पर क्लिक करें।*
</center>

जैसे ही आप *"Turn on chat"* बटन पर क्लिक करेंगे, एक पॉप-अप दिखाई देगा जो आपको सूचित करेगा कि आपकी चैट सक्रिय हो गई है। Google आपको आपकी नई सक्रिय चैट सुविधा के बारे में एक ई-मेल सूचना भी भेजेगा।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png"/>

*एक पॉप-अप पेज जो एक व्यवसाय के मालिक को सूचित करता है कि चैट सुविधा सक्रिय हो गई है।*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Google Maps पर नई सक्रिय चैट सुविधा के बारे में Google से ईमेल सूचना"/>

*नई सक्रिय “चैट” सुविधा के बारे में Google से ईमेल सूचना।*
</center>

## अपने ग्राहकों के संदेशों का जवाब देना

एक बार जब आप Google Business Profile मैसेजिंग सेवा को सक्रिय कर लेते हैं, तो आप अपनी लिस्टिंग पर एक चैट बटन देख सकते हैं और ग्राहक आपके व्यवसाय से किसी भी पूछताछ के लिए संपर्क कर पाएंगे। ध्यान रखें कि इस सुविधा का उपयोग करते समय, आपको यह सुनिश्चित करना होगा कि आप पूछताछ का जवाब देने के लिए उपलब्ध होंगे। ग्राहक आपकी औसत प्रतिक्रिया समय देख सकते हैं और यदि वे लंबी प्रतिक्रिया समय देखते हैं तो आपसे संपर्क करने से हतोत्साहित हो सकते हैं। यह महत्वपूर्ण है कि आप 24 घंटे के भीतर अपने ग्राहक संदेशों का जवाब दें। Google [Business Profile FAQ पेज](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google) के अनुसार, यदि आप एक दिन के भीतर जवाब नहीं देते हैं तो Google आपकी लिस्टिंग से "चैट" बटन हटा सकता है।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="Google Maps पर चैट सुविधा पर प्रतिक्रिया समय दिखाया गया है जब ग्राहक प्रश्न टाइप करने वाले होते हैं"/>

*Google Maps पर चैट सुविधा पर प्रतिक्रिया समय दिखाया गया है 
जब ग्राहक प्रश्न टाइप करने वाले होते हैं।*
</center>

अब जब आप जानते हैं कि Google Maps चैट Google Business Profile के साथ कैसे काम करती है, तो आप यह कैसे सुनिश्चित करते हैं कि आपका व्यवसाय बढ़ती ग्राहक पूछताछ की संख्या को बनाए रख सके? जैसे-जैसे ग्राहक आपसे चैट पर अधिक संपर्क करते हैं, आपके पास प्रत्येक चैट का जवाब देने के लिए समय और संसाधन नहीं हो सकते हैं, खासकर बंद घंटों के दौरान। इसके अलावा, अधिकांश पूछताछ दोहराव वाली हो सकती हैं। साथ ही, ग्राहक व्यवसायों से तत्काल जवाब की उम्मीद करते हैं। यदि व्यवसाय अपने ग्राहकों की जरूरतों को पूरा नहीं करते हैं, तो वे मौजूदा और संभावित ग्राहकों को खोने का जोखिम उठाते हैं। दोहराव वाली चैट का जवाब देने में बहुत समय और पैसा लगता है। 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="उपभोक्ता अपने प्रश्नों का उत्तर न मिलने और बहुत देर तक होल्ड पर फंसे रहने से निराश हैं"/>

*संयुक्त राज्य अमेरिका में मैसेजिंग के भविष्य को क्या चला रहा है? ([स्रोत](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="एक व्यवसाय के मालिक द्वारा संचार की कमी के कारण Google Maps पर एक परेशान ग्राहक द्वारा 1-स्टार रेटिंग।"/>

*एक व्यवसाय के मालिक द्वारा संचार की कमी के कारण एक परेशान ग्राहक द्वारा 1-स्टार रेटिंग।*
</center>


इसलिए हम आपको दूसरी विधि से परिचित कराना चाहते हैं, Google Business Messages के साथ Google Maps चैट का उपयोग करने का एक स्वचालित तरीका।


# 2. Google Business Messages के साथ Google Maps चैट

[Google Business Messages](https://businessmessages.google/) एक अगली पीढ़ी का संवादात्मक अनुभव है जो आपके ग्राहकों को वास्तविक समय में प्रतिक्रिया प्रदान करने की समस्या को हल करता है जब कोई मानव उपलब्ध नहीं होता है। जबकि Google Business Profile व्यवसाय मालिकों को Google Maps पर चैट बटन के माध्यम से ग्राहकों के साथ सीधे चैट करने देता है, Google Business Messages एक वर्चुअल एजेंट के साथ एकीकरण को सक्षम करके इसे एक कदम आगे ले जाता है। [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6) के अनुसार, एक वर्चुअल एजेंट "एक कंप्यूटर-जनित, एनिमेटेड, कृत्रिम बुद्धिमत्ता वाला वर्चुअल कैरेक्टर (आमतौर पर मानवशास्त्रीय उपस्थिति के साथ) है जो एक ऑनलाइन ग्राहक सेवा प्रतिनिधि के रूप में कार्य करता है"।


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="व्यवसाय के निर्णय लेने वाले मानते हैं कि Google के व्यावसायिक संदेश ग्राहकों के साथ बातचीत में सुधार करेंगे"/>

*इसे व्यक्तिगत बनाना: स्मार्ट संचार उपकरण व्यावसायिक परिणामों को कैसे चलाते हैं ([स्रोत](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf))।*
</center>


एक वर्चुअल एजेंट को अक्सर डिजिटल सहायक के रूप में संदर्भित किया जाता है। वर्चुअल एजेंट स्वचालित प्रतिक्रियाएं प्रदान करने के लिए प्राकृतिक भाषा प्रसंस्करण (NLP) नामक तकनीक का उपयोग करते हैं। वर्चुअल एजेंट प्रतिक्रिया समय को कम करके, 24/7 उपलब्धता प्रदान करके और ग्राहक अनुभव में सुधार करके आपके व्यवसाय को लाभ पहुंचा सकते हैं। इस तरह Google Business Messages आपको अपने ग्राहकों को उच्च-गुणवत्ता वाली स्वचालित प्रतिक्रियाएं प्रदान करने में मदद कर सकता है। 

Google Business Messages के अतिरिक्त लाभों में शामिल हैं:
- अपने ग्राहकों की पूछताछ का तत्काल जवाब दें
- उत्कृष्ट ग्राहक सेवा प्रदान करने में समय और पैसा बचाएं
- अपने ग्राहकों के साथ विश्वास बनाएँ

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages Google Maps पर चैट बटन में सीधे एक वर्चुअल एजेंट को एकीकृत करता है"/>

*Google Business Messages आपके चैट बटन में सीधे एक वर्चुअल एजेंट को एकीकृत करता है।*
</center>


## व्यवसाय Google Business Messages को कैसे लागू करते हैं

यह बेहतर ढंग से समझने के लिए कि Google Business Messages आपके व्यवसाय की कैसे मदद कर सकता है, आइए Walmart, Levi’s और Albertsons Companies के कुछ उदाहरणों पर एक नज़र डालते हैं।

### 1. Walmart

Walmart Business Messages को लागू करने वाली पहली कंपनियों में से एक है ([Google Blog](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/))। Google Business Messages के साथ, Walmart स्टोर के घंटों, उत्पादों, COVID-19 वैक्सीन और परीक्षण, पिक-अप और डिलीवरी विकल्पों, वापसी नीति, और बहुत कुछ के बारे में अद्यतन जानकारी प्रदान करता है। ग्राहक दिन के किसी भी समय तत्काल जवाब प्राप्त कर सकते हैं।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="ग्राहक Google Maps पर चैट बटन के माध्यम से Walmart से संपर्क कर सकते हैं (केवल मोबाइल)"/>

*ग्राहक Google Maps पर चैट बटन के माध्यम से Walmart से संपर्क कर सकते हैं (केवल मोबाइल)।*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="ग्राहक Walmart के वर्चुअल एजेंट से स्टोर के घंटों, उत्पादों, मास्क नीति, COVID-19 वैक्सीन, और बहुत कुछ के बारे में प्रश्न पूछ सकते हैं"/>

*ग्राहक स्टोर के घंटों, उत्पादों, मास्क नीति, COVID-19 वैक्सीन, और बहुत कुछ के बारे में प्रश्न पूछ सकते हैं।*
</center>

### 2. Levi’s


Levi’s एक कपड़ों की कंपनी है जो अपनी Levi’s डेनिम जींस के लिए जानी जाती है, जिसके 110 देशों में 3,100 खुदरा स्टोर हैं। महामारी के दौरान, Levi’s ने देखा कि खरीदार खरीद-पूर्व शोध में काफी समय बिताते हैं और स्टोर के घंटे अधिक बार बदल सकते हैं। Levi’s खरीदारों को वास्तविक ग्राहकों में बदलना और खरीदारों की पूछताछ का त्वरित जवाब देना चाहता था।

जून 2020 में, Levi’s ने स्टोर और उत्पादों के बारे में अद्यतन जानकारी प्रदान करके ग्राहक अनुभव को बेहतर बनाने के लक्ष्य के साथ Google Business Messages को लागू किया। Levi’s ने Google Business Messages की ग्राहकों को दिन के किसी भी समय मदद करने की क्षमता का लाभ उठाया और परिणामस्वरूप, 85% ग्राहक संतुष्टि (CSAT) स्कोर प्राप्त करने में सक्षम था। Levi’s ने यह भी देखा कि स्टोर से संबंधित 30 गुना अधिक प्रश्न हल किए गए थे। Levi’s ने Google Business Messages को कैसे लागू किया, इसके बारे में अधिक जानें [यहां](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf)।

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="ग्राहक Google Maps पर चैट बटन के माध्यम से Levi’s से संपर्क कर सकते हैं (केवल मोबाइल)"/>

*ग्राहक चैट बटन के माध्यम से Levi’s से संपर्क कर सकते हैं (केवल मोबाइल)।*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="ग्राहक Google Maps पर Levi’s के वर्चुअल एजेंट के साथ बातचीत करते समय Levi’s के उत्पादों को देख सकते हैं"/>

*ग्राहक Levi’s के वर्चुअल एजेंट के साथ बातचीत करते समय Levi’s के उत्पादों को देख सकते हैं।*
</center>


### 3. Albertsons Companies

Albertsons Co. के पास संयुक्त राज्य अमेरिका में कई फार्मेसियां हैं जिनमें Safeway, Jewel-Osco, Vons, Albertsons, Shaw’s, और बहुत कुछ शामिल हैं। 2020 के अंत में, COVID-19 टीकों के प्रारंभिक रिलीज के दौरान, टीकों के लिए ऑनलाइन खोजों में वृद्धि हुई थी। वैक्सीन पात्रता, नियुक्तियों और लोगों को टीके कहाँ मिल सकते हैं, इसके बारे में अधिक प्रश्न थे। Albertsons Co. ने पात्रता मानदंड, नियुक्तियों, उपलब्धता, और बहुत कुछ के बारे में अद्यतन जानकारी प्रदान करने के लिए Google Business Messages को सक्रिय करने का निर्णय लिया। परिणामस्वरूप, वे आने वाली कॉलों की संख्या को कम करने, संभावित गलत सूचना को रोकने और ग्राहकों को 24/7 मदद करने में सक्षम थे। 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="ग्राहक Albertsons Co. के वर्चुअल एजेंट से सीधे वैक्सीन पात्रता के बारे में जानकारी प्राप्त कर सकते हैं और अपॉइंटमेंट बुक कर सकते हैं"/>

*ग्राहक वैक्सीन पात्रता के बारे में जानकारी प्राप्त कर सकते हैं और अपॉइंटमेंट बुक कर सकते हैं।*
</center>

Google Business Messages दोहराव वाली पूछताछ का जवाब देने, ग्राहकों के साथ संबंध बनाने और समग्र ग्राहक अनुभव को बेहतर बनाने का एक शानदार तरीका है।


## कार्यान्वयन के लिए बाधाएँ

Google Business Messages के सामान्य कार्यान्वयन में दो मुख्य सीमाएँ हैं जैसा कि ऊपर देखा गया है। 

सबसे पहले, [एक उत्कृष्ट वर्चुअल एजेंट बनाना और बनाए रखना एक सरल कार्य नहीं है](https://developers.google.com/business-communications/business-messages/guides/how-it-works); इसके लिए संवादात्मक AI के उन्नत ज्ञान और महत्वपूर्ण विकास समय की आवश्यकता होती है। Google Business Messages का उपयोग करने वाले व्यवसायों को एक पेशेवर परामर्श एजेंसी को भुगतान करना होगा ताकि वे उनके लिए पूरी तरह से अनुकूलित अनुभव बना सकें। ये आमतौर पर महंगे होते हैं और इसमें महीनों लग सकते हैं। Levi’s, Walmart, और Albertsons Companies जैसे बड़े उद्यम ऐसे विशेष सेवा का खर्च उठा सकते हैं। परामर्श एजेंसी आमतौर पर उत्पाद के विकास और रखरखाव पर भी पूरी तरह से नियंत्रण रखती है। यदि आपको परिवर्तन करने हैं, तो आपको एजेंसी के माध्यम से जाना होगा और इसमें अतिरिक्त समय लगता है। 

दूसरा, Google Business Messages Google Business Profile में निर्मित मैसेजिंग क्षमता का एक प्रतिस्थापन है। व्यवसाय के मालिकों के रूप में, आपके पास Google Business Profiles पर चैट बटन को सक्षम करने और जब भी आप उपलब्ध हों, जवाब देने की क्षमता होती है। हालांकि, जब आप Google Business Messages को लागू करते हैं, तो आपके आने वाले संदेश आपके लाइव एजेंट को रूट किए जाते हैं, और आप Google Business Profile के भीतर या Google My Business ऐप का उपयोग करके ग्राहकों के साथ सीधे चैट करने की अपनी क्षमता खो देते हैं। 

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="लाइव-चैट समाधान व्यवसाय मालिकों को ग्राहकों से सीधे बात करने की अनुमति देता है"/>

*यदि लाइव-चैट समाधान सक्षम है, तो ग्राहक व्यवसाय मालिकों से सीधे बात करने के लिए “Message a live agent” पर क्लिक कर पाएंगे।*
</center>


यदि आप Google Business Messages का उपयोग करते हुए भी अपने ग्राहकों से सीधे बात करना चाहते हैं, तो आपको [परामर्श एजेंसी से लाइव-चैट समाधान प्रदान करने के लिए कहना होगा](https://developers.google.com/business-communications/business-messages/partners)। यदि यह सुविधा सक्षम है, तो ग्राहक “Message a live agent” बटन पर क्लिक कर सकते हैं, और फिर आप बातचीत में शामिल हो पाएंगे और ग्राहक के साथ चैट कर पाएंगे। लाइव एजेंट की ओर से, बातचीत उस प्लेटफ़ॉर्म पर होगी जिसे परामर्श एजेंसी ने एकीकृत करने के लिए चुना है; यह टेक्स्ट, WhatsApp, Messenger, Zendesk जैसे मौजूदा ग्राहक सेवा सॉफ़्टवेयर, या एक कस्टम-निर्मित वेबसाइट या फ़ोन ऐप के माध्यम से हो सकता है।

अब आप सोच रहे होंगे, क्या इन बाधाओं को दूर करने का कोई समाधान है लेकिन फिर भी Google Business Messages के लाभ प्राप्त करें? इसलिए हम आपको अपना नवीनतम समाधान, Near Me Messaging दिखाना चाहते हैं, और आप इसके साथ अपनी Google Maps चैट का अधिकतम लाभ कैसे उठा सकते हैं!

# 3. Near Me Messaging के साथ Google Maps चैट

Near Me Messaging Google Business Messages के साथ अत्याधुनिक संवादात्मक AI को एकीकृत करता है, जिससे ग्राहक आपके Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से दिन के किसी भी समय आपके व्यवसाय तक पहुँच सकते हैं। इस तरह, आप अपने व्यवसाय की देखभाल पर ध्यान केंद्रित कर सकते हैं जबकि Near Me Messaging आपकी ग्राहक पूछताछ को संभालता है। Near Me Messaging को समान सेवाओं से अलग करने वाली बात 5 मिनट का सेटअप समय, स्व-सेवा अनुकूलन और अंतर्निहित लाइव चैट समर्थन है।

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging Google Business Messages को आपके Google Maps प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।"/>

*Near Me Messaging Google Business Messages को आपके Google Maps प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।*
</center>

सबसे पहले, जब व्यवसाय Google Business Messages को एकीकृत करते हैं, तो उन्हें एक पेशेवर परामर्श एजेंसी को भुगतान करना होगा ताकि वे उनके लिए पूरी तरह से अनुकूलित अनुभव बना सकें। ये आमतौर पर महंगे होते हैं और इसमें समय लगता है। हम समझते हैं कि Google Business Messages का लाभ उठाने के लिए विशिष्ट समय और संसाधन निवेश कई छोटे व्यवसायों के लिए एक बाधा है। Near Me Messaging SMEs के लिए एक किफायती समाधान प्रदान करके इस सीमा को हल करता है। आप 5 मिनट से भी कम समय में एक कार्यशील वर्चुअल एजेंट प्राप्त कर सकते हैं। इसके अलावा, आप Near Me Messaging वेबसाइट से कभी भी अपने वर्चुअल एजेंट को लगातार अपडेट और अनुकूलित कर सकते हैं। Near Me Messaging साइट पर आपके द्वारा किए गए परिवर्तन आपके एजेंट के साथ बातचीत करने वाले ग्राहकों के लिए तुरंत प्रभावी होते हैं। 

इसके अतिरिक्त, जब आप Google Business Profile पर चैट बटन को सक्षम करते हैं, तो आपके पास जब भी आप उपलब्ध हों, अपने ग्राहकों को जवाब देने की क्षमता होती है। लेकिन जब आप Google Business Messages को लागू करते हैं, तो आपके आने वाले संदेश आपके लाइव एजेंट को रूट किए जाते हैं, और आप Google Business Profile के भीतर ग्राहकों के साथ सीधे चैट करने की अपनी क्षमता खो देते हैं। Near Me Messaging बिना किसी अतिरिक्त लागत या सेटअप समय के लाइव एजेंट सुविधा प्रदान करके इस सीमा को हल करता है। लाइव एजेंट सुविधा के साथ, ग्राहक किसी भी समय एक वास्तविक व्यक्ति को स्थानांतरित करने का अनुरोध कर सकते हैं। जब आप एक लाइव एजेंट अनुरोध देखते हैं, या यदि आप वर्चुअल एजेंट के लिए पदभार संभालना चाहते हैं, तो आप बातचीत में शामिल हो सकते हैं और सीधे अपने ग्राहकों से बात कर सकते हैं। 

## Near Me Messaging के लाभ

### 1. उत्कृष्ट ग्राहक सेवा प्रदान करने में समय और जनशक्ति बचाता है

जब आप Near Me Messaging का उपयोग करते हैं, तो Google Business Profile से जानकारी के आधार पर सबसे बुनियादी प्रश्नों के जवाब स्वचालित रूप से संभाले जाते हैं। आपके Google Business Profile पर जितनी अधिक जानकारी होगी, एजेंट बुनियादी प्रश्नों का उतनी ही बेहतर तरीके से जवाब दे पाएगा। और यदि आप कभी भी अपने Google Business Profile को अपडेट करना चाहते हैं, तो आप अपने परिवर्तनों को Near Me के साथ सिंक कर सकते हैं ताकि बॉट प्रतिक्रियाओं को स्वचालित रूप से अपडेट किया जा सके। वर्चुअल एजेंट आपके Google Maps प्रोफ़ाइल पर प्रासंगिक उपयोगकर्ता समीक्षाओं से भी प्रतिक्रियाएं उत्पन्न करेगा जिनकी उच्च स्टार रेटिंग है। स्वचालित रूप से उत्पन्न प्रतिक्रियाओं के अलावा, आप FAQ और ज्ञान आधार के माध्यम से अधिक कस्टम सामग्री जोड़ सकते हैं, जिस पर हम अगले खंड में अधिक विस्तार से चर्चा करेंगे। 

Near Me वेबसाइट में लॉग इन करने के 5 मिनट के भीतर, आप अपने स्वयं के कार्यशील वर्चुअल एजेंट का परीक्षण कर सकते हैं। आपका वर्चुअल एजेंट ग्राहकों की दोहराव वाली पूछताछ का 24/7 तत्काल जवाब दे सकता है। इस तरह, आप अपने ग्राहकों के साथ अपने संबंधों का निर्माण और रखरखाव कर सकते हैं।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging वर्चुअल एजेंट को वैयक्तिकृत करने के लिए एक कस्टम FAQ सुविधा प्रदान करता है"/>

*हमारी कस्टम FAQ सुविधा से उदाहरण।*
</center>

### 2. स्व-सेवा और अनुकूलन योग्य क्षमताएँ।

आपके व्यावसायिक प्रोफ़ाइल और ग्राहक समीक्षाओं से प्रतिक्रियाएँ उत्पन्न करने के अलावा, Near Me Messaging स्व-सेवा अनुकूलन क्षमताओं से सुसज्जित है। अपने वर्चुअल एजेंट को वैयक्तिकृत करने के लिए, आप वर्चुअल एजेंट का नाम, स्वागत संदेश और लोगो जैसी कुछ बुनियादी सुविधाओं को अनुकूलित कर सकते हैं। इससे भी महत्वपूर्ण बात यह है कि आप उपयोगकर्ता प्रश्नों के लिए कस्टम प्रतिक्रियाएँ तैयार कर सकते हैं जो आपके व्यवसाय के लिए विशिष्ट हैं। यह अक्सर पूछे जाने वाले प्रश्न (FAQ) बनाकर और अपने व्यवसाय के बारे में अधिक जानकारी (जैसे आपकी वेबसाइट से टेक्स्ट) को ज्ञान आधार में जोड़कर किया जाता है। 

अपने एजेंट को अनुकूलित करने के बाद, आपके पास प्रदर्शन से संतुष्ट होने तक इसे निजी तौर पर परीक्षण करने की क्षमता होती है। जब आप तैयार हों, तो आप इसे सीधे Near Me Messaging वेबसाइट से सार्वजनिक रूप से लॉन्च कर सकते हैं। एक बार जब आप अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च कर देते हैं, तो आपके पास अपने वर्चुअल एजेंट को लगातार बेहतर बनाने की क्षमता होती है जैसे कि अधिक FAQ जोड़ना और स्वागत संदेश बदलना। हर बार जब आप अपने वर्चुअल एजेंट को बेहतर बनाते हैं, तो आपके पास परिवर्तनों का परीक्षण करने और फिर एजेंट को फिर से लॉन्च करने का अवसर होता है। जब आप एजेंट को फिर से लॉन्च करते हैं, तो आपके द्वारा किए गए परिवर्तन उपयोगकर्ताओं को तुरंत दिखाई देंगे। व्यवसाय के मालिकों के रूप में, आपके पास वास्तव में हमारी टीम के साथ अतिरिक्त लागत या संचार समय के बिना अपने वर्चुअल एजेंट को बनाने और बेहतर बनाने की स्वतंत्रता और शक्ति है। 

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/3-overview-page.png" alt="Near Me Messaging अवलोकन पृष्ठ का इंटरफ़ेस जहाँ व्यवसाय के मालिक स्वागत संदेश को संशोधित कर सकते हैं और अपने वर्चुअल एजेंट को बेहतर बना सकते हैं"/>

*Near Me Messaging अवलोकन पृष्ठ का इंटरफ़ेस जहाँ व्यवसाय के मालिक स्वागत संदेश को संशोधित कर सकते हैं और अपने वर्चुअल एजेंट को बेहतर बना सकते हैं।*
</center>

### 3. Near Me Analytics के माध्यम से जानकारी प्राप्त करें।

Near Me Messaging आपको अपने वर्चुअल एजेंट के प्रदर्शन, सबसे व्यस्त घंटों और ग्राहक संदेशों के बारे में जानकारी प्राप्त करने में मदद करने के लिए एक विश्लेषण सुविधा भी प्रदान करता है। आप उन प्रश्नों के बारे में भी जानकारी प्राप्त कर सकते हैं जिनके लिए आपका वर्चुअल एजेंट जवाब नहीं ढूंढ सका ताकि आप उन्हें कस्टम FAQ में जोड़ सकें। अंत में, आप Google समीक्षाओं से सबसे अधिक उल्लिखित विषयों के बारे में भी अधिक जान सकते हैं।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/4-analytics-1.png" alt="Near Me Analytics आपको आपके ग्राहक संदेशों के बारे में जानकारी देता है।"/>

*Near Me Analytics आपको आपके ग्राहक संदेशों के बारे में जानकारी देता है।*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/5-analytics-2.png" alt="Near Me Analytics आपको अपने वर्चुअल एजेंट के सबसे व्यस्त घंटों और अनुत्तरित प्रश्नों को देखने की अनुमति देता है"/>

*Near Me Analytics आपको अपने वर्चुअल एजेंट के सबसे व्यस्त घंटों और अनुत्तरित प्रश्नों को देखने की अनुमति देता है।*
</center>

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/6-analytics-3.png" alt="Near Me Analytics आपको Google समीक्षाओं में सबसे अधिक उल्लिखित विषयों को खोजने की अनुमति देता है।"/>

*Near Me Analytics आपको Google समीक्षाओं में सबसे अधिक उल्लिखित विषयों को खोजने की अनुमति देता है।*
</center>

### 4. बातचीत के इतिहास के माध्यम से अपने ग्राहक की जरूरतों को समझें।

Near Me Messaging आपको अपने वर्चुअल एजेंट और आपके ग्राहकों के बीच बातचीत देखने की अनुमति देता है। यह आपको यह जानने में मदद कर सकता है कि आपके व्यवसाय में कौन रुचि रखता है और आपका वर्चुअल एजेंट कैसा प्रदर्शन कर रहा है। इसके अतिरिक्त, आपके पास लेबल बनाने, उन्हें बातचीत पर लागू करने और फिर लेबल के आधार पर फ़िल्टर करने की क्षमता भी है।

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/7-conversation-history.png"/>

*Near Me Messaging बातचीत इतिहास सुविधा।*
</center>

### 5. हमारी लाइव एजेंट सुविधा के साथ अपने ग्राहकों से सीधे चैट करने की क्षमता

Near Me Messaging एक लाइव एजेंट सुविधा से भी सुसज्जित है। ग्राहक GBM के माध्यम से “request a live agent” पर क्लिक कर सकते हैं। जब कोई ग्राहक लाइव एजेंट का अनुरोध करता है, तो मालिक को Near Me वेबसाइट से एक सूचना प्राप्त होगी। 

<center>
<img height="500" src="/images/blog/12-near-me-messaging-complements-google-business-messages/8-live-agent-request.png" alt="ग्राहक Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से लाइव एजेंट का अनुरोध कर सकते हैं।"/>

*ग्राहक Google Maps प्रोफ़ाइल पर चैट बटन के माध्यम से लाइव एजेंट का अनुरोध कर सकते हैं।*
</center>

मालिक किसी भी समय किसी भी बातचीत में शामिल हो सकता है जब तक उपयोगकर्ता ने पिछले 30 दिनों के भीतर एक संदेश भेजा हो। जब लाइव एजेंट बातचीत में शामिल होता/छोड़ता है तो ग्राहक को एक सूचना प्राप्त होगी। जैसे ही लाइव एजेंट बातचीत छोड़ता है, सभी संदेश फिर से वर्चुअल एजेंट को रूट किए जाएंगे। Near Me साइट से, सभी बातचीत की घटनाओं को देखा जा सकता है - ताकि आप देख सकें कि उपयोगकर्ता कब एजेंट का अनुरोध करता है और एजेंट कब शामिल होता/छोड़ता है, साथ ही बॉट, उपयोगकर्ता और एजेंट के सभी संदेश भी।


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/9-live-agent-notif.png" alt="जब कोई ग्राहक लाइव एजेंट का अनुरोध करेगा तो Near Me वेबसाइट पर एक सूचना पॉप अप होगी।"/>

*जब कोई ग्राहक लाइव एजेंट का अनुरोध करेगा तो Near Me वेबसाइट पर एक सूचना पॉप अप होगी।*
</center>


<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/10-live-agent-convo.png" alt="Near Me लाइव एजेंट सुविधा का इंटरफ़ेस।"/>

*Near Me लाइव एजेंट सुविधा का इंटरफ़ेस।*
</center>

Near Me Messaging के साथ आरंभ करने के लिए, Near Me Messaging के साथ अपने वर्चुअल एजेंट को लॉन्च करने के तरीके के बारे में इस चरण-दर-चरण मार्गदर्शिका का पालन करें!

## Near Me Messaging के साथ अपने वर्चुअल एजेंट को लॉन्च करने के लिए चरण-दर-चरण मार्गदर्शिका

### चरण 1. Near Me Messaging वेबसाइट पर जाएँ और उस खाते से साइन इन करें जिसका उपयोग आप Google Business Profile के लिए करते हैं।

Near Me Messaging वेबसाइट पर जाएँ और *“Sign in”* बटन पर क्लिक करें। एक बार जब आप उस खाते से साइन इन कर लेते हैं जिसका उपयोग आप Google Business Profile के लिए करते हैं, तो सुनिश्चित करें कि आपने सभी उपलब्ध बॉक्सों को चेक किया है और Seasalt AI को अपने वर्चुअल एजेंट को लॉन्च करने की अनुमति दी है। Seasalt.ai एक [आधिकारिक Google पार्टनर](https://developers.google.com/business-communications/business-messages/partners) है, इसलिए आप निश्चिंत हो सकते हैं कि हम इन अनुमतियों का जिम्मेदारी से उपयोग करेंगे। **हम इन अनुमतियों का उपयोग दो कार्यों के लिए कर रहे हैं: पहला, आपके Google Business Profile से जानकारी तक पहुँचने के लिए ताकि आपका वर्चुअल एजेंट सटीक प्रतिक्रियाएँ प्रदान कर सके, और दूसरा ताकि हम आपकी ओर से आपके व्यवसाय के Google Maps पेज पर एजेंट को लॉन्च कर सकें।** 

हम इन अनुमतियों का उपयोग कभी भी आपकी व्यावसायिक प्रोफ़ाइल को संपादित या हटाने के लिए नहीं करेंगे। हमें अभी भी आपको उन सभी को अनुमति देने की आवश्यकता है क्योंकि Google *“देखने”*, *“संपादित करने”* और *“हटाने”* के लिए अलग-अलग अनुमतियाँ प्रदान नहीं करता है। हम केवल *“देखने”* की अनुमति का उपयोग करेंगे।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/2-sign-in.png" alt="उस खाते से साइन इन करें जिसका उपयोग आप Google Business Profile के लिए करते हैं"/>

*“Sign in with Google” पर क्लिक करें और अपने Google Business Profile खाते से साइन इन करें।*
</center>

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/3-permissions.png"/>

*Seasalt AI को अनुमतियाँ प्रदान करने से हमें आपकी ओर से आपके ब्रांड के वर्चुअल एजेंट को आपके Google Maps पेज पर सार्वजनिक रूप से लॉन्च करने की क्षमता मिलती है।*
</center>


### चरण 2. अपना वर्चुअल एजेंट बनाएँ।

एक बार जब आप साइन इन कर लेते हैं और अनुमति दे देते हैं, तो आपको वे सभी व्यवसाय दिखाई देंगे जिन्हें आप अपने Google Business Profile खाते से प्रबंधित करते हैं। यदि आपको अपना व्यवसाय दिखाई नहीं देता है, तो सुनिश्चित करें कि आप लॉग इन करने के लिए सही Google Business Profile खाते का उपयोग कर रहे हैं। आप अपने व्यवसायों को सिंक्रनाइज़ करने के लिए *“Sync”* बटन पर भी क्लिक कर सकते हैं। ध्यान दें कि आपको अपने प्रत्येक व्यावसायिक स्थान के लिए व्यक्तिगत रूप से वर्चुअल एजेंट सेट करना होगा। अपना वर्चुअल एजेंट सेट करने के लिए, अपने किसी एक व्यवसाय पर *“add agent”* बटन पर क्लिक करें।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/4-business-locations.png"/>

*हमारे Google Business Profile से जुड़े व्यवसाय।*
</center>

Near Me Messaging आपके Google Business Profile से जानकारी को सिंक्रनाइज़ करके आपके वर्चुअल एजेंट का निर्माण शुरू कर देगा। आपके वर्चुअल एजेंट को बनाने में 5 मिनट से भी कम समय लगना चाहिए, और आप प्रत्येक चरण के पूरा होने पर प्रगति देख सकते हैं।


<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/5-virtual-agent-building.png"/>

*आप अपने वर्चुअल एजेंट की प्रगति देख सकते हैं।*
</center>

### चरण 3. अपने वर्चुअल एजेंट का निजी परीक्षण करें।

जब आपका एजेंट बनाना समाप्त हो जाता है, तो आपकी स्क्रीन पर QR कोड दिखाई देंगे। QR कोड को स्कैन करने और अपने वर्चुअल एजेंट का परीक्षण करने के लिए अपने मोबाइल फ़ोन का उपयोग करें। यह अभी भी आपके वर्चुअल एजेंट का एक निजी संस्करण है और अभी तक आपके Google Maps प्रोफ़ाइल पर दिखाई नहीं देगा। ध्यान दें कि यह वर्चुअल एजेंट एक प्रारंभिक संस्करण है जो केवल आपके Google Business Profile से जानकारी के साथ-साथ Google Maps से ग्राहक समीक्षाओं का उपयोग करके प्रतिक्रियाएँ उत्पन्न करता है। यदि आप इसका परीक्षण करते हैं और आपको लगता है कि आपके वर्चुअल एजेंट को कुछ सुधारों की आवश्यकता है, तो आप कस्टम FAQ बनाकर, अपनी वेबसाइट से जानकारी जोड़कर, और अपनी Google समीक्षाओं को क्यूरेट करके प्रतिक्रियाओं में काफी सुधार कर सकते हैं। अनुकूलन पर अधिक विस्तृत जानकारी के लिए, अपने वर्चुअल एजेंट को बेहतर बनाने के लिए हमारी मार्गदर्शिका देखें। 

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/6-agent-built.png" alt=""/>

*आपके एजेंट के निर्माण समाप्त होने के बाद आपके निजी वर्चुअल एजेंट के लिए QR कोड दिखाई देंगे।*
</center>

### चरण 4. अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करें।


एक बार जब आप अपने वर्चुअल एजेंट का परीक्षण कर लेते हैं और प्रतिक्रियाओं से संतुष्ट हो जाते हैं, तो आप अपने वर्चुअल एजेंट को लॉन्च कर सकते हैं। अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करके, आपका एजेंट Google Maps पर आपके ग्राहकों के लिए उपलब्ध होगा। इस ब्लॉग में, मैं आपको बुनियादी प्रक्रिया के बारे में बताऊंगा, लेकिन आप अपने Google Maps प्रोफ़ाइल पर अपने वर्चुअल एजेंट को लॉन्च करने के तरीके के बारे में अधिक विस्तृत जानकारी के लिए हमारे दस्तावेज़ और वीडियो देख सकते हैं। 

सबसे पहले, “Virtual Agent” टैब पर जाएँ और सुनिश्चित करें कि आपका *एजेंट नाम* और *एजेंट अवतार छवि* बिल्कुल वैसे ही हैं जैसे आप उन्हें दिखाना चाहते हैं। एक बार जब *एजेंट नाम* और *अवतार छवि* को Google द्वारा लॉन्च प्रक्रिया के हिस्से के रूप में सत्यापित कर लिया जाता है, तो **आप उन्हें Near Me साइट के माध्यम से संशोधित नहीं कर पाएंगे**। 

एक बार जब आप अपने एजेंट विवरण की पुष्टि कर लेते हैं, तो *“Public Launch”* टैब पर जाएँ। Google के साथ अपने ब्रांड और स्थान को सत्यापित करने के लिए *“Verify”* बटन पर क्लिक करें।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/7-verification.png" alt="Google के साथ अपने ब्रांड और स्थान को सत्यापित करें"/>

*“Verify” बटन पर क्लिक करने से Google के साथ आपके ब्रांड और स्थान का सत्यापन होगा।*
</center>

एक बार जब आपका ब्रांड और स्थान सत्यापित हो जाता है, तो आप अपने वर्चुअल एजेंट को सार्वजनिक रूप से लॉन्च करने के लिए *“Launch”* बटन पर क्लिक कर सकते हैं।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/8-launch.png" alt="अपने Google Maps प्रोफ़ाइल के चैट बटन पर अपने वर्चुअल एजेंट को लॉन्च करना"/>

*“Launch” बटन पर क्लिक करने से आपका वर्चुअल एजेंट आपके Google Maps प्रोफ़ाइल पर चैट बटन पर लॉन्च हो जाएगा।*
</center>

चैट बटन को Google Maps पर दिखाई देने में चार घंटे तक लग सकते हैं। एक बार जब चैट बटन दिखाई देता है, तो आपका वर्चुअल एजेंट आपके ग्राहकों के साथ चैट करने के लिए उपलब्ध होता है। सार्वजनिक लॉन्च के बाद, आप अभी भी लगातार परिवर्तन कर सकते हैं और अपने वर्चुअल एजेंट को और अनुकूलित कर सकते हैं। जब आप परिवर्तन करते हैं, तो आप उन्हें सार्वजनिक करने से पहले उनका परीक्षण करने के लिए *“Private Test”* टैब पर जा सकते हैं। एक बार जब आप परिवर्तनों से खुश हो जाते हैं, तो आप अपने वर्चुअल एजेंट के सार्वजनिक संस्करण को तुरंत अपडेट करने के लिए *“Public Launch”* पेज से *“Re-Launch”* पर क्लिक कर सकते हैं।

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging Google Business Messages को आपके Google Maps प्रोफ़ाइल पर चैट बटन के साथ एकीकृत करता है।"/>

*अपने वर्चुअल एजेंट में परिवर्तन/सुधार करने के बाद आप "Re-Launch" बटन पर क्लिक कर सकते हैं।*
</center>


अब जब आप Google Maps चैट को लागू करने के विभिन्न तरीकों को जानते हैं, तो क्या आप अपनी चैट सुविधा का अधिकतम लाभ उठाने के तरीके के बारे में अधिक जानना चाहते हैं? 

हमने [व्यवसाय मालिकों के लिए एक Facebook समूह बनाया है ताकि वे अपनी Google Maps चैट को अनुकूलित करने के तरीके को साझा और चर्चा कर सकें](https://www.facebook.com/groups/513092883608553)। व्यवसाय के मालिक एक-दूसरे से प्रश्न पूछ सकते हैं, जानकारी साझा कर सकते हैं, और Google Maps चैट को अनुकूलित करने के बारे में नवीनतम घटनाओं या वेबिनार के बारे में सूचित रह सकते हैं। इस अवसर का पूरा लाभ उठाने के लिए अभी शामिल हों!`;export{e as default};
