const e=`---
title: "Полное руководство по включению чата в Google Картах для связи с клиентами"
metatitle: "Полное руководство по включению чата в Google Картах"
date: 2022-04-29 20:39:13-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Ruli Setiawati
description: "В этом блоге мы рассмотрим три различных метода включения чата Google Карт, чтобы лучше общаться с клиентами."
tags:
  - NearMe
image: images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/ultimate_guide_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps-to-connect-with-customers/
url: /blog/enable-chat-on-google-maps-to-connect-with-customers/
---

*Чат Google Карт — отличный способ для компаний общаться с клиентами. Существуют различные способы включения чата Google Карт: ручной с помощью Google Business Profile, автоматический с помощью Google Business Messages и тот, который сочетает в себе лучшее из обоих миров с Near Me Messaging. Этот блог проведет вас через включение чата Google Карт с помощью этих трех различных методов.*

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/comparison_table.jpg" alt="Сравнение 3 различных методов реализации чата Google Карт с Google Business Profile, Google Business Messages и Near Me Messaging"/>

*Сравнение 3 различных методов реализации чата Google Карт с [Google Business Profile](https://www.google.com/intl/ru_ru/business/), [Google Business Messages](https://businessmessages.google/) и Near Me Messaging.*
</center>

# Оглавление
- [Что такое чат Google Карт и почему его следует включить](#what-is-google-maps-chat-and-why-you-should-enable-it)
- [1. Чат Google Карт с Google Business Profile](#1-google-maps-chat-with-google-business-profile)
    - [Пошаговое руководство по включению чата Google Карт с Google Business Profile](#step-1-sign-in-to-your-google-business-profile-account)
- [2. Чат Google Карт с Google Business Messages](#2-google-maps-chat-with-google-business-messages)
    - [Как компании внедряют Google Business Messages](#how-businesses-implement-google-business-messages)
    - [Барьеры для внедрения](#barriers-for-implementation)
- [3. Чат Google Карт с Near Me Messaging](#3-google-maps-chat-with-near-me-messaging)
    - [Преимущества Near Me Messaging](#benefits-of-near-me-messaging)
    - [Пошаговое руководство по включению чата Google Карт с Near Me Messaging](#step-by-step-guide-to-launching-your-virtual-agent-with-near-me-messaging)

# Что такое чат Google Карт и почему его следует включить

Когда вы направляетесь в магазин, спортзал, автосалон или другие предприятия с помощью приложения Google Карты, вы могли заметить, что некоторые из них имеют встроенную кнопку чата. Эта кнопка чата позволяет вам, как владельцу бизнеса, общаться с вашими клиентами. Ваши клиенты могут связаться с вами напрямую через кнопку чата в Google Картах или в Google Поиске, и вы сможете ответить, когда будете доступны.

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/chat_button.png" alt="Список компаний с включенной функцией чата в профиле Google Карт"/>

*Как выглядит функция чата в списке компаний из приложения Google Карт.*
</center>

Почему это важная функция для владельцев бизнеса? Во-первых, ваш бизнес будет выделяться среди других, потому что вы облегчаете клиентам связь с вами. Фактически, [72% клиентов](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) с большей вероятностью купят товары в магазине, где они могут задавать вопросы о товарах через чат. Во-вторых, Google Карты стали местным информационным центром 411 для потребителей, когда они ищут информацию о бизнесе, благодаря всем видам агрегированной бизнес-информации (такой как меню, бронирования, удобства, основные моменты, предварительные просмотры, изображения). Google Карты стали [новой операционной системой для бизнеса](/blog/11-google-maps-replaces-google-my-business/).


Теперь есть разные способы включить чат Google Карт: ручной с помощью Google Business Profile, автоматический с помощью Google Business Messages и тот, который сочетает в себе лучшее из обоих миров с Near Me Messaging. Мы проведем вас через использование чата Google Карт с Google Business Profile и Google Business Messages, а также их плюсы и минусы. Наконец, мы проведем вас через использование чата Google Карт с Near Me Messaging.

# 1. Чат Google Карт с Google Business Profile

Google Business Profile — это инструмент, который позволяет компаниям создавать бесплатный бизнес-профиль или список, который будет отображаться в сервисах Google, таких как Google Поиск и Google Карты. Вы можете обратиться к ресурсам Google о том, [как добавить или заявить права на свой бизнес-профиль в Google](https://support.google.com/business/answer/2911778?hl=ru&co=GENIE.Platform%3DDesktop). Преимущества наличия списка Google Business Profile включают:

- Привлекайте клиентов и получайте больше видимости через Google Поиск и Google Карты
- Предоставляйте актуальную информацию о своем бизнесе, такую как часы работы и атрибуты
- Создавайте репутацию с помощью звездного рейтинга и отзывов
- Получайте информацию о своей поисковой эффективности в сервисах Google

С помощью Google Business Profile вы можете включить функцию чата в три простых шага:

## Шаг 1. Войдите в свой аккаунт Google Business Profile.

Посетите [домашнюю страницу Google Business Profile](https://www.google.com/business/) и войдите в свой бизнес-листинг.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="Страница Google Business Profile после входа владельца бизнеса"/>

*Страница Google Business Profile после входа владельца бизнеса.*
</center>

## Шаг 2. Перейдите на вкладку «Сообщения».

Следующий шаг — нажать вкладку *«Сообщения»* в левой части страницы.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Интерфейс вкладки «Сообщения» в Google Business Profile"/>

*Интерфейс вкладки «Сообщения».*
</center>

## Шаг 3. Активируйте функцию «Чат» в своем списке.

Нажмите кнопку *«Включить чат»*, как показано ниже.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "Нажатие кнопки «Включить чат» активирует функцию чата"/>

*Нажмите кнопку «Включить чат», чтобы активировать функцию чата.*
</center>

Как только вы нажмете кнопку *«Включить чат»*, появится всплывающее окно, уведомляющее вас о том, что ваш чат активирован. Google также отправит вам уведомление по электронной почте о вашей недавно активированной функции чата.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png"/>

*Всплывающая страница, уведомляющая владельца бизнеса о том, что функция чата активирована.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Уведомление по электронной почте от Google о недавно активированной функции чата в Google Картах"/>

*Уведомление по электронной почте от Google о недавно активированной функции «Чат».*
</center>

## Ответы на сообщения ваших клиентов

После активации службы обмена сообщениями Google Business Profile вы увидите кнопку чата в своем списке, и клиенты смогут обращаться к вашему бизнесу с любыми вопросами. Имейте в виду, что при использовании этой функции вы должны быть доступны для ответа на запросы. Клиенты могут видеть ваше среднее время ответа и могут быть обескуражены, если увидят более длительное время ответа. Крайне важно, чтобы вы отвечали на сообщения клиентов в течение 24 часов. Согласно странице часто задаваемых вопросов [Google Business Profile](https://support.google.com/business/answer/9114771?hl=ru&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google), Google может удалить кнопку «Чат» из вашего списка, если вы не ответите в течение одного дня.

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/response_time.png" alt="Время ответа отображается в функции чата на Google Картах, когда клиенты собираются ввести вопросы"/>

*Время ответа отображается в функции чата на Google Картах, когда клиенты собираются ввести вопросы.*
</center>

Теперь, когда вы знаете, как работает чат Google Карт с Google Business Profile, как убедиться, что ваш бизнес может справляться с растущим числом запросов клиентов? Поскольку клиенты все чаще обращаются к вам в чате, у вас может не хватать времени и ресурсов для ответа на каждый чат, особенно в нерабочее время. Более того, большинство запросов могут быть повторяющимися. В то же время клиенты ожидают мгновенных ответов от компаний. Если компании не удовлетворяют потребности своих клиентов, они рискуют потерять существующих и потенциальных клиентов.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="Потребители расстроены тем, что их вопросы остаются без ответа, и тем, что они слишком долго висят на линии"/>

*Что движет будущим обмена сообщениями в США? ([источник](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="1-звездочный рейтинг от расстроенного клиента на Google Картах из-за отсутствия связи со стороны владельца бизнеса."/>

*1-звездочный рейтинг от расстроенного клиента из-за отсутствия связи со стороны владельца бизнеса.*
</center>


Вот почему мы хотим представить вам второй метод, автоматический способ использования чата Google Карт с Google Business Messages.


# 2. Чат Google Карт с Google Business Messages

[Google Business Messages](https://businessmessages.google/) — это диалоговый опыт нового поколения, который решает проблему предоставления ответов в реальном времени вашим клиентам, когда человек недоступен. В то время как Google Business Profile позволяет владельцам бизнеса общаться напрямую с клиентами через кнопку чата в Google Картах, Google Business Messages идет дальше, позволяя интегрироваться с виртуальным агентом. Согласно [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6), виртуальный агент — это «компьютерный, анимированный, искусственный интеллект виртуальный персонаж (обычно с антропоморфным внешним видом), который служит представителем службы поддержки клиентов в Интернете».


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="Руководители компаний считают, что Google Business Messages улучшит взаимодействие с клиентами"/>

*Делаем это личным: как умные инструменты коммуникации способствуют достижению бизнес-результатов ([источник](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>


Виртуальный агент часто называется цифровым помощником. Виртуальные агенты используют технологию обработки естественного языка (NLP) для предоставления автоматических ответов. Виртуальные агенты могут принести пользу вашему бизнесу, сокращая время ответа, обеспечивая круглосуточную доступность и улучшая качество обслуживания клиентов. Именно так Google Business Messages может помочь вам предоставлять высококачественные автоматические ответы вашим клиентам.

Дополнительные преимущества Google Business Messages включают:
- Предоставление мгновенных ответов на запросы клиентов
- Экономия времени и денег при предоставлении отличного обслуживания клиентов
- Построение доверия с вашими клиентами

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages интегрирует виртуального агента непосредственно в кнопку чата на Google Картах"/>

*Google Business Messages интегрирует виртуального агента непосредственно в вашу кнопку чата.*
</center>


## Как компании внедряют Google Business Messages

Чтобы лучше понять, как Google Business Messages может помочь вашему бизнесу, давайте рассмотрим несколько примеров от Walmart, Levi's и Albertsons Companies.

### 1. Walmart

Walmart входит в число первых компаний, внедривших Business Messages ([Блог Google](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). С помощью Google Business Messages Walmart предоставляет актуальную информацию о часах работы магазинов, продуктах, вакцинации и тестировании на COVID-19, вариантах самовывоза и доставки, политике возврата и многом другом. Клиенты могут получать мгновенные ответы в любое время суток.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="Клиенты могут связаться с Walmart через кнопку чата на Google Картах (только для мобильных устройств)"/>

*Клиенты могут связаться с Walmart через кнопку чата на Google Картах (только для мобильных устройств).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="Клиенты могут задавать вопросы виртуальному агенту Walmart о часах работы магазинов, продуктах, политике масок, вакцинации от COVID-19 и многом другом"/>

*Клиенты могут задавать вопросы о часах работы магазинов, продуктах, политике масок, вакцинации от COVID-19 и многом другом.*
</center>

### 2. Levi's


Levi's — это компания по производству одежды, известная своими джинсами Levi's, имеющая 3100 розничных магазинов в 110 странах. Во время пандемии Levi's заметила, что покупатели тратят значительное количество времени на предварительное исследование перед покупкой и что часы работы магазинов могут меняться чаще. Levi's хотела превратить покупателей в реальных клиентов и предоставлять быстрые ответы на запросы покупателей.

В июне 2020 года Levi's внедрила Google Business Messages с целью улучшения качества обслуживания клиентов путем предоставления актуальной информации о магазинах и продуктах. Levi's использовала возможность Google Business Messages помогать клиентам в любое время суток и в результате смогла достичь 85% показателя удовлетворенности клиентов (CSAT). Levi's также увидела, что количество решенных вопросов, связанных с магазином, увеличилось в 30 раз. Узнайте больше о том, как Levi's внедрила Google Business Messages [здесь](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf).

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="Клиенты могут связаться с Levi’s через кнопку чата на Google Картах (только для мобильных устройств)"/>

*Клиенты могут связаться с Levi’s через кнопку чата (только для мобильных устройств).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="Клиенты могут просматривать продукты Levi’s при взаимодействии с виртуальным агентом Levi’s на Google Картах"/>

*Клиенты могут просматривать продукты Levi’s при взаимодействии с виртуальным агентом Levi’s.*
</center>


### 3. Albertsons Companies

Albertsons Co. владеет несколькими аптеками по всей территории США, включая Safeway, Jewel-Osco, Vons, Albertsons, Shaw’s и другие. В конце 2020 года, во время первоначального выпуска вакцин от COVID-19, наблюдался рост онлайн-поиска вакцин. Возникло больше вопросов о праве на вакцинацию, записи на прием и местах, где можно получить вакцины. Albertsons Co. решила активировать Google Business Messages для предоставления актуальной информации о критериях приемлемости, записях на прием, доступности и многом другом. В результате они смогли сократить количество входящих звонков, предотвратить возможную дезинформацию и помогать клиентам круглосуточно.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="Клиенты могут получить информацию о праве на вакцинацию и записаться на прием прямо у виртуального агента Albertsons Co."/>

*Клиенты могут получить информацию о праве на вакцинацию и записаться на прием.*
</center>

Google Business Messages — отличный способ сэкономить время и деньги на ответы на повторяющиеся запросы, построение отношений с клиентами и улучшение общего качества обслуживания клиентов.


## Барьеры для внедрения

Существуют два основных ограничения при обычной реализации Google Business Messages, как показано выше.

Прежде всего, [создание и поддержание отличного виртуального агента — непростая задача](https://developers.google.com/business-communications/business-messages/guides/how-it-works); это требует глубоких знаний в области разговорного ИИ и значительного времени на разработку. Компании, использующие Google Business Messages, должны платить профессиональному консалтинговому агентству за создание полностью индивидуального опыта с нуля. Это обычно дорого и может занять месяцы. Крупные предприятия, такие как Levi's, Walmart и Albertsons Companies, — это те, кто может позволить себе такую специальную услугу. Консалтинговое агентство обычно также полностью контролирует разработку и поддержку продукта. Если вам нужно внести изменения, вам придется обращаться через агентство, и это займет дополнительное время.

Во-вторых, Google Business Messages является заменой функции обмена сообщениями, встроенной в Google Business Profile. Как владельцы бизнеса, вы можете включить кнопку чата в Google Business Profiles и отвечать, когда вы доступны. Однако, когда вы внедряете Google Business Messages, ваши входящие сообщения направляются вашему живому агенту, и вы теряете возможность общаться напрямую с клиентами в Google Business Profile или с помощью приложения Google My Business.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="Решение для живого чата позволяет владельцам бизнеса напрямую общаться с клиентами"/>

*Если решение для живого чата включено, клиенты смогут нажать «Отправить сообщение живому агенту», чтобы напрямую поговорить с владельцами бизнеса.*
</center>


Если вы все еще хотите напрямую общаться со своими клиентами, используя Google Business Messages, вам необходимо [попросить консалтинговое агентство](https://developers.google.com/business-communications/business-messages/partners) предоставить решение для живого чата. Если эта функция включена, клиенты могут нажать кнопку «Отправить сообщение живому агенту», и тогда вы сможете присоединиться к разговору и общаться с клиентом. Со стороны живого агента разговоры будут происходить на любой платформе, которую консалтинговое агентство выбрало для интеграции; это может быть текст, WhatsApp, Messenger, существующее программное обеспечение для обслуживания клиентов, такое как Zendesk, или специально разработанный веб-сайт или телефонное приложение.

Теперь вы, возможно, задаетесь вопросом, существует ли решение для преодоления этих барьеров, но при этом получить преимущества Google Business Messages? Вот почему мы хотим показать вам наше новейшее решение, Near Me Messaging, и как вы можете максимально использовать свой чат Google Карт с его помощью!

# 3. Чат Google Карт с Near Me Messaging

Near Me Messaging интегрирует передовой разговорный ИИ с Google Business Messages, позволяя клиентам связываться с вашим бизнесом в любое время суток через кнопку чата в вашем профиле Google Карт. Таким образом, вы можете сосредоточиться на ведении своего бизнеса, пока Near Me Messaging обрабатывает запросы ваших клиентов. Что отличает Near Me Messaging от аналогичных сервисов, так это 5-минутная настройка, самостоятельная настройка и встроенная поддержка живого чата.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Карт."/>

*Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Карт.*
</center>

Прежде всего, когда компании интегрируют Google Business Messages, им необходимо платить профессиональному консалтинговому агентству за создание полностью индивидуального опыта с нуля. Это обычно дорого и занимает время. Мы понимаем, что типичные инвестиции времени и ресурсов для использования Google Business Messages являются барьером для многих малых предприятий. Near Me Messaging решает это ограничение, предоставляя доступное решение для малых и средних предприятий. Вы можете получить работающего виртуального агента менее чем за 5 минут. Более того, вы можете постоянно обновлять и настраивать своего виртуального агента в любое время с веб-сайта Near Me Messaging. Изменения, которые вы вносите на сайте Near Me Messaging, вступают в силу немедленно для клиентов, которые взаимодействуют с вашим агентом.

Кроме того, когда вы включаете кнопку чата в Google Business Profile, у вас есть возможность отвечать своим клиентам, когда вы доступны. Но когда вы интегрируете Google Business Messages, ваши входящие сообщения направляются вашему живому агенту, и вы теряете возможность общаться напрямую с клиентами в Google Business Profile. Near Me Messaging решает это ограничение, предоставляя функцию живого агента без дополнительных затрат или времени на настройку. С помощью функции живого агента клиенты могут запросить перевод на реального человека в любое время. Когда вы видите запрос живого агента, или если вы хотите взять на себя управление виртуальным агентом, вы можете присоединиться к разговору и напрямую поговорить со своими клиентами.

## Преимущества Near Me Messaging

### 1. Экономия времени и рабочей силы при предоставлении отличного обслуживания клиентов

При использовании Near Me Messaging ответы на самые основные вопросы обрабатываются автоматически на основе информации из вашего Google Business Profile. Чем больше информации в вашем Google Business Profile, тем лучше агент может отвечать на основные вопросы. И если вы когда-либо захотите обновить свой Google Business Profile, вы можете синхронизировать свои изменения с Near Me, чтобы автоматически обновлять ответы бота. Виртуальный агент также будет генерировать ответы из соответствующих отзывов пользователей в вашем профиле Google Карт, которые имеют высокий рейтинг. Помимо автоматически генерируемых ответов, вы можете добавлять больше пользовательского контента через часто задаваемые вопросы и базу знаний, которые мы обсудим более подробно в следующем разделе.

В течение 5 минут после входа на веб-сайт Near Me вы можете протестировать своего собственного работающего виртуального агента. Ваш виртуальный агент может предоставлять мгновенные ответы на повторяющиеся запросы клиентов 24/7. Таким образом, вы можете строить и поддерживать отношения со своими клиентами.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging предоставляет настраиваемую функцию часто задаваемых вопросов для персонализации виртуального агента"/>

*Пример из нашей настраиваемой функции часто задаваемых вопросов.*
</center>

### 2. Возможности самообслуживания и настройки.

В дополнение к генерации ответов из вашего бизнес-профиля и отзывов клиентов, Near Me Messaging оснащен возможностями самообслуживания. Чтобы персонализировать вашего виртуального агента, некоторые из основных функций, которые вы можете настроить, — это имя виртуального агента, приветственное сообщение и логотип. Что еще более важно, вы можете создавать пользовательские ответы на запросы пользователей, которые специфичны для вашего бизнеса. Это делается путем создания часто задаваемых вопросов (FAQ) и добавления дополнительной информации о вашем бизнесе (например, текста с вашего веб-сайта) в базу знаний.

После настройки агента вы можете протестировать его в частном порядке, пока не будете удовлетворены производительностью. Когда вы будете готовы, вы можете запустить его публично прямо с веб-сайта Near Me Messaging. После публичного запуска вашего виртуального агента вы можете постоянно вносить изменения и дополнительно настраивать своего виртуального агента. Когда вы вносите изменения, вы можете перейти на вкладку *"Частное тестирование"*, чтобы протестировать их, прежде чем делать их общедоступными. Когда вы будете довольны изменениями, вы можете нажать *"Перезапустить"* на странице *"Публичный запуск"*, чтобы мгновенно обновить публичную версию вашего виртуального агента.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging интегрирует Google Business Messages с кнопкой чата в вашем профиле Google Карт."/>

*Вы можете нажать кнопку "Перезапустить" после завершения внесения изменений/улучшений в вашего виртуального агента.*
</center>


Теперь, когда вы знаете различные методы реализации чата Google Карт, хотите ли вы узнать больше о том, как максимально использовать функцию чата?

Мы создали [группу в Facebook для владельцев бизнеса, чтобы делиться и обсуждать, как оптимизировать ваш чат Google Карт](https://www.facebook.com/groups/513092883608553). Владельцы бизнеса могут задавать друг другу вопросы, делиться информацией и получать уведомления о последних событиях или вебинарах по оптимизации чата Google Карт. Присоединяйтесь сейчас, чтобы в полной мере воспользоваться этой возможностью!
`;export{e as default};
