const e=`---
title: "الدليل النهائي لتمكين الدردشة على خرائط Google للتواصل مع العملاء"
metatitle: "الدليل النهائي لتمكين الدردشة على خرائط Google"
date: 2022-04-29 20:39:13-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Ruli Setiawati
description: "في هذه المدونة، سنلقي نظرة على الطرق الثلاث المختلفة لتمكين دردشة خرائط Google بهذه الطرق الثلاث المختلفة للتواصل بشكل أفضل مع العملاء."
tags:
  - NearMe
image: images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/ultimate_guide_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps-to-connect-with-customers/
url: /blog/enable-chat-on-google-maps-to-connect-with-customers/
---

*تعد دردشة خرائط Google طريقة رائعة للشركات للتواصل مع العملاء. هناك طرق مختلفة لتمكين دردشة خرائط Google: طريقة يدوية باستخدام ملف تعريف نشاطي التجاري على Google، وطريقة تلقائية باستخدام رسائل Google للأعمال، وطريقة تجمع أفضل ما في العالمين باستخدام Near Me Messaging. ستوضح لك هذه المدونة كيفية تمكين دردشة خرائط Google باستخدام هذه الطرق الثلاث المختلفة.*

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/comparison_table.jpg" alt="مقارنة بين 3 طرق مختلفة لتطبيق دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google، ورسائل Google للأعمال، و Near Me Messaging"/>

*مقارنة بين 3 طرق مختلفة لتطبيق دردشة خرائط Google مع [ملف تعريف نشاطي التجاري على Google](https://www.google.com/intl/ar_us/business/)، و [رسائل Google للأعمال](https://businessmessages.google/)، و Near Me Messaging.*
</center>

# جدول المحتويات
- [ما هي دردشة خرائط Google ولماذا يجب عليك تمكينها](#what-is-google-maps-chat-and-why-you-should-enable-it)
- [1. دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google](#1-google-maps-chat-with-google-business-profile)
    - [دليل خطوة بخطوة لتمكين دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google](#step-1-sign-in-to-your-google-business-profile-account)
- [2. دردشة خرائط Google مع رسائل Google للأعمال](#2-google-maps-chat-with-google-business-messages)
    - [كيف تقوم الشركات بتطبيق رسائل Google للأعمال](#how-businesses-implement-google-business-messages)
    - [عوائق التنفيذ](#barriers-for-implementation)
- [3. دردشة خرائط Google مع Near Me Messaging](#3-google-maps-chat-with-near-me-messaging)
    - [فوائد Near Me Messaging](#benefits-of-near-me-messaging)
    - [دليل خطوة بخطوة لتمكين دردشة خرائط Google مع Near Me Messaging](#step-by-step-guide-to-launching-your-virtual-agent-with-near-me-messaging)

# ما هي دردشة خرائط Google ولماذا يجب عليك تمكينها

عندما تتجه إلى متجر أو صالة ألعاب رياضية أو وكالة سيارات أو غيرها من الشركات باستخدام تطبيق خرائط Google، ربما لاحظت أن بعضها يحتوي على زر دردشة مضمن فيه. يتيح لك زر الدردشة هذا، بصفتك مالك عمل، التواصل مع عملائك. يمكن لعملائك التواصل معك مباشرة عبر زر الدردشة على خرائط Google أو على بحث Google وستتمكن من الرد متى كنت متاحًا.

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/chat_button.png" alt="قائمة أعمال مع ميزة الدردشة ممكّنة في ملف تعريف خرائط Google"/>

*كيف تبدو ميزة الدردشة في قائمة أعمال من تطبيق خرائط Google.*
</center>

لماذا تعد هذه ميزة مهمة لأصحاب الأعمال؟ أولاً، سيبرز عملك بين الشركات الأخرى لأنك تسهل على العملاء التواصل معك. في الواقع، [72% من العملاء](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) أكثر عرضة لشراء المنتجات من متجر يمكنهم فيه الاستفسار عن المنتجات عبر رسائل الدردشة. ثانيًا، أصبحت خرائط Google معلومات محلية 411 للمستهلكين عندما يبحثون عن معلومات الأعمال، وذلك بفضل جميع أنواع معلومات الأعمال المجمعة (مثل القائمة، الحجوزات، وسائل الراحة، النقاط البارزة، المعاينات، الصور). أصبحت خرائط Google [نظام التشغيل الجديد للشركات](/blog/11-google-maps-replaces-google-my-business/).


الآن، هناك طرق مختلفة لتمكين دردشة خرائط Google: طريقة يدوية باستخدام ملف تعريف نشاطي التجاري على Google، وطريقة تلقائية باستخدام رسائل Google للأعمال، وطريقة تجمع أفضل ما في العالمين باستخدام Near Me Messaging. سنوضح لك كيفية استخدام دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google ورسائل Google للأعمال، بالإضافة إلى إيجابياتها وسلبياتها. أخيرًا، سنوضح لك كيفية استخدام دردشة خرائط Google مع Near Me Messaging.

# 1. دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google

ملف تعريف نشاطي التجاري على Google هو أداة تمكن الشركات من إنشاء ملف تعريف أو قائمة أعمال مجانية ستظهر عبر خدمات Google مثل بحث Google وخرائط Google. يمكنك الرجوع إلى موارد Google حول [كيفية إضافة أو المطالبة بملف تعريف نشاطك التجاري على Google](https://support.google.com/business/answer/2911778?hl=ar&co=GENIE.Platform%3DDesktop). تتضمن ميزة وجود قائمة ملف تعريف نشاطي التجاري على Google ما يلي:

- جذب العملاء واكتساب المزيد من الرؤية من خلال بحث Google وخرائط Google
- توفير معلومات محدثة حول عملك مثل ساعات العمل والسمات
- بناء السمعة من خلال تقييم النجوم والمراجعات
- الحصول على رؤى حول أداء البحث الخاص بك عبر خدمات Google

باستخدام ملف تعريف نشاطي التجاري على Google، يمكنك تمكين ميزة الدردشة في هذه الخطوات الثلاث السهلة:

## الخطوة 1. قم بتسجيل الدخول إلى حساب ملف تعريف نشاطي التجاري على Google.

قم بزيارة [الصفحة الرئيسية لملف تعريف نشاطي التجاري على Google](https://www.google.com/business/)، وقم بتسجيل الدخول إلى قائمة أعمالك.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="صفحة ملف تعريف نشاطي التجاري على Google بمجرد تسجيل دخول مالك العمل"/>

*صفحة ملف تعريف نشاطي التجاري على Google بمجرد تسجيل دخول مالك العمل.*
</center>

## الخطوة 2. انتقل إلى علامة التبويب المراسلة.

الخطوة التالية هي النقر فوق علامة التبويب *"الرسائل"* على الجانب الأيسر من الصفحة.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="واجهة علامة التبويب الرسائل في ملف تعريف نشاطي التجاري على Google"/>

*واجهة علامة التبويب الرسائل.*
</center>

## الخطوة 3. قم بتنشيط ميزة "الدردشة" في قائمتك.

انقر فوق الزر *"تشغيل الدردشة"* كما هو موضح أدناه.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "سيؤدي النقر فوق الزر تشغيل الدردشة إلى تنشيط ميزة الدردشة"/>

*انقر فوق الزر تشغيل الدردشة لتنشيط ميزة الدردشة.*
</center>

بمجرد النقر فوق الزر *"تشغيل الدردشة"*، ستظهر نافذة منبثقة لإعلامك بأنه تم تنشيط الدردشة الخاصة بك. سترسل لك Google أيضًا إشعارًا عبر البريد الإلكتروني حول ميزة الدردشة التي تم تنشيطها حديثًا.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png"/>

*صفحة منبثقة تُعلم مالك العمل بأنه تم تنشيط ميزة الدردشة.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="إشعار بالبريد الإلكتروني من Google حول ميزة الدردشة التي تم تنشيطها حديثًا في خرائط Google"/>

*إشعار بالبريد الإلكتروني من Google حول ميزة "الدردشة" التي تم تنشيطها حديثًا.*
</center>

## الرد على رسائل عملائك

بمجرد تنشيط خدمة مراسلة ملف تعريف نشاطي التجاري على Google، يمكنك رؤية زر الدردشة في قائمتك وسيتمكن العملاء من التواصل مع عملك بأي استفسارات قد تكون لديهم. ضع في اعتبارك أنه عند استخدام هذه الميزة، يجب عليك التأكد من أنك ستكون متاحًا للرد على الاستفسارات. يمكن للعملاء رؤية متوسط وقت استجابتك وقد يثبطون عزيمتهم عن الاتصال بك إذا رأوا وقت استجابة أطول. من الأهمية بمكان أن ترد على رسائل عملائك في غضون 24 ساعة. وفقًا لصفحة الأسئلة الشائعة لـ [ملف تعريف نشاطي التجاري على Google](https://support.google.com/business/answer/9114771?hl=ar&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google)، قد تزيل Google زر "الدردشة" من قائمتك إذا لم ترد في غضون يوم واحد.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="يظهر وقت الاستجابة في ميزة الدردشة على خرائط Google عندما يكون العملاء على وشك كتابة الأسئلة"/>

*يظهر وقت الاستجابة في ميزة الدردشة على خرائط Google 
عندما يكون العملاء على وشك كتابة الأسئلة.*
</center>

الآن بعد أن عرفت كيف تعمل دردشة خرائط Google مع ملف تعريف نشاطي التجاري على Google، كيف تتأكد من أن عملك يمكنه مواكبة العدد المتزايد من استفسارات العملاء؟ عندما يتواصل العملاء معك أكثر عبر الدردشة، قد لا يكون لديك الوقت والموارد للرد على كل دردشة، خاصة خلال ساعات الإغلاق. علاوة على ذلك، يمكن أن تكون معظم الاستفسارات متكررة. في الوقت نفسه، يتوقع العملاء إجابات فورية من الشركات. إذا لم تلبي الشركات احتياجات عملائها، فإنها تخاطر بفقدان العملاء الحاليين والمحتملين.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="يشعر المستهلكون بالإحباط لعدم الإجابة على أسئلتهم ولتعلقهم في الانتظار لفترة طويلة جدًا"/>

*ما الذي يدفع مستقبل المراسلة في الولايات المتحدة؟ ([المصدر](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="تقييم بنجمة واحدة من قبل عميل مستاء على خرائط Google بسبب نقص التواصل من قبل مالك العمل."/>

*تقييم بنجمة واحدة من قبل عميل مستاء بسبب نقص التواصل من قبل مالك العمل.*
</center>


لهذا السبب نريد أن نقدم لك الطريقة الثانية، وهي طريقة تلقائية لاستخدام دردشة خرائط Google مع رسائل Google للأعمال.


# 2. دردشة خرائط Google مع رسائل Google للأعمال

[رسائل Google للأعمال](https://businessmessages.google/) هي تجربة محادثة من الجيل التالي تحل مشكلة توفير استجابات في الوقت الفعلي لعملائك عندما لا يكون هناك إنسان متاحًا. بينما يتيح ملف تعريف نشاطي التجاري على Google لأصحاب الأعمال الدردشة مباشرة مع العملاء عبر زر الدردشة على خرائط Google، فإن رسائل Google للأعمال تتقدم خطوة أخرى من خلال تمكين التكامل مع وكيل افتراضي. وفقًا لـ [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6)، الوكيل الافتراضي هو "شخصية افتراضية ذكاء اصطناعي متحركة يتم إنشاؤها بواسطة الكمبيوتر (عادةً ما تكون ذات مظهر بشري) تعمل كممثل لخدمة العملاء عبر الإنترنت".


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="يعتقد صانعو القرار في مجال الأعمال أن رسائل Google للأعمال ستحسن التفاعلات مع العملاء"/>

*جعلها شخصية: كيف تدفع أدوات الاتصال الذكية نتائج الأعمال ([المصدر](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>


يُشار إلى الوكيل الافتراضي غالبًا باسم المساعد الرقمي. تستخدم الوكلاء الافتراضيون تقنية تسمى معالجة اللغة الطبيعية (NLP) لتقديم استجابات تلقائية. يمكن للوكلاء الافتراضيين أن يفيدوا عملك عن طريق تقليل وقت الاستجابة، وتوفير التوفر على مدار الساعة طوال أيام الأسبوع، وتحسين تجربة العملاء. هكذا يمكن لرسائل Google للأعمال أن تساعدك في تقديم استجابات تلقائية عالية الجودة لعملائك.

تشمل المزايا الإضافية لرسائل Google للأعمال ما يلي:
- تقديم إجابات فورية لاستفسارات عملائك
- توفير الوقت والمال في تقديم خدمة عملاء ممتازة
- بناء الثقة مع عملائك

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="تدمج رسائل Google للأعمال وكيلًا افتراضيًا مباشرة في زر الدردشة على خرائط Google"/>

*تدمج رسائل Google للأعمال وكيلًا افتراضيًا مباشرة في زر الدردشة الخاص بك.*
</center>


## كيف تقوم الشركات بتطبيق رسائل Google للأعمال

لتقديم فهم أفضل لكيفية مساعدة رسائل Google للأعمال لعملك، دعنا نلقي نظرة على بعض الأمثلة من Walmart و Levi's و Albertsons Companies.

### 1. Walmart

تعد Walmart من أوائل الشركات التي طبقت رسائل الأعمال ([مدونة Google](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). باستخدام رسائل Google للأعمال، توفر Walmart معلومات محدثة حول ساعات عمل المتجر، والمنتجات، ولقاح واختبار COVID-19، وخيارات الاستلام والتسليم، وسياسة الإرجاع، والمزيد. يمكن للعملاء الحصول على إجابات فورية في أي وقت من اليوم.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="يمكن للعملاء التواصل مع Walmart عبر زر الدردشة على خرائط Google (للجوال فقط)"/>

*يمكن للعملاء التواصل مع Walmart عبر زر الدردشة على خرائط Google (للجوال فقط).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="يمكن للعملاء طرح أسئلة على وكيل Walmart الافتراضي حول ساعات عمل المتجر، والمنتجات، وسياسة الكمامة، ولقاح COVID-19، والمزيد"/>

*يمكن للعملاء طرح أسئلة حول ساعات عمل المتجر، والمنتجات، وسياسة الكمامة، ولقاح COVID-19، والمزيد.*
</center>

### 2. Levi's


Levi's هي شركة ملابس معروفة ببنطلونات الجينز Levi's، ولديها 3100 متجر بيع بالتجزئة في 110 دولة. خلال الوباء، لاحظت Levi's أن المتسوقين يقضون وقتًا طويلاً في البحث قبل الشراء وأن ساعات عمل المتجر يمكن أن تتغير بشكل متكرر. أرادت Levi's تحويل المتسوقين إلى عملاء فعليين وتقديم ردود سريعة على استفسارات المتسوقين.

في يونيو 2020، طبقت Levi's رسائل Google للأعمال بهدف تحسين تجربة العملاء من خلال توفير معلومات محدثة حول المتاجر والمنتجات. استفادت Levi's من قدرة رسائل Google للأعمال على مساعدة العملاء في أي وقت من اليوم، ونتيجة لذلك، تمكنت من تحقيق 85% من درجات رضا العملاء (CSAT). لاحظت Levi's أيضًا أن هناك 30 ضعفًا من الأسئلة المتعلقة بالمتجر التي تم حلها. تعرف على المزيد حول كيفية تطبيق Levi's لرسائل Google للأعمال [هنا](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf).

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="يمكن للعملاء التواصل مع Levi’s عبر زر الدردشة على خرائط Google (للجوال فقط)"/>

*يمكن للعملاء التواصل مع Levi’s عبر زر الدردشة (للجوال فقط).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="يمكن للعملاء عرض منتجات Levi’s عند التفاعل مع وكيل Levi’s الافتراضي على خرائط Google"/>

*يمكن للعملاء عرض منتجات Levi’s عند التفاعل مع وكيل Levi’s الافتراضي.*
</center>


### 3. Albertsons Companies

تمتلك شركة Albertsons Co. العديد من الصيدليات في جميع أنحاء الولايات المتحدة، بما في ذلك Safeway و Jewel-Osco و Vons و Albertsons و Shaw’s والمزيد. في أواخر عام 2020، خلال الإصدار الأولي للقاحات COVID-19، كان هناك زيادة في عمليات البحث عبر الإنترنت عن اللقاحات. كانت هناك المزيد من الأسئلة حول أهلية اللقاح والمواعيد وأين يمكن للأشخاص الحصول على اللقاحات. قررت شركة Albertsons Co. تفعيل رسائل Google للأعمال لتقديم معلومات محدثة حول معايير الأهلية والمواعيد والتوافر والمزيد. ونتيجة لذلك، تمكنوا من تقليل عدد المكالمات الواردة، ومنع المعلومات الخاطئة المحتملة، ومساعدة العملاء على مدار الساعة طوال أيام الأسبوع.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="يمكن للعملاء الحصول على معلومات حول أهلية اللقاح وحجز موعد مباشرة من وكيل Albertsons Co. الافتراضي"/>

*يمكن للعملاء الحصول على معلومات حول أهلية اللقاح وحجز موعد.*
</center>

تعد رسائل Google للأعمال طريقة رائعة لتوفير الوقت والمال في الرد على الاستفسارات المتكررة، وبناء العلاقات مع العملاء، وتحسين تجربة العملاء بشكل عام.


## عوائق التنفيذ

هناك قيودان رئيسيان على التنفيذ الشائع لرسائل Google للأعمال كما هو موضح أعلاه.

أولاً، [إنشاء وكيل افتراضي ممتاز وصيانته ليس مهمة بسيطة](https://developers.google.com/business-communications/business-messages/guides/how-it-works)؛ فهو يتطلب معرفة متقدمة بالذكاء الاصطناعي للمحادثة ووقت تطوير كبير. تحتاج الشركات التي تستخدم رسائل Google للأعمال إلى دفع وكالة استشارية محترفة لإنشاء تجربة مخصصة بالكامل لهم من الألف إلى الياء. عادة ما تكون هذه الخدمات باهظة الثمن وقد تستغرق شهورًا. الشركات الكبيرة مثل Levi's و Walmart و Albertsons Companies هي التي تستطيع تحمل تكاليف هذه الخدمة الخاصة. عادة ما تكون وكالة الاستشارات مسؤولة بالكامل عن تطوير المنتج وصيانته. إذا كان عليك إجراء تغييرات، فعليك المرور عبر الوكالة وهذا يستغرق وقتًا إضافيًا.

ثانيًا، رسائل Google للأعمال هي بديل لقدرة المراسلة المضمنة في ملف تعريف نشاطي التجاري على Google. بصفتك مالك عمل، لديك القدرة على تمكين زر الدردشة في ملفات تعريف نشاطي التجاري على Google والرد متى كنت متاحًا. ومع ذلك، عند تطبيق رسائل Google للأعمال، يتم توجيه رسائلك الواردة إلى وكيلك المباشر، وتفقد قدرتك على الدردشة مباشرة مع العملاء داخل ملف تعريف نشاطي التجاري على Google أو باستخدام تطبيق Google My Business.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="يتيح حل الدردشة المباشرة لأصحاب الأعمال التحدث مباشرة مع العملاء"/>

*إذا تم تمكين حل الدردشة المباشرة، فسيتمكن العملاء من النقر فوق "مراسلة وكيل مباشر" للتحدث مباشرة مع أصحاب الأعمال.*
</center>


إذا كنت لا تزال ترغب في التحدث مباشرة مع عملائك أثناء استخدام رسائل Google للأعمال، فأنت بحاجة إلى [الطلب من الوكالة الاستشارية](https://developers.google.com/business-communications/business-messages/partners) توفير حل للدردشة المباشرة. إذا تم تمكين هذه الميزة، يمكن للعملاء النقر فوق زر "مراسلة وكيل مباشر"، وبعد ذلك ستتمكن من الانضمام إلى المحادثة والدردشة مع العميل. من جانب الوكيل المباشر، ستتم المحادثات على أي منصة اختارتها الوكالة الاستشارية للتكامل معها؛ يمكن أن يكون ذلك عبر الرسائل النصية، أو WhatsApp، أو Messenger، أو برنامج خدمة عملاء موجود مثل Zendesk، أو موقع ويب أو تطبيق هاتف مخصص.

الآن قد تتساءل، هل هناك حل للتغلب على هذه العوائق ولكن لا يزال بإمكانك الاستفادة من رسائل Google للأعمال؟ لهذا السبب نريد أن نعرض لك أحدث حلولنا، Near Me Messaging، وكيف يمكنك تحقيق أقصى استفادة من دردشة خرائط Google الخاصة بك معه!

# 3. دردشة خرائط Google مع Near Me Messaging

تدمج Near Me Messaging الذكاء الاصطناعي للمحادثة المتطور مع رسائل Google للأعمال، مما يسمح للعملاء بالوصول إلى عملك في أي وقت من اليوم عبر زر الدردشة في ملفك الشخصي على خرائط Google. بهذه الطريقة، يمكنك التركيز على رعاية عملك بينما تتولى Near Me Messaging استفسارات عملائك. ما يميز Near Me Messaging عن الخدمات المماثلة هو وقت الإعداد الذي يستغرق 5 دقائق، والتخصيص الذاتي، ودعم الدردشة المباشرة المدمج.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="تدمج Near Me Messaging رسائل Google للأعمال مع زر الدردشة في ملفك الشخصي على خرائط Google."/>

*تدمج Near Me Messaging رسائل Google للأعمال مع زر الدردشة في ملفك الشخصي على خرائط Google.*
</center>

أولاً وقبل كل شيء، عندما تدمج الشركات رسائل Google للأعمال، فإنها تحتاج إلى دفع وكالة استشارية محترفة لإنشاء تجربة مخصصة بالكامل لهم من الألف إلى الياء. عادة ما تكون هذه الخدمات باهظة الثمن وتستغرق وقتًا. نحن نتفهم أن الاستثمار النموذجي في الوقت والموارد للاستفادة من رسائل Google للأعمال يمثل عائقًا أمام العديد من الشركات الصغيرة. تحل Near Me Messaging هذا القيد من خلال توفير حل ميسور التكلفة للشركات الصغيرة والمتوسطة. يمكنك الحصول على وكيل افتراضي يعمل في أقل من 5 دقائق. علاوة على ذلك، يمكنك تحديث وكيلك الافتراضي وتخصيصه باستمرار في أي وقت من موقع Near Me Messaging. تسري التغييرات التي تجريها على موقع Near Me Messaging على الفور على العملاء الذين يتفاعلون مع وكيلك.

بالإضافة إلى ذلك، عندما تقوم بتمكين زر الدردشة في ملف تعريف نشاطي التجاري على Google، لديك القدرة على الرد على عملائك متى كنت متاحًا. ولكن عندما تقوم بدمج رسائل Google للأعمال، يتم توجيه رسائلك الواردة إلى وكيلك المباشر، وتفقد قدرتك على الدردشة مباشرة مع العملاء داخل ملف تعريف نشاطي التجاري على Google. تحل Near Me Messaging هذا القيد من خلال توفير ميزة الوكيل المباشر دون أي تكلفة إضافية أو وقت إعداد. باستخدام ميزة الوكيل المباشر، يمكن للعملاء طلب التحويل إلى شخص حقيقي في أي وقت. عندما ترى طلب وكيل مباشر، أو إذا كنت ترغب في تولي الوكيل الافتراضي، يمكنك الانضمام إلى المحادثة والتحدث مباشرة مع عملائك.

## فوائد Near Me Messaging

### 1. توفير الوقت والقوى العاملة في تقديم خدمة عملاء ممتازة

عند استخدام Near Me Messaging، يتم التعامل مع الردود على الأسئلة الأساسية تلقائيًا بناءً على المعلومات من ملف تعريف نشاطك التجاري على Google. كلما زادت المعلومات في ملف تعريف نشاطك التجاري على Google، كان الوكيل أفضل في الرد على الأسئلة الأساسية. وإذا كنت ترغب في تحديث ملف تعريف نشاطك التجاري على Google، فيمكنك مزامنة تغييراتك مع Near Me لتحديث ردود الروبوت تلقائيًا. سيقوم الوكيل الافتراضي أيضًا بإنشاء ردود من مراجعات المستخدمين ذات الصلة في ملفك الشخصي على خرائط Google والتي تحتوي على تقييم عالٍ بالنجوم. بالإضافة إلى الردود التي يتم إنشاؤها تلقائيًا، يمكنك إضافة المزيد من المحتوى المخصص عبر الأسئلة الشائعة وقاعدة المعرفة، والتي سنناقشها بمزيد من التفصيل في القسم التالي.

في غضون 5 دقائق من تسجيل الدخول إلى موقع Near Me، يمكنك اختبار وكيلك الافتراضي العامل. يمكن لوكيلك الافتراضي تقديم إجابات فورية لاستفسارات العملاء المتكررة على مدار الساعة طوال أيام الأسبوع. بهذه الطريقة، يمكنك بناء علاقاتك مع عملائك والحفاظ عليها.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="توفر Near Me Messaging ميزة الأسئلة الشائعة المخصصة لتخصيص الوكيل الافتراضي"/>

*مثال من ميزة الأسئلة الشائعة المخصصة لدينا.*
</center>

### 2. إمكانيات الخدمة الذاتية والقابلة للتخصيص.

بالإضافة إلى إنشاء ردود من ملف تعريف نشاطك التجاري ومراجعات العملاء، تم تجهيز Near Me Messaging بقدرات تخصيص الخدمة الذاتية. لتخصيص وكيلك الافتراضي، فإن بعض الميزات الأساسية التي يمكنك تخصيصها هي اسم الوكيل الافتراضي، ورسالة الترحيب، والشعار. والأهم من ذلك، يمكنك صياغة ردود مخصصة لاستفسارات المستخدمين الخاصة بعملك. يتم ذلك عن طريق إنشاء أسئلة متكررة (FAQs) وإضافة المزيد من المعلومات حول عملك (مثل النص من موقع الويب الخاص بك) إلى قاعدة المعرفة.

بعد تخصيص وكيلك، لديك القدرة على اختباره بشكل خاص حتى تكون راضيًا عن الأداء. عندما تكون جاهزًا، يمكنك بعد ذلك إطلاقه للجمهور مباشرة من موقع Near Me Messaging. بمجرد إطلاق وكيلك الافتراضي للجمهور، يمكنك الاستمرار في إجراء التغييرات وتخصيص وكيلك الافتراضي بشكل أكبر. عند إجراء التغييرات، يمكنك الانتقال إلى علامة التبويب *"الاختبار الخاص"* لاختبارها قبل جعلها عامة. بمجرد أن تكون سعيدًا بالتغييرات، يمكنك النقر فوق *"إعادة الإطلاق"* من صفحة *"الإطلاق العام"* لتحديث الإصدار العام من وكيلك الافتراضي على الفور.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="تدمج Near Me Messaging رسائل Google للأعمال مع زر الدردشة في ملفك الشخصي على خرائط Google."/>

*يمكنك النقر فوق زر "إعادة الإطلاق" بمجرد الانتهاء من إجراء التغييرات/التحسينات على وكيلك الافتراضي.*
</center>


الآن بعد أن عرفت طرقًا مختلفة لتطبيق دردشة خرائط Google، هل تريد معرفة المزيد حول كيفية تحقيق أقصى استفادة من ميزة الدردشة الخاصة بك؟

لقد أنشأنا [مجموعة فيسبوك لأصحاب الأعمال لمشاركة ومناقشة كيفية تحسين دردشة خرائط Google الخاصة بك](https://www.facebook.com/groups/513092883608553). يمكن لأصحاب الأعمال طرح الأسئلة على بعضهم البعض، ومشاركة المعلومات، والحصول على إشعارات بأحدث الأحداث أو الندوات عبر الإنترنت حول تحسين دردشة خرائط Google. انضم الآن للاستفادة الكاملة من هذه الفرصة!
`;export{e as default};
