const e=`---
title: "வாடிக்கையாளர்களுடன் இணைக்க Google Maps இல் அரட்டையை இயக்குவதற்கான இறுதி வழிகாட்டி"
metatitle: "Google Maps இல் அரட்டையை இயக்குவதற்கான இறுதி வழிகாட்டி"
date: 2022-04-29 20:39:13-07:00
modified_date: 2025-07-28 00:00:00+00:00
draft: false
author: Ruli Setiawati
description: "இந்த வலைப்பதிவில், வாடிக்கையாளர்களுடன் சிறப்பாக இணைக்க Google Maps அரட்டையை இயக்க இந்த மூன்று வெவ்வேறு முறைகளைப் பார்ப்போம்."
tags:
  - NearMe
image: images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/ultimate_guide_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps-to-connect-with-customers/
url: /blog/enable-chat-on-google-maps-to-connect-with-customers/
---

*Google Maps அரட்டை என்பது வணிகங்கள் வாடிக்கையாளர்களுடன் இணைவதற்கான ஒரு சிறந்த வழியாகும். Google Maps அரட்டையை இயக்க பல்வேறு வழிகள் உள்ளன: Google Business Profile உடன் ஒரு கையேடு முறை, Google Business Messages உடன் ஒரு தானியங்கி முறை, மற்றும் Near Me Messaging உடன் இரண்டு உலகங்களின் சிறந்தவற்றை எடுக்கும் ஒரு முறை. இந்த வலைப்பதிவு இந்த மூன்று வெவ்வேறு முறைகளுடன் Google Maps அரட்டையை எவ்வாறு இயக்குவது என்பதை உங்களுக்கு வழிகாட்டும்.*

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/comparison_table.jpg" alt="Google Business Profile, Google Business Messages மற்றும் Near Me Messaging உடன் Google Maps அரட்டையை செயல்படுத்துவதற்கான 3 வெவ்வேறு முறைகளின் ஒப்பீடு"/>

*Google Business Profile, Google Business Messages மற்றும் Near Me Messaging உடன் Google Maps அரட்டையை செயல்படுத்துவதற்கான 3 வெவ்வேறு முறைகளின் ஒப்பீடு.*
</center>

# பொருளடக்கம்
- [Google Maps அரட்டை என்றால் என்ன, அதை ஏன் இயக்க வேண்டும்](#what-is-google-maps-chat-and-why-you-should-enable-it)
- [1. Google Business Profile உடன் Google Maps அரட்டை](#1-google-maps-chat-with-google-business-profile)
    - [Google Business Profile உடன் Google Maps அரட்டையை இயக்குவதற்கான படிப்படியான வழிகாட்டி](#step-1-sign-in-to-your-google-business-profile-account)
- [2. Google Business Messages உடன் Google Maps அரட்டை](#2-google-maps-chat-with-google-business-messages)
    - [வணிகங்கள் Google Business Messages ஐ எவ்வாறு செயல்படுத்துகின்றன](#how-businesses-implement-google-business-messages)
    - [செயல்பாட்டிற்கான தடைகள்](#barriers-for-implementation)
- [3. Near Me Messaging உடன் Google Maps அரட்டை](#3-google-maps-chat-with-near-me-messaging)
    - [Near Me Messaging இன் நன்மைகள்](#benefits-of-near-me-messaging)
    - [Near Me Messaging உடன் உங்கள் மெய்நிகர் முகவரைத் தொடங்குவதற்கான படிப்படியான வழிகாட்டி](#step-by-step-guide-to-launching-your-virtual-agent-with-near-me-messaging)

# Google Maps அரட்டை என்றால் என்ன, அதை ஏன் இயக்க வேண்டும்

நீங்கள் Google Maps பயன்பாட்டைப் பயன்படுத்தி ஒரு கடை, உடற்பயிற்சி கூடம், கார் டீலர்ஷிப் அல்லது பிற வணிகங்களுக்குச் செல்லும்போது, அவற்றில் சிலவற்றில் அரட்டை பொத்தான் உட்பொதிக்கப்பட்டிருப்பதைக் கவனித்திருக்கலாம். இந்த அரட்டை பொத்தான், ஒரு வணிக உரிமையாளராக, உங்கள் வாடிக்கையாளர்களுடன் தொடர்பு கொள்ள உங்களை அனுமதிக்கிறது. உங்கள் வாடிக்கையாளர்கள் Google Maps அல்லது Google Search இல் உள்ள அரட்டை பொத்தான் வழியாக உங்களை நேரடியாகத் தொடர்பு கொள்ளலாம், மேலும் நீங்கள் கிடைக்கும்போது பதிலளிக்க முடியும்.

<center>
<img src="/images/blog/14-ultimate-guide-to-enabling-chat-on-google-maps-to-connect-with-customers/chat_button.png" alt="Google Maps சுயவிவரத்தில் அரட்டை அம்சம் இயக்கப்பட்ட வணிகப் பட்டியல்"/>

*Google Maps பயன்பாட்டிலிருந்து ஒரு வணிகப் பட்டியலில் அரட்டை அம்சம் எப்படி இருக்கும்.*
</center>

வணிக உரிமையாளர்களுக்கு இது ஏன் ஒரு முக்கியமான அம்சம்? முதலாவதாக, உங்கள் வணிகம் மற்ற வணிகங்களிடையே தனித்து நிற்கும், ஏனெனில் நீங்கள் வாடிக்கையாளர்களை உங்களுடன் எளிதாக இணைக்கிறீர்கள். உண்மையில், [72% வாடிக்கையாளர்கள்](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) அரட்டை செய்திகள் வழியாக தயாரிப்புகளைப் பற்றி கேட்கக்கூடிய ஒரு கடையில் இருந்து தயாரிப்புகளை வாங்க அதிக வாய்ப்புள்ளது. இரண்டாவதாக, Google Maps ஆனது வணிகத் தகவல்களைத் தேடும்போது நுகர்வோருக்கான உள்ளூர் தகவல் 411 ஆக மாறியுள்ளது, ஏனெனில் அனைத்து வகையான ஒருங்கிணைந்த வணிகத் தகவல்களும் (மெனு, முன்பதிவுகள், வசதிகள், சிறப்பம்சங்கள், முன்னோட்டங்கள், படங்கள் போன்றவை) உள்ளன. Google Maps ஆனது [வணிகங்களுக்கான புதிய இயக்க முறைமையாக](/blog/11-google-maps-replaces-google-my-business/) மாறியுள்ளது.


இப்போது, Google Maps அரட்டையை இயக்க பல்வேறு வழிகள் உள்ளன: Google Business Profile உடன் ஒரு கையேடு முறை, Google Business Messages உடன் ஒரு தானியங்கி முறை, மற்றும் Near Me Messaging உடன் இரண்டு உலகங்களின் சிறந்தவற்றை எடுக்கும் ஒரு முறை. Google Business Profile மற்றும் Google Business Messages உடன் Google Maps அரட்டையை எவ்வாறு பயன்படுத்துவது என்பதை அதன் நன்மை தீமைகளுடன் உங்களுக்கு வழிகாட்டுவோம். இறுதியாக, Near Me Messaging உடன் Google Maps அரட்டையை எவ்வாறு பயன்படுத்துவது என்பதை உங்களுக்கு வழிகாட்டுவோம்.

# 1. Google Business Profile உடன் Google Maps அரட்டை

Google Business Profile என்பது வணிகங்கள் Google Search மற்றும் Google Maps போன்ற Google சேவைகளில் தோன்றும் ஒரு இலவச வணிக சுயவிவரம் அல்லது பட்டியலை உருவாக்க உதவும் ஒரு கருவியாகும். [Google இல் உங்கள் வணிக சுயவிவரத்தை எவ்வாறு சேர்ப்பது அல்லது உரிமை கோருவது](https://support.google.com/business/answer/2911778?hl=ta&co=GENIE.Platform%3DDesktop) என்பது குறித்த Google இன் ஆதாரங்களைப் பார்க்கலாம். Google Business Profile பட்டியலை வைத்திருப்பதன் நன்மை:

- Google Search மற்றும் Google Maps வழியாக வாடிக்கையாளர்களை ஈர்க்கவும் மற்றும் அதிக தெரிவுநிலையைப் பெறவும்
- உங்கள் வணிகம் குறித்த புதுப்பித்த தகவல்களை (வணிக நேரம் மற்றும் பண்புகள் போன்றவை) வழங்கவும்
- நட்சத்திர மதிப்பீடு மற்றும் மதிப்புரைகள் மூலம் நற்பெயரை உருவாக்கவும்
- Google சேவைகள் முழுவதும் உங்கள் தேடல் செயல்திறன் குறித்த நுண்ணறிவுகளைப் பெறவும்

Google Business Profile உடன், இந்த மூன்று எளிய படிகளில் அரட்டை அம்சத்தை இயக்கலாம்:

## படி 1. உங்கள் Google Business Profile கணக்கில் உள்நுழையவும்.

[Google Business Profile முகப்புப்பக்கத்திற்கு](https://www.google.com/business/) சென்று, உங்கள் வணிகப் பட்டியலில் உள்நுழையவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="ஒரு வணிக உரிமையாளர் உள்நுழைந்தவுடன் Google Business Profile பக்கம்"/>

*ஒரு வணிக உரிமையாளர் உள்நுழைந்தவுடன் Google Business Profile பக்கம்.*
</center>

## படி 2. செய்திகள் தாவலுக்குச் செல்லவும்.

அடுத்த படி, பக்கத்தின் இடதுபுறத்தில் உள்ள *"செய்திகள்"* தாவலைக் கிளிக் செய்வதாகும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Google Business Profile இல் உள்ள செய்திகள் தாவலின் இடைமுகம்"/>

*செய்திகள் தாவலின் இடைமுகம்.*
</center>

## படி 3. உங்கள் பட்டியலில் ‘அரட்டை’ அம்சத்தை இயக்கவும்.

கீழே காட்டப்பட்டுள்ளபடி *"அரட்டையை இயக்கு"* பொத்தானைக் கிளிக் செய்யவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "அரட்டையை இயக்கு பொத்தானைக் கிளிக் செய்தால் அரட்டை அம்சம் செயல்படும்"/>

*அரட்டை அம்சத்தை இயக்க அரட்டையை இயக்கு பொத்தானைக் கிளிக் செய்யவும்.*
</center>

நீங்கள் *"அரட்டையை இயக்கு"* பொத்தானைக் கிளிக் செய்தவுடன், உங்கள் அரட்டை செயல்படுத்தப்பட்டது என்பதை உங்களுக்குத் தெரிவிக்க ஒரு பாப்-அப் தோன்றும். Google உங்கள் புதிதாக செயல்படுத்தப்பட்ட அரட்டை அம்சம் குறித்து உங்களுக்கு ஒரு மின்னஞ்சல் அறிவிப்பையும் அனுப்பும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png"/>

*அரட்டை அம்சம் செயல்படுத்தப்பட்டது என்று வணிக உரிமையாளருக்குத் தெரிவிக்கும் ஒரு பாப்-அப் பக்கம்.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Google Maps இல் புதிதாக செயல்படுத்தப்பட்ட அரட்டை அம்சம் குறித்த Google இலிருந்து மின்னஞ்சல் அறிவிப்பு"/>

*புதிதாக செயல்படுத்தப்பட்ட “அரட்டை” அம்சம் குறித்த Google இலிருந்து மின்னஞ்சல் அறிவிப்பு.*
</center>

## உங்கள் வாடிக்கையாளர்களின் செய்திகளுக்குப் பதிலளித்தல்

நீங்கள் Google Business Profile Messaging சேவையைச் செயல்படுத்தியதும், உங்கள் பட்டியலில் ஒரு அரட்டை பொத்தானைக் காணலாம், மேலும் வாடிக்கையாளர்கள் தங்கள் கேள்விகளுடன் உங்கள் வணிகத்தைத் தொடர்பு கொள்ள முடியும். இந்த அம்சத்தைப் பயன்படுத்தும் போது, நீங்கள் விசாரணைகளுக்குப் பதிலளிக்கக் கிடைக்கும் என்பதை உறுதிப்படுத்த வேண்டும் என்பதை நினைவில் கொள்ளுங்கள். வாடிக்கையாளர்கள் உங்கள் சராசரி பதிலளிப்பு நேரத்தைப் பார்க்கலாம், மேலும் நீண்ட பதிலளிப்பு நேரத்தைக் கண்டால் உங்களைத் தொடர்புகொள்வதில் ஊக்கமடையலாம். 24 மணி நேரத்திற்குள் உங்கள் வாடிக்கையாளர் செய்திகளுக்குப் பதிலளிப்பது மிக முக்கியம். Google [Business Profile FAQ பக்கத்தின்படி](https://support.google.com/business/answer/9114771?hl=ta&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google), நீங்கள் ஒரு நாளுக்குள் பதிலளிக்கவில்லை என்றால் Google உங்கள் பட்டியலில் உள்ள "அரட்டை" பொத்தானை அகற்றலாம்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="வாடிக்கையாளர்கள் கேள்விகளைத் தட்டச்சு செய்யும்போது Google Maps இல் உள்ள அரட்டை அம்சத்தில் பதிலளிப்பு நேரம் காட்டப்படும்"/>

*வாடிக்கையாளர்கள் கேள்விகளைத் தட்டச்சு செய்யும்போது Google Maps இல் உள்ள அரட்டை அம்சத்தில் பதிலளிப்பு நேரம் காட்டப்படும்.*
</center>

Google Maps அரட்டை Google Business Profile உடன் எவ்வாறு செயல்படுகிறது என்பதை இப்போது நீங்கள் அறிந்திருக்கிறீர்கள், வாடிக்கையாளர் விசாரணைகளின் அதிகரித்து வரும் எண்ணிக்கையை உங்கள் வணிகம் எவ்வாறு சமாளிக்கிறது என்பதை எவ்வாறு உறுதிப்படுத்துவது? வாடிக்கையாளர்கள் உங்களுடன் அரட்டையில் அதிகமாகத் தொடர்பு கொள்ளும்போது, ஒவ்வொரு அரட்டைக்கும் பதிலளிக்க உங்களுக்கு நேரமும் வளங்களும் இல்லாமல் போகலாம், குறிப்பாக மூடிய நேரங்களில். மேலும், பெரும்பாலான விசாரணைகள் மீண்டும் மீண்டும் வரலாம். அதே நேரத்தில், வாடிக்கையாளர்கள் வணிகங்களிடமிருந்து உடனடி பதில்களை எதிர்பார்க்கிறார்கள். வணிகங்கள் தங்கள் வாடிக்கையாளர்களின் தேவைகளைப் பூர்த்தி செய்யவில்லை என்றால், அவர்கள் இருக்கும் மற்றும் சாத்தியமான வாடிக்கையாளர்களை இழக்கும் அபாயம் உள்ளது.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/1-stats.png" alt="வாடிக்கையாளர்கள் தங்கள் கேள்விகளுக்குப் பதிலளிக்கப்படாததாலும், நீண்ட நேரம் காத்திருக்க வேண்டியதாலும் விரக்தியடைகிறார்கள்"/>

*அமெரிக்காவில் செய்தியிடலின் எதிர்காலத்தை எது இயக்குகிறது? ([ஆதாரம்](https://developers.google.com/business-communications/business-messages/files/us-business-messages-infographic.pdf))*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/2-one_star.png" alt="ஒரு வணிக உரிமையாளரின் தகவல்தொடர்பு இல்லாததால் Google Maps இல் ஒரு கோபமான வாடிக்கையாளரால் 1-நட்சத்திர மதிப்பீடு."/>

*ஒரு வணிக உரிமையாளரின் தகவல்தொடர்பு இல்லாததால் ஒரு கோபமான வாடிக்கையாளரால் 1-நட்சத்திர மதிப்பீடு.*
</center>


அதனால்தான் Google Business Messages உடன் Google Maps அரட்டையைப் பயன்படுத்த ஒரு தானியங்கி முறையான இரண்டாவது முறையை உங்களுக்கு அறிமுகப்படுத்த விரும்புகிறோம்.


# 2. Google Business Messages உடன் Google Maps அரட்டை

[Google Business Messages](https://businessmessages.google/) என்பது அடுத்த தலைமுறை உரையாடல் அனுபவமாகும், இது மனிதர் இல்லாதபோது உங்கள் வாடிக்கையாளர்களுக்கு நிகழ்நேர பதில்களை வழங்குவதற்கான சிக்கலைத் தீர்க்கிறது. Google Business Profile வணிக உரிமையாளர்களை Google Maps இல் உள்ள அரட்டை பொத்தான் வழியாக வாடிக்கையாளர்களுடன் நேரடியாக அரட்டையடிக்க அனுமதிக்கும் அதே வேளையில், Google Business Messages ஒரு மெய்நிகர் முகவருடன் ஒருங்கிணைப்பை செயல்படுத்துவதன் மூலம் ஒரு படி மேலே செல்கிறது. [chatbots.org](https://www.google.com/url?q=https://www.chatbots.org/virtual_agent/&sa=D&source=docs&ust=1648605707733291&usg=AOvVaw1v4dJFgDD-5SmpSNZBu3J6) படி, ஒரு மெய்நிகர் முகவர் "ஒரு கணினி-உருவாக்கப்பட்ட, அனிமேஷன் செய்யப்பட்ட, செயற்கை நுண்ணறிவு மெய்நிகர் பாத்திரம் (பொதுவாக மானுடவியல் தோற்றத்துடன்) இது ஒரு ஆன்லைன் வாடிக்கையாளர் சேவை பிரதிநிதியாக செயல்படுகிறது".


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/3-stats.png" alt="வணிக முடிவெடுப்பவர்கள் Google இன் Business Messages வாடிக்கையாளர்களுடனான தொடர்புகளை மேம்படுத்தும் என்று நம்புகிறார்கள்"/>

*தனிப்பட்டதாக்குதல்: ஸ்மார்ட் தொடர்பு கருவிகள் வணிக முடிவுகளை எவ்வாறு இயக்குகின்றன ([ஆதாரம்](https://services.google.com/fh/files/misc/how_smart_communication_tools_drive_business_results.pdf)).*
</center>


ஒரு மெய்நிகர் முகவர் பெரும்பாலும் டிஜிட்டல் உதவியாளர் என்று குறிப்பிடப்படுகிறார். மெய்நிகர் முகவர்கள் தானியங்கி பதில்களை வழங்க இயற்கை மொழி செயலாக்கம் (NLP) எனப்படும் தொழில்நுட்பத்தைப் பயன்படுத்துகின்றனர். மெய்நிகர் முகவர்கள் பதிலளிப்பு நேரத்தைக் குறைப்பதன் மூலமும், 24/7 கிடைக்கும் தன்மையை வழங்குவதன் மூலமும், வாடிக்கையாளர் அனுபவத்தை மேம்படுத்துவதன் மூலமும் உங்கள் வணிகத்திற்கு பயனளிக்க முடியும். Google Business Messages உங்கள் வாடிக்கையாளர்களுக்கு உயர்தர தானியங்கி பதில்களை வழங்க எவ்வாறு உதவும்.

Google Business Messages இன் கூடுதல் நன்மைகள் பின்வருமாறு:
- உங்கள் வாடிக்கையாளர்களின் விசாரணைகளுக்கு உடனடி பதில்களை வழங்கவும்
- சிறந்த வாடிக்கையாளர் சேவையை வழங்குவதில் நேரத்தையும் பணத்தையும் சேமிக்கவும்
- உங்கள் வாடிக்கையாளர்களுடன் நம்பிக்கையை வளர்த்துக் கொள்ளுங்கள்

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/4-GBM_bridgepoint_runners.png" alt="Google Business Messages ஒரு மெய்நிகர் முகவரை Google Maps இல் உள்ள அரட்டை பொத்தானில் நேரடியாக ஒருங்கிணைக்கிறது"/>

*Google Business Messages ஒரு மெய்நிகர் முகவரை உங்கள் அரட்டை பொத்தானில் நேரடியாக ஒருங்கிணைக்கிறது.*
</center>


## வணிகங்கள் Google Business Messages ஐ எவ்வாறு செயல்படுத்துகின்றன

Google Business Messages உங்கள் வணிகத்திற்கு எவ்வாறு உதவும் என்பதைப் பற்றி நன்கு புரிந்துகொள்ள, Walmart, Levi's மற்றும் Albertsons Companies இன் சில எடுத்துக்காட்டுகளைப் பார்ப்போம்.

### 1. Walmart

Walmart ஆனது Business Messages ஐ செயல்படுத்திய முதல் நிறுவனங்களில் ஒன்றாகும் ([Google வலைப்பதிவு](https://blog.google/products/maps/now-sending-business-messages-google-maps-and-search/)). Google Business Messages உடன், Walmart ஆனது கடை நேரம், தயாரிப்புகள், COVID-19 தடுப்பூசி மற்றும் சோதனை, பிக்-அப் மற்றும் டெலிவரி விருப்பங்கள், திரும்பப் பெறும் கொள்கை மற்றும் பலவற்றைப் பற்றிய புதுப்பித்த தகவல்களை வழங்குகிறது. வாடிக்கையாளர்கள் எந்த நேரத்திலும் உடனடி பதில்களைப் பெறலாம்.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/5-walmart_chat.png" alt="வாடிக்கையாளர்கள் Google Maps இல் உள்ள அரட்டை பொத்தான் வழியாக Walmart ஐத் தொடர்பு கொள்ளலாம் (மொபைல் மட்டும்)"/>

*வாடிக்கையாளர்கள் Google Maps இல் உள்ள அரட்டை பொத்தான் வழியாக Walmart ஐத் தொடர்பு கொள்ளலாம் (மொபைல் மட்டும்).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/6-walmart_va.png" alt="வாடிக்கையாளர்கள் Walmart இன் மெய்நிகர் முகவரிடம் கடை நேரம், தயாரிப்புகள், முகமூடி கொள்கை, COVID-19 தடுப்பூசி மற்றும் பலவற்றைப் பற்றி கேட்கலாம்"/>

*வாடிக்கையாளர்கள் கடை நேரம், தயாரிப்புகள், முகமூடி கொள்கை, COVID-19 தடுப்பூசி மற்றும் பலவற்றைப் பற்றி கேட்கலாம்.*
</center>

### 2. Levi's


Levi's என்பது Levi's டெனிம் ஜீன்ஸுக்காக அறியப்பட்ட ஒரு ஆடை நிறுவனமாகும், இது 110 நாடுகளில் 3,100 சில்லறை கடைகளைக் கொண்டுள்ளது. தொற்றுநோய்களின் போது, Levi's ஆனது வாங்குபவர்கள் வாங்குவதற்கு முந்தைய ஆராய்ச்சியில் கணிசமான நேரத்தைச் செலவிடுவதையும், கடை நேரம் அடிக்கடி மாறக்கூடும் என்பதையும் கவனித்தது. Levi's ஆனது வாங்குபவர்களை உண்மையான வாடிக்கையாளர்களாக மாற்றவும், வாங்குபவர்களின் விசாரணைகளுக்கு விரைவான பதில்களை வழங்கவும் விரும்பியது.

ஜூன் 2020 இல், Levi's ஆனது Google Business Messages ஐ செயல்படுத்தியது, கடைகள் மற்றும் தயாரிப்புகள் பற்றிய புதுப்பித்த தகவல்களை வழங்குவதன் மூலம் வாடிக்கையாளர் அனுபவத்தை மேம்படுத்துவதை நோக்கமாகக் கொண்டது. Levi's ஆனது Google Business Messages இன் வாடிக்கையாளர்களுக்கு எந்த நேரத்திலும் உதவக்கூடிய திறனைப் பயன்படுத்திக் கொண்டது, இதன் விளைவாக 85% வாடிக்கையாளர் திருப்தி (CSAT) மதிப்பெண்களை அடைய முடிந்தது. Levi's ஆனது கடை தொடர்பான கேள்விகள் 30 மடங்கு அதிகமாக தீர்க்கப்பட்டதையும் கண்டது. Levi's ஆனது Google Business Messages ஐ எவ்வாறு செயல்படுத்தியது என்பதைப் பற்றி மேலும் அறிய [இங்கே](https://developers.google.com/business-communications/business-messages/files/levis-case-study.pdf) பார்க்கவும்.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/7-levi_chat.png" alt="வாடிக்கையாளர்கள் Google Maps இல் உள்ள அரட்டை பொத்தான் வழியாக Levi’s ஐத் தொடர்பு கொள்ளலாம் (மொபைல் மட்டும்)"/>

*வாடிக்கையாளர்கள் அரட்டை பொத்தான் வழியாக Levi’s ஐத் தொடர்பு கொள்ளலாம் (மொபைல் மட்டும்).*
</center>


<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/8-levi_va.png" alt="வாடிக்கையாளர்கள் Google Maps இல் Levi’s மெய்நிகர் முகவருடன் தொடர்பு கொள்ளும்போது Levi’s தயாரிப்புகளைப் பார்க்கலாம்"/>

*வாடிக்கையாளர்கள் Levi’s மெய்நிகர் முகவருடன் தொடர்பு கொள்ளும்போது Levi’s தயாரிப்புகளைப் பார்க்கலாம்.*
</center>


### 3. Albertsons Companies

Albertsons Co. ஆனது Safeway, Jewel-Osco, Vons, Albertsons, Shaw's மற்றும் பலவற்றை உள்ளடக்கிய அமெரிக்கா முழுவதும் பல மருந்தகங்களை வைத்துள்ளது. 2020 ஆம் ஆண்டின் பிற்பகுதியில், COVID-19 தடுப்பூசிகளின் ஆரம்ப வெளியீட்டின் போது, தடுப்பூசிகளுக்கான ஆன்லைன் தேடல்கள் அதிகரித்தன. தடுப்பூசி தகுதி, சந்திப்புகள் மற்றும் மக்கள் தடுப்பூசிகளை எங்கு பெறலாம் என்பது பற்றி மேலும் கேள்விகள் இருந்தன. Albertsons Co. ஆனது தகுதி அளவுகோல்கள், சந்திப்புகள், கிடைக்கும் தன்மை மற்றும் பலவற்றைப் பற்றிய புதுப்பித்த தகவல்களை வழங்க Google Business Messages ஐ செயல்படுத்த முடிவு செய்தது. இதன் விளைவாக, அவர்கள் உள்வரும் அழைப்புகளின் எண்ணிக்கையைக் குறைக்கவும், தவறான தகவல்களைத் தடுக்கவும், வாடிக்கையாளர்களுக்கு 24/7 உதவவும் முடிந்தது.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/9-albertsons_chat.png" alt="வாடிக்கையாளர்கள் Albertsons Co. இன் மெய்நிகர் முகவரிடமிருந்து தடுப்பூசி தகுதி பற்றிய தகவல்களைப் பெறலாம் மற்றும் நேரடியாக சந்திப்பை பதிவு செய்யலாம்"/>

*வாடிக்கையாளர்கள் தடுப்பூசி தகுதி பற்றிய தகவல்களைப் பெறலாம் மற்றும் சந்திப்பை பதிவு செய்யலாம்.*
</center>

Google Business Messages ஆனது மீண்டும் மீண்டும் வரும் விசாரணைகளுக்குப் பதிலளிப்பதிலும், வாடிக்கையாளர்களுடன் உறவுகளை உருவாக்குவதிலும், ஒட்டுமொத்த வாடிக்கையாளர் அனுபவத்தை மேம்படுத்துவதிலும் நேரத்தையும் பணத்தையும் சேமிப்பதற்கான ஒரு சிறந்த வழியாகும்.


## செயல்பாட்டிற்கான தடைகள்

மேலே காணப்பட்ட Google Business Messages இன் பொதுவான செயல்பாட்டில் இரண்டு முக்கிய வரம்புகள் உள்ளன.

முதலாவதாக, [ஒரு சிறந்த மெய்நிகர் முகவரை உருவாக்குவதும் பராமரிப்பதும் ஒரு எளிய பணி அல்ல](https://developers.google.com/business-communications/business-messages/guides/how-it-works); இதற்கு உரையாடல் AI பற்றிய மேம்பட்ட அறிவு மற்றும் கணிசமான வளர்ச்சி நேரம் தேவை. Google Business Messages ஐப் பயன்படுத்தும் வணிகங்கள், தங்களுக்கு முழுமையாகத் தனிப்பயனாக்கப்பட்ட அனுபவத்தை புதிதாக உருவாக்க ஒரு தொழில்முறை ஆலோசனை நிறுவனத்திற்கு பணம் செலுத்த வேண்டும். இவை பொதுவாக விலை உயர்ந்தவை மற்றும் பல மாதங்கள் ஆகலாம். Levi's, Walmart மற்றும் Albertsons Companies போன்ற பெரிய நிறுவனங்கள் அத்தகைய சிறப்பு சேவையை வாங்கக்கூடியவை. ஆலோசனை நிறுவனம் பொதுவாக தயாரிப்பின் வளர்ச்சி மற்றும் பராமரிப்பையும் முழுமையாகக் கட்டுப்படுத்துகிறது. நீங்கள் மாற்றங்களைச் செய்ய வேண்டியிருந்தால், நீங்கள் நிறுவனம் வழியாகச் செல்ல வேண்டும், இதற்கு கூடுதல் நேரம் எடுக்கும்.

இரண்டாவதாக, Google Business Messages ஆனது Google Business Profile இல் உள்ள செய்தியிடல் திறனுக்கு மாற்றாகும். வணிக உரிமையாளர்களாக, Google Business Profiles இல் அரட்டை பொத்தானை இயக்கவும், நீங்கள் கிடைக்கும்போது பதிலளிக்கவும் உங்களுக்கு முடியும். இருப்பினும், நீங்கள் Google Business Messages ஐ செயல்படுத்தும்போது, உங்கள் உள்வரும் செய்திகள் உங்கள் நேரடி முகவருக்கு அனுப்பப்படும், மேலும் Google Business Profile இல் அல்லது Google My Business பயன்பாட்டைப் பயன்படுத்தி வாடிக்கையாளர்களுடன் நேரடியாக அரட்டையடிக்கும் உங்கள் திறனை இழக்கிறீர்கள்.

<center>
<img src="/images/blog/10-use-Google-Business-Messages-to-engage-with-customers-off-hours/10-live_agent.png" alt="நேரடி அரட்டை தீர்வு வணிக உரிமையாளர்களை வாடிக்கையாளர்களுடன் நேரடியாக பேச அனுமதிக்கிறது"/>

*நேரடி அரட்டை தீர்வு இயக்கப்பட்டிருந்தால், வாடிக்கையாளர்கள் “நேரடி முகவருக்கு செய்தி அனுப்பு” என்பதைக் கிளிக் செய்து வணிக உரிமையாளர்களுடன் நேரடியாக பேச முடியும்.*
</center>


Google Business Messages ஐப் பயன்படுத்தும் போது உங்கள் வாடிக்கையாளர்களுடன் நேரடியாகப் பேச விரும்பினால், [ஆலோசனை நிறுவனத்திடம்](https://developers.google.com/business-communications/business-messages/partners) நேரடி அரட்டை தீர்வை வழங்கும்படி கேட்க வேண்டும். இந்த அம்சம் இயக்கப்பட்டிருந்தால், வாடிக்கையாளர்கள் “நேரடி முகவருக்கு செய்தி அனுப்பு” பொத்தானைக் கிளிக் செய்யலாம், பின்னர் நீங்கள் உரையாடலில் சேர்ந்து வாடிக்கையாளருடன் அரட்டையடிக்க முடியும். நேரடி முகவரின் பக்கத்திலிருந்து, ஆலோசனை நிறுவனம் ஒருங்கிணைக்கத் தேர்ந்தெடுத்த எந்த தளத்திலும் உரையாடல்கள் நடைபெறும்; இது உரை, WhatsApp, Messenger, Zendesk போன்ற ஏற்கனவே உள்ள வாடிக்கையாளர் சேவை மென்பொருள் அல்லது தனிப்பயனாக்கப்பட்ட வலைத்தளம் அல்லது தொலைபேசி பயன்பாடு வழியாக இருக்கலாம்.

இப்போது நீங்கள் யோசிக்கலாம், இந்த தடைகளை சமாளிக்க ஒரு தீர்வு இருக்கிறதா, ஆனால் Google Business Messages இன் நன்மைகளை இன்னும் பெற முடியுமா? அதனால்தான் எங்கள் சமீபத்திய தீர்வு, Near Me Messaging, மற்றும் அதனுடன் உங்கள் Google Maps அரட்டையை எவ்வாறு அதிகம் பயன்படுத்துவது என்பதை உங்களுக்குக் காட்ட விரும்புகிறோம்!

# 3. Near Me Messaging உடன் Google Maps அரட்டை

Near Me Messaging ஆனது அதிநவீன உரையாடல் AI ஐ Google Business Messages உடன் ஒருங்கிணைக்கிறது, இது உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தான் வழியாக வாடிக்கையாளர்களை எந்த நேரத்திலும் உங்கள் வணிகத்தை அடைய அனுமதிக்கிறது. இந்த வழியில், Near Me Messaging உங்கள் வாடிக்கையாளர் விசாரணைகளைக் கையாளும் போது உங்கள் வணிகத்தை கவனிப்பதில் நீங்கள் கவனம் செலுத்தலாம். Near Me Messaging ஐ ஒத்த சேவைகளிலிருந்து வேறுபடுத்துவது 5 நிமிட அமைவு நேரம், சுய சேவை தனிப்பயனாக்கம் மற்றும் உள்ளமைக்கப்பட்ட நேரடி அரட்டை ஆதரவு.

<center>
<img height="550" src="/images/blog/12-near-me-messaging-complements-google-business-messages/1-GBM-chat-button.png" alt="Near Me Messaging ஆனது Google Business Messages ஐ உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தானுடன் ஒருங்கிணைக்கிறது."/>

*Near Me Messaging ஆனது Google Business Messages ஐ உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தானுடன் ஒருங்கிணைக்கிறது.*
</center>

முதலாவதாக, வணிகங்கள் Google Business Messages ஐ ஒருங்கிணைக்கும்போது, தங்களுக்கு முழுமையாகத் தனிப்பயனாக்கப்பட்ட அனுபவத்தை புதிதாக உருவாக்க ஒரு தொழில்முறை ஆலோசனை நிறுவனத்திற்கு பணம் செலுத்த வேண்டும். இவை பொதுவாக விலை உயர்ந்தவை மற்றும் நேரம் எடுக்கும். Google Business Messages இன் நன்மைகளைப் பெற வழக்கமான நேரம் மற்றும் வள முதலீடு பல சிறு வணிகங்களுக்கு ஒரு தடையாக உள்ளது என்பதை நாங்கள் புரிந்துகொள்கிறோம். Near Me Messaging ஆனது SME களுக்கான மலிவு விலையில் தீர்வை வழங்குவதன் மூலம் இந்த வரம்பைத் தீர்க்கிறது. 5 நிமிடங்களுக்குள் ஒரு செயல்படும் மெய்நிகர் முகவரைப் பெறலாம். மேலும், Near Me Messaging வலைத்தளத்திலிருந்து எந்த நேரத்திலும் உங்கள் மெய்நிகர் முகவரைத் தொடர்ந்து புதுப்பிக்கலாம் மற்றும் தனிப்பயனாக்கலாம். Near Me Messaging தளத்தில் நீங்கள் செய்யும் மாற்றங்கள் உங்கள் முகவருடன் தொடர்பு கொள்ளும் வாடிக்கையாளர்களுக்கு உடனடியாக நடைமுறைக்கு வரும்.

கூடுதலாக, நீங்கள் Google Business Profile இல் அரட்டை பொத்தானை இயக்கும்போது, நீங்கள் கிடைக்கும்போது உங்கள் வாடிக்கையாளர்களுக்கு பதிலளிக்கும் திறன் உங்களுக்கு உள்ளது. ஆனால் நீங்கள் Google Business Messages ஐ ஒருங்கிணைக்கும்போது, உங்கள் உள்வரும் செய்திகள் உங்கள் நேரடி முகவருக்கு அனுப்பப்படும், மேலும் Google Business Profile இல் அல்லது Google My Business பயன்பாட்டைப் பயன்படுத்தி வாடிக்கையாளர்களுடன் நேரடியாக அரட்டையடிக்கும் உங்கள் திறனை இழக்கிறீர்கள். Near Me Messaging ஆனது கூடுதல் செலவு அல்லது அமைவு நேரம் இல்லாமல் நேரடி முகவர் அம்சத்தை வழங்குவதன் மூலம் இந்த வரம்பைத் தீர்க்கிறது. நேரடி முகவர் அம்சத்துடன், வாடிக்கையாளர்கள் எந்த நேரத்திலும் ஒரு உண்மையான நபருக்கு மாற்றும்படி கோரலாம். நீங்கள் ஒரு நேரடி முகவர் கோரிக்கையைப் பார்த்தால், அல்லது மெய்நிகர் முகவரை நீங்கள் பொறுப்பேற்க விரும்பினால், நீங்கள் உரையாடலில் சேர்ந்து உங்கள் வாடிக்கையாளர்களுடன் நேரடியாகப் பேசலாம்.

## Near Me Messaging இன் நன்மைகள்

### 1. சிறந்த வாடிக்கையாளர் சேவையை வழங்குவதில் நேரத்தையும் மனிதவளத்தையும் சேமிக்கிறது

நீங்கள் Near Me Messaging ஐப் பயன்படுத்தும்போது, உங்கள் Google Business Profile இலிருந்து வரும் தகவல்களின் அடிப்படையில் மிக அடிப்படையான கேள்விகளுக்கான பதில்கள் தானாகவே கையாளப்படும். உங்கள் Google Business Profile இல் அதிக தகவல்கள் இருந்தால், முகவர் அடிப்படை கேள்விகளுக்கு சிறப்பாக பதிலளிக்க முடியும். மேலும் உங்கள் Google Business Profile ஐப் புதுப்பிக்க விரும்பினால், போட் பதில்களை தானாகவே புதுப்பிக்க உங்கள் மாற்றங்களை Near Me உடன் ஒத்திசைக்கலாம். மெய்நிகர் முகவர் உங்கள் Google Maps சுயவிவரத்தில் அதிக நட்சத்திர மதிப்பீடு கொண்ட தொடர்புடைய பயனர் மதிப்புரைகளிலிருந்து பதில்களை உருவாக்கும். தானாக உருவாக்கப்பட்ட பதில்களுக்கு அப்பால், FAQ மற்றும் அறிவுத் தளத்தின் மூலம் மேலும் தனிப்பயன் உள்ளடக்கத்தைச் சேர்க்கலாம், இது அடுத்த பிரிவில் மேலும் விரிவாக விவாதிக்கப்படும்.

Near Me வலைத்தளத்தில் உள்நுழைந்த 5 நிமிடங்களுக்குள், உங்கள் சொந்த செயல்படும் மெய்நிகர் முகவரை நீங்கள் சோதிக்கலாம். உங்கள் மெய்நிகர் முகவர் வாடிக்கையாளர்களின் மீண்டும் மீண்டும் வரும் விசாரணைகளுக்கு 24/7 உடனடி பதில்களை வழங்க முடியும். இந்த வழியில், உங்கள் வாடிக்கையாளர்களுடன் உங்கள் உறவுகளை உருவாக்கலாம் மற்றும் பராமரிக்கலாம்.

<center>
<img src="/images/blog/12-near-me-messaging-complements-google-business-messages/2-custom-FAQ.png" alt="Near Me Messaging ஆனது மெய்நிகர் முகவரைத் தனிப்பயனாக்க ஒரு தனிப்பயன் FAQ அம்சத்தை வழங்குகிறது"/>

*எங்கள் தனிப்பயன் FAQ அம்சத்திலிருந்து எடுத்துக்காட்டு.*
</center>

### 2. சுய சேவை மற்றும் தனிப்பயனாக்கக்கூடிய திறன்கள்.

உங்கள் வணிக சுயவிவரம் மற்றும் வாடிக்கையாளர் மதிப்புரைகளிலிருந்து பதில்களை உருவாக்குவதோடு, Near Me Messaging ஆனது சுய சேவை தனிப்பயனாக்க திறன்களுடன் பொருத்தப்பட்டுள்ளது. உங்கள் மெய்நிகர் முகவரைத் தனிப்பயனாக்க, நீங்கள் தனிப்பயனாக்கக்கூடிய சில அடிப்படை அம்சங்கள் மெய்நிகர் முகவர் பெயர், வரவேற்பு செய்தி மற்றும் லோகோ ஆகும். மிக முக்கியமாக, உங்கள் வணிகத்திற்கு குறிப்பிட்ட பயனர் வினவல்களுக்கு தனிப்பயன் பதில்களை நீங்கள் உருவாக்கலாம். இது அடிக்கடி கேட்கப்படும் கேள்விகள் (FAQs) உருவாக்குவதன் மூலமும், உங்கள் வணிகம் பற்றிய கூடுதல் தகவல்களை (உங்கள் வலைத்தளத்திலிருந்து உரை போன்றவை) அறிவுத் தளத்தில் சேர்ப்பதன் மூலமும் செய்யப்படுகிறது.

உங்கள் முகவரைத் தனிப்பயனாக்கிய பிறகு, செயல்திறனில் நீங்கள் திருப்தி அடையும் வரை அதை தனிப்பட்ட முறையில் சோதிக்க உங்களுக்கு முடியும். நீங்கள் தயாரானதும், அதை Near Me Messaging வலைத்தளத்திலிருந்து நேரடியாகப் பொதுவில் தொடங்கலாம். உங்கள் மெய்நிகர் முகவரைப் பொதுவில் தொடங்கியதும், நீங்கள் தொடர்ந்து மாற்றங்களைச் செய்யலாம் மற்றும் உங்கள் மெய்நிகர் முகவரை மேலும் தனிப்பயனாக்கலாம். நீங்கள் மாற்றங்களைச் செய்யும்போது, அவற்றை பொதுவில் வெளியிடுவதற்கு முன் *"தனிப்பட்ட சோதனை"* தாவலுக்குச் சென்று அவற்றைச் சோதிக்கலாம். மாற்றங்களில் நீங்கள் மகிழ்ச்சியடைந்ததும், உங்கள் மெய்நிரல் முகவரின் பொதுப் பதிப்பை உடனடியாகப் புதுப்பிக்க *"பொது வெளியீடு"* பக்கத்திலிருந்து *"மீண்டும் தொடங்கு"* என்பதைக் கிளிக் செய்யலாம்.

<center>
<img src="/images/blog/13-launch-your-virtual-agent-on-Google-Maps-with-Near-Me-Messaging/9-relaunch.png" alt="Near Me Messaging ஆனது Google Business Messages ஐ உங்கள் Google Maps சுயவிவரத்தில் உள்ள அரட்டை பொத்தானுடன் ஒருங்கிணைக்கிறது."/>

*உங்கள் மெய்நிகர் முகவரில் மாற்றங்கள்/மேம்பாடுகளைச் செய்து முடித்ததும் "மீண்டும் தொடங்கு" பொத்தானைக் கிளிக் செய்யலாம்.*
</center>


Google Maps அரட்டையைச் செயல்படுத்த பல்வேறு முறைகளை இப்போது நீங்கள் அறிந்திருக்கிறீர்கள், உங்கள் அரட்டை அம்சத்தை எவ்வாறு அதிகம் பயன்படுத்துவது என்பதைப் பற்றி மேலும் அறிய விரும்புகிறீர்களா?

உங்கள் Google Maps அரட்டையை எவ்வாறு மேம்படுத்துவது என்பதைப் பகிரவும் விவாதிக்கவும் வணிக உரிமையாளர்களுக்காக [ஒரு Facebook குழுவை](https://www.facebook.com/groups/513092883608553) உருவாக்கியுள்ளோம். வணிக உரிமையாளர்கள் ஒருவருக்கொருவர் கேள்விகளைக் கேட்கலாம், தகவல்களைப் பகிரலாம் மற்றும் Google Maps அரட்டையை மேம்படுத்துவது குறித்த சமீபத்திய நிகழ்வுகள் அல்லது வெபினார்கள் பற்றி அறிவிக்கப்படலாம். இந்த வாய்ப்பை முழுமையாகப் பயன்படுத்த இப்போது சேரவும்!
`;export{e as default};
