const n=`---
title: "Discord (1/3): آفاق جديدة لتفاعل العملاء"
metatitle: "Discord (1/3): آفاق جديدة لتفاعل العملاء"
date: 2022-05-23 13:05:36-07:00
modified_date: 2025-07-28
draft: false
author: Kim Dodds
description: "في هذه المدونة، سنناقش صعود Discord ولماذا/كيف بدأت الشركات في استخدام Discord لتحسين تفاعل العملاء."
weight: 1
tags:
  - SeaX
  - Discord
image: images/blog/15-discord-a-new-frontier-for-customer-engagement/Discord_IAP_KeyVisuals_Header_02.jpg
canonicalURL: /blog/discord-a-new-frontier-for-customer-engagement/
url: /blog/discord-a-new-frontier-for-customer-engagement/
---


*ارتفعت أعداد مستخدمي Discord بشكل كبير في السنوات الأخيرة وأعاد المنصة تعريف نفسها كـ 'منزل لمجتمعاتك وأصدقائك'. في هذه المدونة، سنناقش صعود Discord ولماذا/كيف بدأت الشركات في استخدام Discord لتحسين تفاعل العملاء.*

## جدول المحتويات
- [Discord](#discord)
- [علاقات العملاء على Discord](#customer-relations-on-discord)
    - [ما وراء الألعاب](#going-beyond-gaming)
    - [ما وراء المجتمع](#going-beyond-community)

# Discord

في السنوات الأخيرة، انتقل Discord من كونه منصة متخصصة إلى علامة تجارية معروفة على نطاق واسع. عند إطلاقه في 2015، كان يستهدف اللاعبين الذين يرغبون في الدردشة أثناء اللعب عبر الإنترنت. المنصة منظمة في خوادم، ويمكن لكل خادم أن يحتوي على قنوات نصية أو صوتية متعددة. في السنوات الأخيرة، تمت إضافة ميزات مثل مكالمات الفيديو، مشاركة الشاشة، البث، والتكامل مع تطبيقات شهيرة أخرى.

ربما بسبب الجائحة، ارتفعت أعداد مستخدمي Discord بشكل كبير. [في 2019 كان لدى Discord 45 مليون مستخدم نشط؛ في 2020 ارتفع العدد إلى 100 مليون، ثم إلى 140 مليون في 2021](https://www.businessofapps.com/data/discord-statistics/). بعد أن اكتسب شعبية خارج مجال الألعاب، أعاد Discord تعريف نفسه كـ "منزل لمجتمعاتك وأصدقائك".

> "يستخدم الناس Discord لمجموعة متنوعة من الأنشطة: من حفلات الكاريوكي المباشرة، إلى الرسم الجماعي عبر مشاركة الشاشة، إلى حفلات الزفاف الافتراضية. ينشئ الناس خوادم Discord للألعاب، ودروس اليوغا، ونوادي المعجبين بالكوميديا، وحتى إدارة أعمال البودكاست. **Discord لأي شخص يحتاج إلى مكان للتحدث مع الأصدقاء والمجتمعات.**"

[Discord يجيب على "من يستخدم Discord؟" على الموقع الرسمي](https://discord.com/why-discord-is-different).

# علاقات العملاء على Discord

إذا كان العملاء يقضون بالفعل وقتًا كبيرًا على منصة واحدة، أليس من الأسهل الذهاب إليهم بدلاً من مطالبتهم بالقدوم إليك؟ بالنسبة لشركات الألعاب، هذا أمر بديهي. العديد من الألعاب لديها بالفعل خوادم Discord رسمية خاصة بها.

*الخادم الرسمي لـ [Fortnite](https://discord.com/invite/fortnite).*

علامات تجارية أخرى اختارت الاستفادة من جانب الألعاب للوصول إلى جمهورها على Discord. على سبيل المثال، قامت Ralph Lauren بحملة ترويجية شتوية من خلال بناء لعبة علامة تجارية على Roblox والتفاعل مع اللاعبين على Discord:

*لعبة Ralph Lauren الترويجية 'The Winter Escape' على Roblox.*

*خادم Discord الخاص بـ Roblox الذي يعرض لعبة Ralph Lauren الترويجية: 'The Winter Escape'*
`;export{n as default};
