const n=`---
title: "Discord (1/3): พรมแดนใหม่สำหรับการมีส่วนร่วมของลูกค้า"
metatitle: "Discord (1/3): พรมแดนใหม่สำหรับการมีส่วนร่วมของลูกค้า"
date: 2022-05-23 13:05:36-07:00
modified_date: 2025-07-28
draft: false
author: Kim Dodds
description: "ในบล็อกนี้ เราจะพูดถึงความนิยมที่เพิ่มขึ้นของ Discord และเหตุผล/วิธีที่บริษัทต่าง ๆ เริ่มใช้ Discord เพื่อเพิ่มการมีส่วนร่วมกับลูกค้า"
weight: 1
tags:
  - SeaX
  - Discord
image: images/blog/15-discord-a-new-frontier-for-customer-engagement/Discord_IAP_KeyVisuals_Header_02.jpg
canonicalURL: /blog/discord-a-new-frontier-for-customer-engagement/
url: /blog/discord-a-new-frontier-for-customer-engagement/
---


*จำนวนผู้ใช้ Discord เพิ่มขึ้นอย่างรวดเร็วในช่วงไม่กี่ปีที่ผ่านมา และแพลตฟอร์มนี้ได้รีแบรนด์ตัวเองเป็น 'บ้านสำหรับชุมชนและเพื่อน ๆ ของคุณ' ในบล็อกนี้ เราจะพูดถึงความนิยมที่เพิ่มขึ้นของ Discord และเหตุผล/วิธีที่บริษัทต่าง ๆ เริ่มใช้ Discord เพื่อเพิ่มการมีส่วนร่วมกับลูกค้า*

## สารบัญ
- [Discord](#discord)
- [ความสัมพันธ์กับลูกค้าบน Discord](#customer-relations-on-discord)
    - [มากกว่าการเล่นเกม](#going-beyond-gaming)
    - [มากกว่าชุมชน](#going-beyond-community)

# Discord

ในช่วงไม่กี่ปีที่ผ่านมา Discord ได้เปลี่ยนจากแพลตฟอร์มเฉพาะกลุ่มเป็นแบรนด์ที่เป็นที่รู้จักอย่างกว้างขวาง เมื่อเปิดตัวในปี 2015 กลุ่มเป้าหมายหลักคือเกมเมอร์ที่ต้องการแชทขณะเล่นเกมออนไลน์ แพลตฟอร์มนี้จัดเป็นเซิร์ฟเวอร์ และแต่ละเซิร์ฟเวอร์สามารถมีช่องข้อความหรือเสียงในหัวข้อต่าง ๆ ได้ ในช่วงหลัง ๆ มีการเพิ่มฟีเจอร์ เช่น วิดีโอคอล แชร์หน้าจอ สตรีมมิ่ง และการเชื่อมต่อกับแอปยอดนิยมอื่น ๆ

อาจเป็นเพราะสถานการณ์โควิด จำนวนผู้ใช้ Discord เพิ่มขึ้นอย่างรวดเร็ว [ในปี 2019 Discord มีผู้ใช้ 45 ล้านคน; ในปี 2020 เพิ่มเป็น 100 ล้านคน และในปี 2021 เป็น 140 ล้านคน](https://www.businessofapps.com/data/discord-statistics/) หลังจากได้รับความนิยมจากกลุ่มที่ไม่ใช่เกมเมอร์ Discord ได้รีแบรนด์ตัวเองเป็น "บ้านสำหรับชุมชนและเพื่อน ๆ ของคุณ"

> "ผู้คนใช้ Discord เพื่อกิจกรรมหลากหลายรูปแบบ: ตั้งแต่ร้องคาราโอเกะสด วาดภาพกลุ่มผ่านแชร์หน้าจอ ไปจนถึงงานแต่งงานเสมือนจริง ผู้คนสร้างเซิร์ฟเวอร์ Discord สำหรับเล่นเกม คลาสโยคะ คลับแฟนตลก และแม้แต่ธุรกิจพอดแคสต์ **Discord คือพื้นที่สำหรับทุกคนที่ต้องการพูดคุยกับเพื่อนและชุมชน**"

[Discord ตอบคำถาม "ใครใช้ Discord?" บนเว็บไซต์ทางการ](https://discord.com/why-discord-is-different)

# ความสัมพันธ์กับลูกค้าบน Discord

หากลูกค้าใช้เวลาส่วนใหญ่บนแพลตฟอร์มเดียวกัน จะง่ายกว่าหรือไม่ที่จะไปหาพวกเขาแทนที่จะให้พวกเขามาหาคุณ? สำหรับบริษัทเกม นี่คือเรื่องปกติ หลายเกมมีเซิร์ฟเวอร์ Discord อย่างเป็นทางการของตัวเอง

*เซิร์ฟเวอร์ [Fortnite](https://discord.com/invite/fortnite) อย่างเป็นทางการ*

แบรนด์อื่น ๆ ก็ใช้จุดเด่นด้านเกมเพื่อเข้าถึงกลุ่มเป้าหมายบน Discord เช่น Ralph Lauren ทำโปรโมชั่นฤดูหนาวโดยสร้างเกมแบรนด์บน Roblox และมีปฏิสัมพันธ์กับผู้เล่นบน Discord:

*เกมโปรโมชั่น 'The Winter Escape' ของ Ralph Lauren บน Roblox*

*เซิร์ฟเวอร์ Discord ของ Roblox ที่มีเกมโปรโมชั่น Ralph Lauren: 'The Winter Escape'*
`;export{n as default};
