const n=`---
title: "Discord (2/3): نحوه ایجاد یک انجمن و ربات دیسکورد برای برند شما"
metatitle: "Discord (2/3): انجمن و ربات دیسکورد برند خود را ایجاد کنید"
date: 2022-05-31 13:29:51-07:00
draft: false
author: Kim Dodds
description: "در این وبلاگ، ما به شما نحوه ایجاد یک سرور برای برند خود و اتصال یک ربات را آموزش می‌دهیم که می‌تواند وظایفی مانند مدیریت، گزارش اشکال، اطلاعیه‌ها و غیره را خودکار کند."
weight: 1
tags:
  - SeaX
  - Discord
image: /images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-and-bot-for-your-brand.jpg
canonicalURL: /blog/create-a-discord-community-and-bot/
url: /blog/create-a-discord-community-and-bot/
---

*پست وبلاگ ما، ["دیسکورد: مرز جدیدی برای تعامل با مشتری"](https://seasalt.ai/blog/15-discord-a-new-frontier-for-customer-engagement/)، به افزایش محبوبیت دیسکورد و چگونگی استفاده برندها از این پلتفرم اجتماعی جدید برای تشکیل جوامع آنلاین خود و تعامل با مشتریان پرداخت. در این وبلاگ، ما به شما نشان خواهیم داد که چگونه یک سرور رسمی جدید برای برند خود ایجاد کنید، از جمله نحوه اتصال یک ربات، که می‌تواند وظایفی مانند مدیریت، گزارش باگ، اطلاعیه‌ها و غیره را خودکار کند.*

## فهرست مطالب
- [راه‌اندازی سرور](#راه‌اندازی-سرور)
    - [ایجاد یک سرور دیسکورد جدید](#ایجاد-یک-سرور-دیسکورد-جدید)
    - [تبدیل سرور به "سرور جامعه"](#تبدیل-سرور-به-سرور-جامعه)
    - [تنظیم کانال‌ها، رویدادها و سایر ویژگی‌ها](#تنظیم-کانال‌ها-رویدادها-و-سایر-ویژگی‌ها)
    - [خبر را منتشر کنید!](#خبر-را-منتشر-کنید)
- [راه‌اندازی ربات دیسکورد](#راه‌اندازی-ربات-دیسکورد)
    - [ایجاد یک ربات جدید در پورتال توسعه‌دهنده دیسکورد](#ایجاد-یک-ربات-جدید-در-پورتال-توسعه‌دهنده-دیسکورد)
    - [ایجاد یک ربات دیسکورد ساده با PyCord](#ایجاد-یک-ربات-دیسکورد-ساده-با-pycord)
    - [دعوت از ربات دیسکورد](#دعوت-از-ربات-دیسکورد)
    - [تست یکپارچه‌سازی](#تست-یکپارچه‌سازی)

# راه‌اندازی سرور

## ایجاد یک سرور دیسکورد جدید
از داخل برنامه دیسکورد، روی دکمه "افزودن سرور" در سمت چپ پایین کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/create-new-discord-server.png" alt="ایجاد یک سرور دیسکورد جدید."/>

*اعلان هنگام ایجاد یک سرور دیسکورد جدید.*
</center>

می‌توانید از یک الگو انتخاب کنید اگر می‌خواهید با کانال‌هایی که برای شما ایجاد شده‌اند شروع کنید، یا می‌توانید با یک صفحه خالی شروع کنید. و اولین قدم به همین سادگی است، سرور شما ایجاد شد!

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-server.png" alt="یک سرور دیسکورد تازه ایجاد شده."/>

*یک سرور دیسکورد تازه ایجاد شده.*
</center>

## تبدیل سرور به "سرور جامعه"

به شدت توصیه می‌شود که ویژگی‌های "جامعه" سرور دیسکورد را فعال کنید. با تبدیل به یک سرور جامعه، ابزارهای اضافی را فعال می‌کنید که می‌توانند به مدیریت، اجرا و رشد سرور کمک کنند. به طور خاص، سرورهای جامعه به ویژگی‌های زیر دسترسی دارند:

- **صفحه خوش‌آمدگویی**: کاربران جدید را به سرور شما معرفی می‌کند
- **کانال اطلاعیه‌ها**: به شما امکان می‌دهد پیام‌ها را به کاربران خود پخش کنید
- **بینش سرور**: تجزیه و تحلیل جامعه و کاربران خود را مشاهده کنید
- **کشف**: جامعه خود را در فهرست سرورهای دیسکورد تبلیغ کنید

در کنار نام سرور در گوشه بالا سمت چپ، روی منوی کشویی کلیک کرده و "تنظیمات سرور" را انتخاب کنید. روی تب "فعال کردن جامعه" در سمت چپ کلیک کرده و "شروع کنید" را انتخاب کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/convert-to-community-discord-server.png" alt="تبدیل یک سرور دیسکورد معمولی به یک سرور جامعه."/>

*فعال کردن تنظیمات سرور جامعه.*
</center>

مراحل راه‌اندازی مورد نیاز را ادامه دهید. فعال کردن جامعه مستلزم این است که سرور شما تأییدیه اضافی برای کاربران انجام دهد، یک فیلتر چت را فعال کند و یک کانال قوانین راه‌اندازی کند.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-setup.png" alt="راه‌اندازی برای یک سرور دیسکورد جامعه."/>

*راه‌اندازی سرور جامعه.*
</center>

هنگامی که جامعه را فعال می‌کنید، به چندین ویژگی جدید دسترسی پیدا می‌کنید. دو مورد از مفیدترین ویژگی‌ها پیام خوش‌آمدگویی و غربالگری عضویت هستند:

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-welcome-page.png" alt="نمونه پیام خوش‌آمدگویی سرور."/>

*نمونه پیام خوش‌آمدگویی سرور.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-membership-screening.png" alt="تنظیمات غربالگری عضویت."/>

*تنظیمات غربالگری عضویت.*
</center>

## تنظیم کانال‌ها، رویدادها و سایر ویژگی‌ها
پس از راه‌اندازی سرور جامعه، به ویژگی‌های جدیدی از صفحه اصلی سرور نیز دسترسی پیدا می‌کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channel-types.png" alt="ایجاد یک کانال جدید در یک سرور دیسکورد.", style="width:50%"/>

*ایجاد یک کانال جدید.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channels.png" alt="نمونه‌ای از کانال‌های سرور جامعه دیسکورد." style="width:50%"/>

*کانال‌های سرور جامعه.*
</center>

هنگامی که یک کانال جدید ایجاد می‌کنید، به دو نوع کانال جدید دسترسی پیدا می‌کنید: اطلاعیه و صحنه. کانال اطلاعیه فقط توسط مدیران قابل ارسال است و برای پست‌ها و اطلاعیه‌های رسمی مفید است - بسیاری از سرورها ربات‌هایی دارند که به طور خودکار فید توییتر یا پست‌های انجمن رسمی خود را در این کانال ارسال می‌کنند. کانال "صحنه" نوع خاصی از کانال صوتی است که برای میزبانی رویدادها با مخاطبان زنده مفید است. میزبان توانایی مدیریت سایر سخنرانان را دارد (برخلاف یک کانال صوتی معمولی، که در آن همه آزادند صحبت کنند).

هنگامی که سرور شما به طور کامل راه‌اندازی شد، ممکن است چیزی شبیه به این باشد:

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/customized-discord-server.png" alt="سرور دیسکورد کاملاً سفارشی شده."/>

*سرور جامعه کاملاً سفارشی شده.*
</center>

## خبر را منتشر کنید!
هنگامی که سرور شما به طور کامل راه‌اندازی شد، می‌توانید شروع به دعوت از افراد کنید!
دیسکورد یک ویجت رایگان از پیش ساخته شده ارائه می‌دهد که می‌تواند در هر وب‌سایتی برای تبلیغ سرور شما جاسازی شود.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-widget.png" alt="تنظیمات ویجت سرور دیسکورد."/>

*تنظیمات ویجت سرور.*

<iframe src="https://discordapp.com/widget?id=966505646944055326&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>

*نمونه‌ای از یک ویجت فعال برای سرور دیسکورد Seasalt.ai Near Me Messaging.*

</center>

برای ایجاد اعتماد با کاربران بالقوه، می‌توانید به صورت اختیاری با پشتیبانی دیسکورد تماس بگیرید تا سرور خود را تأیید کنید. تأییدیه یک نماد "تأیید شده" را در کنار نام سرور شما قرار می‌دهد که نشان می‌دهد سرور جامعه رسمی یک کسب‌وکار، برند و چهره عمومی است. می‌توانید الزامات تأییدیه را در [سایت رسمی دیسکورد](https://support.discord.com/hc/en-us/articles/360001107231-Verified-Server-Requirements) مشاهده کنید.

هنگامی که سرور شما شروع به کار کرد و تعداد کاربران خوبی داشت، دیسکورد فرصت‌های بیشتری برای تبلیغ سرور شما به صورت داخلی ارائه می‌دهد. هنگامی که سرور شما حداقل ۸ هفته قدمت داشته باشد و ۵۰۰+ کاربر داشته باشد، می‌توانید برای همکاری با دیسکورد درخواست دهید، که به سرور شما امتیازات ویژه انحصاری شریک را می‌دهد. هنگامی که به ۱۰۰۰+ کاربر رسیدید، می‌توانید به کشف سرور بپیوندید، که به هر کسی که از دیسکورد استفاده می‌کند اجازه می‌دهد سرور شما را کشف کرده و به آن بپیوندد.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-discovery.png" alt="تنظیمات و الزامات کشف دیسکورد."/>

*تنظیمات و الزامات کشف دیسکورد.*
</center>

# راه‌اندازی ربات دیسکورد
اکنون که یک سرور راه‌اندازی کرده‌اید، می‌توانید با افزودن یک ربات برای خودکارسازی برخی فرآیندها، مانند مدیریت، بازخورد کاربر و اطلاعیه‌ها، آن را بهبود بخشید. بخش زیر را برای یادگیری نحوه راه‌اندازی یک ربات ساده بخوانید، و سپس برای وبلاگ بعدی در سری ما منتظر بمانید تا ببینید چگونه می‌توانید یک تجربه خدمات مشتری کامل را در سرور دیسکورد خود ادغام کنید.

## ایجاد یک ربات جدید در پورتال توسعه‌دهنده دیسکورد
در [پورتال توسعه‌دهنده دیسکورد](https://discord.com/developers/applications) یک حساب کاربری ایجاد کنید. یک "برنامه جدید" ایجاد کنید و نام آن را بگذارید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-application.png" alt="ایجاد یک برنامه جدید در پورتال توسعه‌دهنده دیسکورد."/>

*داشبورد توسعه‌دهنده دیسکورد: برنامه‌ها.*
</center>

برنامه جدید خود را انتخاب کرده و روی تب "ربات" در سمت چپ کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-bot.png" alt="تنظیمات ربات برنامه."/>

*تنظیمات برنامه دیسکورد.*
</center>

برای ایجاد ربات دیسکورد خود روی "افزودن ربات" کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-settings.png" alt="ایجاد یک ربات دیسکورد جدید."/>

*ایجاد یک ربات دیسکورد جدید.*
</center>

پس از ایجاد، توکن ربات را تولید و کپی کنید. در نهایت، مطمئن شوید که مجوزهای پیام‌رسانی روشن هستند.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-messaging-permissions.png" alt="مجوزهای پیام‌رسانی ربات دیسکورد."/>

*ایجاد یک ربات دیسکورد جدید.*
</center>

## ایجاد یک ربات دیسکورد ساده با PyCord

ما از [کتابخانه PyCord](https://docs.pycord.dev/en/master/) به عنوان یک پوشش پایتون برای API دیسکورد استفاده می‌کنیم.

۱. PyCord را نصب کرده و یک فایل پایتون جدید برای ربات دیسکورد خود ایجاد کنید.
۲. بسته دیسکورد را وارد کرده و یک نمونه از کلاینت دیسکورد ایجاد کنید.
۳. از پوشش \`event\` کلاینت برای ایجاد یک متد \`on_message\` استفاده کنید. این متد هر پیامی را که به کانالی که ربات به آن دسترسی دارد ارسال می‌شود، دریافت خواهد کرد.
    الف. در داخل متد، ابتدا بررسی کنید که آیا پیام از خود ربات است یا خیر، و در صورت مثبت بودن، آن را نادیده بگیرید.
    ب. در غیر این صورت، ما فقط به پیام‌هایی که با \`$bot\` شروع می‌شوند واکنش نشان خواهیم داد - اگر پیام با این شروع شود، ما فقط به همان کانال پاسخ خواهیم داد که \`پیام شما را دریافت کردم!\`.
۴. در نهایت، در پایان اسکریپت، مطمئن شوید که کلاینت دیسکورد را اجرا کنید تا شروع به گوش دادن به رویدادها در کانال کند.

\`\`\`python
import discord

discord_client = discord.Bot()
discord_token = “xxxxxxxxxxxx”
 
@discord_client.event
async def on_message(message):
    """Listen and react to messages."""
    # Check if the message is from the bot itself
    if message.author == discord_client.user:
        return

    msg = message.content
    if msg.startswith("$bot") or isinstance(message.channel, discord.DMChannel):
        await message.channel.send(“I got your message!”)

discord_client.run(discord_token)
\`\`\`

## دعوت از ربات دیسکورد
برای دعوت از ربات خود به سرور دیسکورد، به پورتال توسعه‌دهنده دیسکورد برگردید و روی تب OAuth2 در سمت چپ کلیک کنید. در بخش «Scopes»، «bot» را انتخاب کنید. در بخش «Bot Permissions»، «Send Messages» را انتخاب کنید. سپس، URL تولید شده را کپی کرده و در مرورگر خود باز کنید. این کار به شما امکان می‌دهد ربات را به سرور خود دعوت کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-oauth2-url.png" alt="ایجاد URL دعوت ربات دیسکورد."/>

*ایجاد URL دعوت ربات دیسکورد.*
</center>

## تست یکپارچه‌سازی
اکنون که ربات شما به سرور دعوت شده است، می‌توانید آن را آزمایش کنید. به کانالی که ربات به آن دسترسی دارد بروید و یک پیام با \`$bot\` در ابتدای آن ارسال کنید. ربات باید با «پیام شما را دریافت کردم!» پاسخ دهد.

<center>
<img src="/images/blog/16-how-to-create-a-discord-community-and-bot/discord-bot-test-integration.png" alt="تست یکپارچه‌سازی ربات دیسکورد."/>

*تست یکپارچه‌سازی ربات دیسکورد.*
</center>

این یک ربات دیسکورد بسیار ساده است، اما می‌توانید آن را گسترش دهید تا کارهای بسیار پیچیده‌تری انجام دهد. در وبلاگ بعدی در این سری، ما به شما نشان خواهیم داد که چگونه یک ربات دیسکورد را با یک پلتفرم پیام‌رسانی ابری مانند SeaChat ادغام کنید تا یک تجربه خدمات مشتری کامل را در سرور دیسکورد خود ارائه دهید.

title: "دیسکورد (۲/۳): چگونه یک انجمن و ربات دیسکورد برای برند خود بسازیم"
metatitle: "دیسکورد (۲/۳): انجمن و ربات دیسکورد برند خود را بسازید"
date: 2022-05-31T13:29:51-07:00
author: Kim Dodds
image: /images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-and-bot-for-your-brand.jpg
description: "در این وبلاگ، مراحل ساخت یک سرور برای برند شما و اتصال یک ربات که می‌تواند وظایفی مانند مدیریت، گزارش باگ، اطلاعیه‌ها و غیره را خودکار کند، بررسی می‌کنیم."
draft: false
weight: 1
tags: ["SeaX", "Discord"]
canonicalURL: "/blog/create-a-discord-community-and-bot/"
url: "/blog/create-a-discord-community-and-bot/"
aliases: 
    - /blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/
modified_date: 2025-08-06T10:51:56+09:00
---

*پست وبلاگ ما، [«دیسکورد: افق جدیدی برای تعامل با مشتری»](https://seasalt.ai/blog/15-discord-a-new-frontier-for-customer-engagement/)، به افزایش محبوبیت دیسکورد و اینکه چگونه برندها می‌توانند از این پلتفرم اجتماعی جدید برای تشکیل انجمن‌های آنلاین خود و تعامل با مشتریان استفاده کنند، پرداخت. در این وبلاگ، ما شما را با نحوه ساخت یک سرور رسمی جدید برای برندتان، شامل نحوه اتصال یک ربات که می‌تواند وظایفی مانند مدیریت، گزارش باگ، اطلاعیه‌ها و غیره را خودکار کند، آشنا می‌کنیم.*

## فهرست مطالب
- [راه‌اندازی سرور](#راه‌اندازی-سرور)
    - [ایجاد یک سرور جدید دیسکورد](#ایجاد-یک-سرور-جدید-دیسکورد)
    - [تبدیل سرور به «سرور انجمن»](#تبدیل-سرور-به-سرور-انجمن)
    - [راه‌اندازی کانال‌ها، رویدادها و سایر ویژگی‌ها](#راه‌اندازی-کانال‌ها-رویدادها-و-سایر-ویژگی‌ها)
    - [اطلاع‌رسانی کنید!](#اطلاع‌رسانی-کنید)
- [راه‌اندازی ربات دیسکورد](#راه‌اندازی-ربات-دیسکورد)
    - [ایجاد یک ربات جدید در پورتال توسعه‌دهندگان دیسکورد](#ایجاد-یک-ربات-جدید-در-پورتال-توسعه‌دهندگان-دیسکورد)
    - [ایجاد یک ربات ساده دیسکورد با PyCord](#ایجاد-یک-ربات-ساده-دیسکورد-با-PyCord)
    - [دعوت کردن ربات دیسکورد](#دعوت-کردن-ربات-دیسکورد)
    - [تست یکپارچه‌سازی](#تست-یکپارچه‌سازی)

# راه‌اندازی سرور

## ایجاد یک سرور جدید دیسکورد
از داخل اپلیکیشن دیسکورد، روی دکمه «افزودن سرور» در پایین سمت چپ کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/create-new-discord-server.png" alt="ایجاد یک سرور جدید دیسکورد."/>

*اعلان هنگام ایجاد یک سرور جدید دیسکورد.*
</center>

شما می‌توانید از یک قالب آماده استفاده کنید تا با کانال‌هایی که از قبل برای شما ایجاد شده‌اند شروع کنید، یا می‌توانید از ابتدا شروع کنید. و اولین قدم به همین سادگی است، سرور شما ایجاد شد!

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-server.png" alt="یک سرور دیسکورد تازه ایجاد شده."/>

*یک سرور دیسکورد تازه ایجاد شده.*
</center>

## تبدیل سرور به «سرور انجمن»

اکیداً توصیه می‌شود که ویژگی‌های «انجمن» سرور دیسکورد را فعال کنید. با تبدیل سرور به یک سرور انجمن، ابزارهای اضافی را فعال می‌کنید که می‌توانند به مدیریت، اجرا و رشد سرور کمک کنند. به طور خاص، سرورهای انجمن به ویژگی‌های زیر دسترسی دارند:

- **صفحه خوش‌آمدگویی**: کاربران جدید را به سرور شما معرفی می‌کند
- **کانال اعلانات**: به شما امکان می‌دهد پیام‌ها را برای کاربران خود پخش کنید
- **آمار سرور**: مشاهده تحلیل‌های مربوط به انجمن و کاربران شما
- **اکتشاف**: انجمن خود را در دایرکتوری سرور دیسکورد تبلیغ کنید

در کنار نام سرور در گوشه بالا سمت چپ، روی منوی کشویی کلیک کرده و «تنظیمات سرور» را انتخاب کنید. روی تب «فعال کردن انجمن» در سمت چپ کلیک کرده و «شروع کنید» را انتخاب کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/convert-to-community-discord-server.png" alt="تبدیل یک سرور عادی دیسکورد به یک سرور انجمن."/>

*فعال کردن تنظیمات سرور انجمن.*
</center>

مراحل راه‌اندازی مورد نیاز را طی کنید. فعال کردن انجمن مستلزم آن است که سرور شما تأیید هویت اضافی برای کاربران انجام دهد، فیلتر چت را فعال کند و یک کانال قوانین راه‌اندازی کند.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-setup.png" alt="راه‌اندازی برای یک سرور انجمن دیسکورد."/>

*راه‌اندازی سرور انجمن.*
</center>

هنگامی که انجمن را فعال می‌کنید، به چندین ویژگی جدید دسترسی پیدا می‌کنید. دو مورد از مفیدترین ویژگی‌ها، پیام خوش‌آمدگویی و غربالگری عضویت هستند:

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-welcome-page.png" alt="نمونه پیام خوش‌آمدگویی سرور."/>

*نمونه پیام خوش‌آمدگویی سرور.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-membership-screening.png" alt="تنظیمات غربالگری عضویت."/>

*تنظیمات غربالگری عضویت.*
</center>

## راه‌اندازی کانال‌ها، رویدادها و سایر ویژگی‌ها
پس از راه‌اندازی سرور انجمن، از صفحه اصلی سرور نیز به ویژگی‌های جدیدی دسترسی خواهید داشت.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channel-types.png" alt="ایجاد یک کانال جدید در سرور دیسکورد." style="width:50%"/>

*ایجاد یک کانال جدید.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channels.png" alt="نمونه‌ای از کانال‌های سرور انجمن دیسکورد." style="width:50%"/>

*کانال‌های سرور انجمن.*
</center>

وقتی یک کانال جدید ایجاد می‌کنید، به دو نوع کانال جدید دسترسی دارید: اعلانات و استیج. در کانال اعلانات فقط مدیران می‌توانند پست بگذارند و برای پست‌ها و اطلاعیه‌های رسمی مفید است - بسیاری از سرورها ربات‌هایی دارند که به طور خودکار فید توییتر رسمی یا پست‌های انجمن خود را در این کانال منتشر می‌کنند. کانال «استیج» نوع خاصی از کانال صوتی است که برای میزبانی رویدادها با مخاطبان زنده مفید است. میزبان توانایی مدیریت سایر سخنرانان را دارد (برخلاف یک کانال صوتی معمولی که در آن همه آزاد هستند).

وقتی سرور شما کاملاً راه‌اندازی شد، ممکن است چیزی شبیه به این به نظر برسد:

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/customized-discord-server.png" alt="سرور دیسکورد کاملاً سفارشی شده."/>

*سرور انجمن کاملاً سفارشی شده.*
</center>

## اطلاع‌رسانی کنید!
وقتی سرور شما کاملاً راه‌اندازی شد، می‌توانید شروع به دعوت از افراد کنید!
دیسکورد یک ویجت از پیش ساخته شده رایگان ارائه می‌دهد که می‌تواند در هر وب‌سایتی برای تبلیغ سرور شما تعبیه شود.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-widget.png" alt="تنظیمات ویجت سرور دیسکورد."/>

*تنظیمات ویجت سرور.*

<iframe src="https://discordapp.com/widget?id=966505646944055326&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>

*نمونه‌ای از یک ویجت کارا برای سرور دیسکورد Near Me Messaging متعلق به Seasalt.ai.*

</center>

برای ایجاد اعتماد در بین کاربران بالقوه، می‌توانید به صورت اختیاری با پشتیبانی دیسکورد تماس بگیرید تا سرور خود را تأیید کنید. تأیید یک آیکون «تأیید شده» در کنار نام سرور شما قرار می‌دهد که نشان می‌دهد سرور، انجمن رسمی وابسته به یک کسب‌وکار، برند و شخصیت مورد علاقه عمومی است. شما می‌توانید الزامات تأیید را در [سایت رسمی دیسکورد](https://support.discord.com/hc/en-us/articles/360001107231-Verified-Server-Requirements) مشاهده کنید.

هنگامی که سرور شما راه بیفتد و تعداد کاربران خوبی داشته باشد، دیسکورد فرصت‌های بیشتری برای تبلیغ سرور شما به صورت داخلی ارائه می‌دهد. هنگامی که سرور شما حداقل ۸ هفته عمر داشته باشد و بیش از ۵۰۰ کاربر داشته باشد، می‌توانید برای شراکت با دیسکورد درخواست دهید، که به سرور شما مزایای ویژه انحصاری شرکا را می‌دهد. هنگامی که به بیش از ۱۰۰۰ کاربر برسید، می‌توانید به بخش «اکتشاف سرور» بپیوندید، که به هر کسی که از دیسکورد استفاده می‌کند اجازه می‌دهد سرور شما را کشف کرده و به آن بپیوندد.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-discovery.png" alt="تنظیمات و الزامات اکتشاف دیسکورد."/>

*تنظیمات و الزامات اکتشاف دیسکورد.*
</center>

# راه‌اندازی ربات دیسکورد
حالا که یک سرور راه‌اندازی کرده‌اید، می‌توانید با افزودن یک ربات برای خودکارسازی برخی فرآیندها مانند مدیریت، بازخورد کاربر و اعلانات، آن را بهبود بخشید. بخش بعدی را بخوانید تا یاد بگیرید چگونه یک ربات ساده راه‌اندازی کنید و سپس منتظر وبلاگ بعدی در سری ما باشید تا ببینید چگونه می‌توانید یک تجربه خدمات مشتری کامل را در سرور دیسکورد خود ادغام کنید.

## ایجاد یک ربات جدید در پورتال توسعه‌دهندگان دیسکورد
یک حساب کاربری در [پورتال توسعه‌دهندگان دیسکورد](https://discord.com/developers/applications) ایجاد کنید. یک «اپلیکیشن جدید» ایجاد کرده و آن را نام‌گذاری کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-application.png" alt="ایجاد یک اپلیکیشن جدید در پورتال توسعه‌دهندگان دیسکورد."/>

*داشبورد توسعه‌دهنده دیسکورد: اپلیکیشن‌ها.*
</center>

اپلیکیشن جدید خود را انتخاب کرده و روی تب «ربات» در سمت چپ کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-bot.png" alt="تنظیمات ربات اپلیکیشن."/>

*تنظیمات اپلیکیشن دیسکورد.*
</center>

برای ایجاد ربات دیسکورد خود روی «افزودن ربات» کلیک کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-settings.png" alt="ایجاد یک ربات جدید دیسکورد."/>

*ایجاد یک ربات جدید دیسکورد.*
</center>

پس از ایجاد، توکن ربات را تولید و کپی کنید. در نهایت، مطمئن شوید که مجوزهای پیام‌رسانی روشن هستند.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-messaging-permissions.png" alt="مجوزهای پیام‌رسانی ربات دیسکورد."/>

*ایجاد یک ربات جدید دیسکورد.*
</center>

## ایجاد یک ربات ساده دیسکورد با PyCord

ما از [کتابخانه PyCord](https://docs.pycord.dev/en/master/) به عنوان یک پوشش پایتون برای API دیسکورد استفاده می‌کنیم.

1. PyCord را نصب کرده و یک فایل پایتون جدید برای ربات دیسکورد خود ایجاد کنید.
2. پکیج دیسکورد را وارد کرده و یک نمونه از کلاینت دیسکورد ایجاد کنید.
3. از پوشش رویداد کلاینت برای ایجاد یک متد \`on_message\` استفاده کنید. این متد هر پیامی را که به کانالی که ربات به آن دسترسی دارد ارسال شود، دریافت می‌کند.
    الف. در داخل متد، ابتدا بررسی کنید که آیا پیام از خود ربات است یا خیر، و اگر چنین است آن را نادیده بگیرید.
    ب. در غیر این صورت، ما فقط با واکنش به پیام‌هایی که با \`$bot\` شروع می‌شوند، کار را آغاز می‌کنیم - اگر پیام با این شروع شود، ما فقط به همان کانال پاسخ می‌دهیم و می‌گوییم \`«پیام شما را دریافت کردم!»\`.
4. در نهایت، در انتهای اسکریپت، مطمئن شوید که کلاینت دیسکورد را اجرا می‌کنید تا شروع به گوش دادن به رویدادها در کانال کند.python
import discord

discord_client = discord.Bot()
discord_token = “xxxxxxxxxxxx”
 
@discord_client.event
async def on_message(message):
    """به پیام‌ها گوش داده و واکنش نشان می‌دهد."""
    # بررسی می‌کند که آیا پیام از خود ربات است یا خیر
    if message.author == discord_client.user:
        return

    msg = message.content
    if msg.startswith("$bot") or isinstance(message.channel, discord.DMChannel):
        await message.channel.send(“«پیام شما را دریافت کردم!»”)

discord_client.run(discord_token)

### نکته‌ای در مورد کلاینت‌های پایتون دیسکورد

[Discord.py](https://github.com/Pycord-Development/pycord) محبوب‌ترین پروژه برای پوشش پایتون برای API دیسکورد است، با این حال، نویسنده و نگهدارنده [تصمیم گرفت کتابخانه را بازنشسته کند](https://gist.github.com/Rapptz/4a2f62751b9600a31a0d3c78100287f1). شما می‌توانید پوشش‌های پایتون جایگزین زیادی برای API دیسکورد پیدا کنید، و بسیاری از آنها فورک‌هایی از Discord.py اصلی هستند. ما PyCord را انتخاب کردیم زیرا به نظر می‌رسد به خوبی نگهداری می‌شود، از قبل از دستورات اسلش (Slash Commands) پشتیبانی می‌کند، و [یک سرور دیسکورد](https://pycord.dev/discord) دارد که در آن می‌توانیم سؤال بپرسیم.

هنگام ایجاد ربات دیسکورد، سعی کنید سایر پکیج‌های پایتون دیسکورد را نصب نکنید. *پکیج‌های پایتون دیسکورد معمولاً با هم خوب کار نمی‌کنند* زیرا همه آنها تحت توسعه جداگانه هستند. به عنوان مثال، PyCord با [discord-components](https://github.com/kiki7000/discord.py-components) خوب کار نمی‌کند، بنابراین مطمئن شوید که هر دو پکیج را به طور همزمان نصب نکرده‌اید.

## دعوت کردن ربات دیسکورد
در مرحله بعد، می‌توانید ربات را به سرور خود دعوت کنید. روی «OAuth2» -> «تولیدکننده URL» کلیک کنید. در تولیدکننده URL در سمت راست، «bot» را انتخاب کنید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-invite-url-generator.png" alt="تولید یک لینک دعوت برای ربات دیسکورد."/>

*تولید یک لینک دعوت برای ربات.*
</center>

در مرحله بعد، به پایین اسکرول کنید تا مجوزها را به ربات اضافه کنید. می‌توانید ربات را مدیر کنید، یا فقط مجوزهای مورد نیاز خود را انتخاب کنید (این امن‌تر است).

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-permissions.png" alt="تنظیمات مجوز ربات دیسکورد."/>

*تنظیمات مجوز ربات.*
</center>

در نهایت، URL تولید شده در پایین را کپی کرده و لینک را در یک تب جدید باز کنید. لینک شما را برای افزودن ربات به سروری که مدیریت می‌کنید، هدایت می‌کند.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/add-discord-bot-to-server.png" alt="افزودن ربات به سرور دیسکورد." style="width:50%"/>

*افزودن ربات به سرور.*
</center>

پس از اینکه ربات به سرور دعوت شد، روی ربات کلیک کرده و «افزودن به سرور» را کلیک کنید. از شما خواسته می‌شود که مجوز «ایجاد دستورات در سرور» را به ربات بدهید.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/confirm-discord-bot-permissions.png" alt="تأیید مجوزهای ربات دیسکورد." style="width:50%"/>

*تأیید مجوزهای ربات در سرور.*
</center>

## تست یکپارچه‌سازی
اکنون ربات شما باید متصل شده و به تمام فعالیت‌های سرور دیسکورد شما گوش دهد. ربات نمونه ارائه شده در کد بالا به سادگی پاسخ خواهد داد «پیام شما را دریافت کردم!» اگر کسی پیامی را تایپ کند که با رشته «$bot» شروع می‌شود. تطبیق رشته‌ای مانند این ساده‌ترین راه برای راه‌اندازی برخی اقدامات برای ربات شما است. با این حال، دیسکورد همچنین از دستورات اپلیکیشن بومی پشتیبانی می‌کند که پشتیبانی از ویژگی‌های بیشتری دارند. می‌توانید در مورد آنها در [مستندات رسمی API دیسکورد](https://discord.com/developers/docs/interactions/application-commands) بیشتر بخوانید. هنگامی که یکپارچه‌سازی اولیه ربات خود را راه‌اندازی کردید، آسمان حد و مرز خدماتی است که ربات شما می‌تواند به سرور شما ارائه دهد.

منتظر پست نهایی در سری وبلاگ ما باشید، که در آن به بررسی نحوه استفاده ما از محصولمان، [SeaX](https://seax.seasalt.ai/)، برای اتصال [پلتفرم مرکز تماس Twilio Flex](https://www.twilio.com/flex) به یک سرور انجمن دیسکورد خواهیم پرداخت. این یکپارچه‌سازی به برندها امکان می‌دهد نه تنها جامعه‌ای با مشتریان خود ایجاد کنند، بلکه یک کانال ارتباطی مستقیم را حفظ کرده و مشکلات را مستقیماً از درون جامعه آنلاین حل کنند.

برای اطلاعات بیشتر در مورد هر یک از راه‌حل‌های ما، از [ویکی محصولات Seasalt.ai](https://wiki.seasalt.ai) دیدن کنید - یا فرم [«رزرو دمو»](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) را پر کنید تا نگاهی از نزدیک داشته باشید.`;export{n as default};
