const n=`---
title: " ديسكورد (2/3): كيفية إنشاء مجتمع وروبوت ديسكورد لعلامتك التجارية"
metatitle: " ديسكورد (2/3): أنشئ مجتمع وروبوت ديسكورد لعلامتك التجارية"
date: 2022-05-31 13:29:51-07:00
modified_date: 2023-11-15 08:00:00-07:00
draft: false
author: Kim Dodds
description: "في هذه المدونة، سنستعرض خطوات إنشاء خادم لعلامتك التجارية وربط روبوت يمكنه أتمتة الإشراف والإبلاغ عن الأخطاء والإعلانات وما إلى ذلك."
weight: 1
tags:
  - SeaX
  - Discord
image: /images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-and-bot-for-your-brand.jpg
canonicalURL: /blog/create-a-discord-community-and-bot/
url: /blog/create-a-discord-community-and-bot/
---

*تناولت تدوينتنا السابقة، ["ديسكورد: أفق جديد لتفاعل العملاء"](https://seasalt.ai/blog/15-discord-a-new-frontier-for-customer-engagement/)، الشعبية المتزايدة لديسكورد وكيف يمكن للعلامات التجارية الاستفادة من هذه المنصة الاجتماعية الجديدة لتكوين مجتمعاتها الخاصة عبر الإنترنت والتفاعل مع العملاء. في هذه المدونة، سنستعرض كيفية إنشاء خادم رسمي جديد لعلامتك التجارية، بما في ذلك كيفية توصيل روبوت يمكنه أتمتة مهام مثل الإشراف، والإبلاغ عن الأخطاء، والإعلانات، وما إلى ذلك.*

## جدول المحتويات
- [إعداد الخادم](#إعداد-الخادم)
    - [إنشاء خادم ديسكورد جديد](#إنشاء-خادم-ديسكورد-جديد)
    - [تحويل الخادم إلى "خادم مجتمع"](#تحويل-الخادم-إلى-خادم-مجتمع)
    - [إعداد القنوات والفعاليات والميزات الأخرى](#إعداد-القنوات-والفعاليات-والميزات-الأخرى)
    - [انشر الخبر!](#انشر-الخبر)
- [إعداد روبوت ديسكورد](#إعداد-روبوت-ديسكورد)
    - [إنشاء روبوت جديد في بوابة مطوري ديسكورد](#إنشاء-روبوت-جديد-في-بوابة-مطور-ديسكورد)
    - [إنشاء روبوت ديسكورد بسيط باستخدام PyCord](#إنشاء-روبوت-ديسكورد-بسيط-باستخدام-PyCord)
    - [دعوة روبوت ديسكورد](#دعوة-روبوت-ديسكورد)
    - [اختبار التكامل](#اختبار-التكامل)

# إعداد الخادم

## إنشاء خادم ديسكورد جديد
من داخل تطبيق ديسكورد، انقر فوق زر "إضافة خادم" في الجانب الأيسر السفلي.

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/create-new-discord-server.png" alt="إنشاء خادم ديسكورد جديد."/>

*نافذة الحوار عند إنشاء خادم ديسكورد جديد.*

يمكنك الاختيار من قالب إذا كنت تريد البدء ببعض القنوات التي تم إنشاؤها لك، أو يمكنك البدء من الصفر. والخطوة الأولى سهلة للغاية، لقد تم إنشاء خادمك!

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-server.png" alt="خادم ديسكورد تم إنشاؤه حديثًا."/>

*خادم ديسكورد تم إنشاؤه حديثًا.*

## تحويل الخادم إلى "خادم مجتمع"

يوصى بشدة بتمكين ميزات "المجتمع" لخادم ديسكورد. من خلال التحويل إلى خادم مجتمع، فإنك تُمكّن أدوات إضافية يمكن أن تساعد في الإشراف على الخادم وتشغيله وتنميته. على وجه الخصوص، تتمتع خوادم المجتمع بالوصول إلى الميزات التالية:

- **شاشة الترحيب**: تقدم المستخدمين الجدد إلى خادمك
- **قناة الإعلانات**: تتيح لك بث الرسائل إلى المستخدمين
- **إحصاءات الخادم**: عرض تحليلات حول مجتمعك والمستخدمين
- **الاكتشاف**: أعلن عن مجتمعك في دليل خوادم ديسكورد

بجوار اسم الخادم في الزاوية العلوية اليسرى، انقر فوق القائمة المنسدلة وحدد "إعدادات الخادم". انقر فوق علامة التبويب "تمكين المجتمع" على الجانب الأيسر وحدد "ابدأ".

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/convert-to-community-discord-server.png" alt="تحويل خادم ديسكورد عادي إلى خادم مجتمع."/>

*تمكين إعدادات خادم المجتمع.*

تابع من خلال الإعداد المطلوب. يتطلب تمكين المجتمع أن يقوم خادمك بإجراء تحقق إضافي للمستخدمين، وتمكين مرشح الدردشة، وإعداد قناة للقواعد.

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-community-setup.png" alt="إعداد خادم مجتمع ديسكورد."/>

*إعداد خادم المجتمع.*

بمجرد تمكين المجتمع، يمكنك الوصول إلى العديد من الميزات الجديدة. اثنتان من أكثر الميزات فائدة هما رسالة الترحيب وفحص العضوية:

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-welcome-page.png" alt="مثال على رسالة ترحيب الخادم."/>

*مثال على رسالة ترحيب الخادم.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-membership-screening.png" alt="إعدادات فحص العضوية."/>

*إعدادات فحص العضوية.*

## إعداد القنوات والفعاليات والميزات الأخرى
بعد إعداد خادم المجتمع، يمكنك الوصول إلى ميزات جديدة من صفحة الخادم الرئيسية أيضًا.

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channel-types.png" alt="إنشاء قناة جديدة في خادم ديسكورد." style="width:50%"/>

*إنشاء قناة جديدة.*

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-channels.png" alt="مثال على قنوات خادم مجتمع ديسكورد." style="width:50%"/>

*قنوات خادم المجتمع.*

عندما تنشئ قناة جديدة، يمكنك الوصول إلى نوعين جديدين من القنوات: الإعلانات والمسرح. لا يمكن النشر في قناة الإعلانات إلا من قبل المشرفين، وهي مفيدة للمشاركات والإعلانات الرسمية - ستقوم العديد من الخوادم بوجود روبوتات تنشر تلقائيًا موجز تويتر الرسمي أو منشورات المنتدى في هذه القناة. قناة "المسرح" هي نوع خاص من القنوات الصوتية المفيدة لاستضافة الفعاليات مع جمهور مباشر. يتمتع المضيف بالقدرة على الإشراف على المتحدثين الآخرين (على عكس القناة الصوتية العادية، حيث تكون الأمور فوضوية).

بمجرد إعداد خادمك بالكامل، قد يبدو شيئًا كهذا:

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/customized-discord-server.png" alt="خادم ديسكورد مخصص بالكامل."/>

*خادم مجتمع مخصص بالكامل.*

## انشر الخبر!
بمجرد إعداد خادمك بالكامل، يمكنك البدء في دعوة الناس!
يقدم ديسكورد أداة واجهة مجانية جاهزة، يمكن تضمينها في أي موقع ويب للإعلان عن خادمك.

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-widget.png" alt="إعدادات أداة واجهة خادم ديسكورد."/>

*إعدادات أداة واجهة الخادم.*

<iframe src="https://discordapp.com/widget?id=966505646944055326&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>

*مثال على أداة واجهة عاملة لخادم ديسكورد Near Me Messaging الخاص بـ Seasalt.ai.*


لبناء الثقة مع المستخدمين المحتملين، يمكنك اختياريًا التواصل مع دعم ديسكورد للتحقق من خادمك. سيضع التحقق أيقونة "تم التحقق منه" بجوار اسم خادمك مما يشير إلى أن الخادم هو المجتمع الرسمي التابع لشركة أو علامة تجارية أو شخصية ذات اهتمام عام. يمكنك الاطلاع على متطلبات التحقق على [موقع ديسكورد الرسمي](https://support.discord.com/hc/en-us/articles/360001107231-Verified-Server-Requirements).

بمجرد أن يبدأ خادمك في العمل ويحظى بعدد جيد من المستخدمين، يقدم ديسكورد المزيد من الفرص للإعلان عن خادمك داخليًا. عندما يبلغ عمر خادمك 8 أسابيع على الأقل ولديه 500+ مستخدم، يمكنك التقدم بطلب للحصول على شراكة ديسكورد، والتي تمنح خادمك امتيازات خاصة حصرية للشركاء. بمجرد أن تصل إلى 1000+ مستخدم، يمكنك الانضمام إلى اكتشاف الخادم، والذي سيسمح لأي شخص يستخدم ديسكورد باكتشاف خادمك والانضمام إليه.

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-server-discovery.png" alt="إعدادات ومتطلبات اكتشاف ديسكورد."/>

*إعدادات ومتطلبات اكتشاف ديسكورد.*

# إعداد روبوت ديسكورد
الآن بعد أن قمت بإعداد خادم، يمكنك تحسينه عن طريق إضافة روبوت لأتمتة بعض العمليات، مثل الإشراف، وتعليقات المستخدمين، والإعلانات. استمر في قراءة القسم التالي لمعرفة كيفية إعداد روبوت بسيط، ثم ترقب المدونة التالية في سلسلتنا لترى كيف يمكنك دمج تجربة خدمة عملاء كاملة داخل خادم ديسكورد الخاص بك.

## إنشاء روبوت جديد في بوابة مطوري ديسكورد
أنشئ حسابًا على [بوابة مطوري ديسكورد](https://discord.com/developers/applications)。 أنشئ "تطبيقًا جديدًا" وقم بتسميته。

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-application.png" alt="إنشاء تطبيق جديد على بوابة مطوري ديسكورد."/>

*لوحة تحكم مطوري ديسكورد: التطبيقات.*

حدد تطبيقك الجديد وانقر فوق علامة التبويب "روبوت" على الجانب الأيسر。

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/new-discord-bot.png" alt="إعدادات روبوت التطبيق."/>

*إعدادات تطبيق ديسكورد.*

انقر فوق "إضافة روبوت" لإنشاء روبوت ديسكورد الخاص بك。

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-settings.png" alt="إنشاء روبوت ديسكورد جديد."/>

*إنشاء روبوت ديسكورد جديد.*

بمجرد إنشائه، قم بإنشاء ونسخ رمز الروبوت. أخيرًا، تأكد من تشغيل أذونات المراسلة。

<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-messaging-permissions.png" alt="أذونات مراسلة روبوت ديسكورد."/>

*إنشاء روبوت ديسكورد جديد.*

## إنشاء روبوت ديسكورد بسيط باستخدام PyCord

نحن نستخدم [مكتبة PyCord](https://docs.pycord.dev/en/master/) كغلاف بايثون لواجهة برمجة تطبيقات ديسكورد.

1.  قم بتثبيت PyCord وإنشاء ملف بايثون جديد لروبوت ديسكورد الخاص بك.
2.  قم باستيراد حزمة ديسكورد وإنشاء مثيل من عميل ديسكورد.
3.  استخدم غلاف الحدث للعميل لإنشاء طريقة \`on_message\`. ستتلقى هذه الطريقة كل رسالة يتم إرسالها إلى قناة يتمتع الروبوت بالوصول إليها.
    أ. داخل الطريقة، تحقق أولاً مما إذا كانت الرسالة من الروبوت نفسه، وتجاهلها إذا كان الأمر كذلك.
    ب. بخلاف ذلك، سنبدأ فقط بالتفاعل مع الرسائل التي تبدأ بـ \`$bot\` - إذا بدأت الرسالة بهذا، فسنرد فقط على نفس القناة قائلين \`لقد استلمت رسالتك!\`.
4.  أخيرًا، في نهاية البرنامج النصي، تأكد من تشغيل عميل ديسكورد حتى يبدأ في الاستماع للأحداث في القناة.

\`\`\`python
import discord

discord_client = discord.Bot()
discord_token = "xxxxxxxxxxxx"
 
@discord_client.event
async def on_message(message):
    """الاستماع إلى الرسائل والتفاعل معها."""
    # التحقق مما إذا كانت الرسالة من الروبوت نفسه
    if message.author == discord_client.user:
        return

    msg = message.content
    if msg.startswith("$bot") or isinstance(message.channel, discord.DMChannel):
        await message.channel.send("لقد استلمت رسالتك!")

discord_client.run(discord_token)
\`\`\`

### ملاحظة حول عملاء ديسكورد بلغة بايثون

[Discord.py](https://github.com/Pycord-Development/pycord) هو المشروع الأكثر شيوعًا لغلاف بايثون لواجهة برمجة تطبيقات ديسكورد، ومع ذلك، قرر المؤلف والمشرف [إيقاف المكتبة](https://gist.github.com/Rapptz/4a2f62751b9600a31a0d3c78100287f1). يمكنك العثور على العديد من أغلفة بايثون البديلة لواجهة برمجة تطبيقات ديسكورد، والعديد منها هي تفرعات من Discord.py الأصلي. اخترنا استخدام PyCord لأنه يبدو أنه يتم صيانته جيدًا، ويدعم بالفعل أوامر الشرطة المائلة (Slash Commands)، ولديه [خادم ديسكورد](https://pycord.dev/discord) حيث يمكننا طرح الأسئلة.

عند إنشاء روبوت ديسكورد، حاول عدم تثبيت حزم بايثون ديسكورد أخرى. *لا تعمل حزم بايثون ديسكورد عادةً بشكل جيد معًا* لأنها جميعًا قيد التطوير المنفصل. على سبيل المثال، لا يعمل PyCord بشكل جيد مع [discord-components](https://github.com/kiki7000/discord.py-components) لذا تأكد من عدم تثبيت كلتا الحزمتين في نفس الوقت.

## دعوة روبوت ديسكورد

ارجع إلى صفحة تطبيق الروبوت في بوابة مطوري ديسكورد وانتقل إلى علامة التبويب "OAuth2". ضمن "النطاقات"، حدد "روبوت"، ثم ضمن "أذونات الروبوت"، حدد الأذونات التي يحتاجها الروبوت الخاص بك. بالنسبة للروبوت البسيط الخاص بنا، سنحتاج فقط إلى "إرسال الرسائل".

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-oauth-permissions.png" alt="أذونات OAuth لروبوت ديسكورد."/>

*أذونات OAuth لروبوت ديسكورد.*
</center>

انسخ رابط الدعوة الذي تم إنشاؤه وافتحه في متصفحك. اختر الخادم الذي تريد إضافة الروبوت إليه وانقر على "تفويض".

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-invite.png" alt="دعوة روبوت ديسكورد إلى خادم."/>

*دعوة روبوت إلى خادم ديسكورد.*
</center>

## اختبار التكامل

الآن بعد أن أصبح الروبوت الخاص بك في الخادم، يمكنك تشغيل برنامج بايثون النصي الذي أنشأته. بمجرد تشغيله، يجب أن ترى الروبوت الخاص بك يظهر على الإنترنت في قائمة أعضاء الخادم.

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-online.png" alt="روبوت ديسكورد متصل بالإنترنت."/>

*روبوت ديسكورد متصل بالإنترنت.*
</center>

الآن، في أي قناة يمكن للروبوت الوصول إليها، اكتب \`$bot Hello World!\` ويجب أن يرد الروبوت بـ \`لقد استلمت رسالتك!\`

<center>
<img src="/images/blog/16-discord-how-to-create-a-discord-community-and-bot-for-your-brand/discord-bot-test-integration.png" alt="اختبار تكامل روبوت ديسكورد."/>

*اختبار تكامل روبوت ديسكورد.*
</center>

تهانينا! لقد قمت بإنشاء خادم ديسكورد، وقمت بإعداد روبوت ديسكورد، وقمت بدمجهما معًا. في المدونة التالية في هذه السلسلة، سنستعرض كيفية دمج روبوت ديسكورد الخاص بك مع SeaChat لتقديم تجربة خدمة عملاء كاملة داخل خادم ديسكورد الخاص بك.
يجب أن يكون الروبوت الخاص بك الآن متصلاً ويستمع إلى كل الأحداث في خادم ديسكورد الخاص بك. سيستجيب الروبوت النموذجي المقدم في الكود أعلاه ببساطة بـ "لقد استلمت رسالتك!" إذا كتب شخص ما رسالة تبدأ بالسلسلة "$bot". يعد مطابقة السلاسل مثل هذه أسهل طريقة لإعداد بعض الإجراءات لروبوتك. ومع ذلك، يدعم ديسكورد أيضًا أوامر التطبيق الأصلية التي تتمتع بمزيد من دعم الميزات. يمكنك قراءة المزيد عنها [في وثائق واجهة برمجة تطبيقات ديسكورد الرسمية](https://discord.com/developers/docs/interactions/application-commands). بمجرد إعداد تكامل الروبوت الأولي الخاص بك، فإن السماء هي الحد الأقصى للخدمات التي يمكن أن يقدمها الروبوت الخاص بك إلى خادمك.

ترقبوا آخر منشور في سلسلة مدوناتنا، والذي سيشرح بالتفصيل كيف استخدمنا منتجنا، [SeaX](https://seax.seasalt.ai/)، لربط [منصة مركز الاتصال Twilio Flex](https://www.twilio.com/flex) بخادم مجتمع ديسكورد. يتيح هذا التكامل للعلامات التجارية ليس فقط تعزيز المجتمع مع عملائها، ولكن أيضًا الحفاظ على قناة اتصال مباشرة ومعالجة المشكلات مباشرة من داخل المجتمع عبر الإنترنت.

لمزيد من المعلومات حول أي من حلولنا، قم بزيارة [ويكي منتجات Seasalt.ai](https://wiki.seasalt.ai) - أو املأ [نموذج "حجز عرض توضيحي"](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) لإلقاء نظرة مباشرة.`;export{n as default};
