const n=`---
title: "مرحبًا بكم في SeaX، مركز اتصال سحابي تعاوني"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "في هذه المدونة، سنقدم SeaX، حل مركز الاتصال السحابي الخاص بنا. هذه هي الأولى في سلسلة من المدونات التي ستقدم وتوضح ميزات SeaX بالتفصيل."
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*في هذه المدونة، سنقدم SeaX، حل مركز الاتصال السحابي الخاص بنا. هذه هي الأولى في سلسلة من المدونات التي ستقدم وتوضح ميزات SeaX بالتفصيل.*

# ما هو SeaX؟

SeaX (يُنطق "CX"، وهو اختصار شائع لـ Customer eXperience) هو حل مركز اتصال سحابي تعاوني. تم تصميمه بمرونة كبيرة لإنشاء تجربة مركز اتصال قابلة للتخصيص لكل عميل على حدة، مع توفير حل جاهز للتشغيل بسرعة.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="يربط SeaX ويُكوّن اللبنات الأساسية لـ Twilio Flex لمساعدتك على سد الفجوة بين وكلائك وعملائك.">
</center>

*يربط SeaX ويُكوّن اللبنات الأساسية لـ Twilio Flex لمساعدتك على سد الفجوة بين وكلائك وعملائك.*

# ما الذي يميز SeaX عن مراكز الاتصال التقليدية؟

قابلية التخصيص والمرونة والأتمتة هي جوهر SeaX. يمكن تخصيص SeaX على مستوى واجهة برمجة التطبيقات (API)، مما يسهل التعديل من واجهة المستخدم إلى دمج أنظمة CRM أو ERP الداخلية. لن يكون العملاء مقيدين بكيفية تكوين مركز الاتصال في البداية، بل يمكنهم الاستمرار في ضبطه مع نمو الأعمال. لتحقيق نفس المستوى من قابلية التخصيص، تتطلب مراكز الاتصال التقليدية وقتًا ومالًا كبيرين للإعداد، بدءًا من البنية التحتية المادية إلى تكوين قناة الاتصال ودمج كل نظام مطلوب. هذا يمكن أن يجعل إعداد أي جزء جديد من مركز الاتصال مكلفًا ويستغرق وقتًا طويلاً. مع SeaX، يمكن إعداد وكلائك وتكوين نظام مركز الاتصال الخاص بك في أقل من أسبوع واحد، مما يتيح لك تشغيل مركز الاتصال الخاص بك بسرعة وسهولة.

في مراكز الاتصال التقليدية، غالبًا ما تكون هناك حاجة للتبديل بين برامج وأنظمة متعددة لإكمال تفاعل العميل. سواء كانت صعوبة نقل معلومات العميل من مكالمة هاتفية أرضية إلى نظام CRM، أو التبديل بين تطبيقات المراسلة المتعددة للتواصل مع العملاء، فإن وجود وظائف مختلفة في برامج منفصلة يبطئ العمل ويجعله أكثر صعوبة. يدمج SeaX جميع وظائف مركز الاتصال في واجهة واحدة، مما يسمح لوكلائك بتلقي المكالمات والرسائل من جميع القنوات في مكان واحد، وإكمال المهام الأخرى أيضًا، مثل تسجيل معلومات المحادثة في نظام CRM أو تدوين ملاحظات تذاكر الدعم، مباشرة في الواجهة. وهذا يسمح لوكلائك بأن يكونوا أكثر كفاءة ويركزوا على المهمة المطروحة، بدلاً من البحث عن نافذة ملاحظاتهم.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="يقدم SeaX جميع المكالمات والرسائل في واجهة واحدة، بالإضافة إلى توفير الوصول إلى الأنظمة المتكاملة مثل إدارة الحالات.">
</center>

*يقدم SeaX جميع المكالمات والرسائل في واجهة واحدة، بالإضافة إلى توفير الوصول إلى الأنظمة المتكاملة مثل إدارة الحالات.*

يتيح لك هذا التكامل الوثيق داخل SeaX أيضًا تتبع ومراقبة كل ما يحدث في مركز الاتصال الخاص بك عن كثب. نظرًا لأن كل تفاعل مع عملائك يحدث على نفس المنصة، فإن جميع بيانات مركز الاتصال الخاص بك متاحة بسهولة للمراجعة والاستخدام في التحليلات. يمكنك مراقبة أداء الوكلاء عبر جميع قنوات الاتصال، بدءًا من مراجعة نصوص الدردشة وتسجيلات المكالمات، إلى تتبع وقت المعالجة أسبوعًا بعد أسبوع، إلى تقييمات أداء الوكلاء المخصصة. باستخدام Flex Insights، يمكنك إنشاء لوحات معلومات تحليلية لتتبع مؤشرات الأداء الرئيسية لمركز الاتصال الخاص بك، مع مراقبة دقيقة لأي تغييرات في الأداء.

تعد المرونة في تنسيق العديد من البلدان والأرقام والوكلاء مفتاح نجاح مركز الاتصال متعدد الجنسيات، خاصة في بيئة بعيدة تمامًا. لقد كان من الصعب على مراكز الاتصال التقليدية التوسع في بلدان مختلفة أو فتح مراكز اتصال جديدة في أجزاء مختلفة من العالم. توجد قواعد ولوائح مختلفة بشأن الاتصال بالعملاء حسب البلد، وضمان أن جميع مراكز الاتصال الخاصة بك تعمل بنفس الطريقة وتنتقل المكالمات بينها بسلاسة مع احترام اللوائح والمناطق الزمنية المختلفة هو مهمة صعبة. يتعامل SeaX مع هذه المواقف نيابة عنك، مما يسمح لك بتكوين أشياء مثل ساعات العمل لكل موقع، ودعم جميع وكلائك على منصة واحدة، بغض النظر عن مكان وجودهم الفعلي.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="قم بتخصيص ساعات العمل حسب رقم الهاتف، حتى تتمكن من التحكم في الإعدادات بشكل منفصل لمواقعك المنفصلة حول العالم.">
</center>

*قم بتخصيص ساعات العمل حسب رقم الهاتف، حتى تتمكن من التحكم في الإعدادات بشكل منفصل لمواقعك المنفصلة حول العالم.*

# كيف يمكن للذكاء الاصطناعي مساعدة الوكلاء وتمكينهم؟

تُدمج أتمتة الذكاء الاصطناعي في كل مستوى من مستويات SeaX، حيث تتولى المهام البسيطة والمتكررة وتسمح لوكلائك بالتركيز على المكالمات الأكبر والأكثر تعقيدًا التي تحتاج إلى اهتمامهم.

في SeaX، يُطلق على الوكلاء اسم Super Agents لأنهم يعملون بالتعاون مع وكلاء الذكاء الاصطناعي. هناك وكلاء افتراضيون يمكن للعملاء ربطهم بهاتفك وقنوات المراسلة الخاصة بك والتي يمكنها التعامل مع المهام الأساسية لك، ولا تمرر العميل إلى وكيل مباشر إلا عند الضرورة. هناك مجموعة واسعة من الاستخدامات لذلك، من وكيل افتراضي يمكنه جدولة المواعيد وإضافتها تلقائيًا إلى التقويم، إلى وكيل افتراضي يمكنه البحث عن عميل في نظام CRM والتحقق من حالة طلبه. وهذا يزيل عبء هذه المهام البسيطة عن وكلائك ويحررهم للتعامل مع العملاء الآخرين الذين لديهم مشكلات أكثر تعقيدًا.

يستخدم SeaX أيضًا أتمتة الذكاء الاصطناعي في أماكن أخرى لمساعدة وكلائك في الوصول بسهولة أكبر إلى المعلومات التي يحتاجونها. تبحث قاعدة المعرفة المتكاملة لـ SeaX تلقائيًا في قاعدة المعرفة الخاصة بك بينما يتحدث الوكيل مع العميل، وتوفر للوكيل مقالات المساعدة الأكثر تشابهًا مع المحادثة الحالية، مما يضع تلك المعلومات في متناول الوكيل. سيرسل نظام إدارة حالات SeaX تلقائيًا استبيانًا إلى العملاء عند إغلاق حالة، ويسجل الرد، مما يضمن إكمال هذه المهمة دائمًا.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="احصل على اقتراحات تلقائية من قاعدة المعرفة المخصصة الخاصة بك، مما يضع معلومات دقيقة في متناول وكلائك.">
</center>

*احصل على اقتراحات تلقائية من قاعدة المعرفة المخصصة الخاصة بك، مما يضع معلومات دقيقة في متناول وكلائك.*

# لماذا SeaX؟

يبسط SeaX مساحة عمل وكلائك، حيث يجمع كل ما يحتاجونه يوميًا في واجهة واحدة، ويزيل التعقيدات والمشتتات من عملهم. يمكّن SeaX وكلائك من خلال أتمتة الذكاء الاصطناعي، مما يحررهم من المهام المتكررة ويضع المعلومات التي يحتاجونها في متناول أيديهم. يجعل SeaX حل مركز الاتصال الخاص بك يعمل من أجلك.

في هذه السلسلة من المدونات، سنتعمق أكثر في الميزات الرائعة لمنصة SeaX، ونغطي الموضوعات أدناه والمزيد!

[**متعدد القنوات**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - يمكن للعملاء الاتصال بك وإرسال الرسائل النصية إليك من أي منصة تقريبًا

[**البنية التحتية لمركز الاتصال الموزع**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - لا توجد خطوط هاتف سلكية، عبر الأنظمة الأساسية، وقابلة للتوسيع بسهولة

**قابل للتخصيص** - خصص الواجهة لاحتياجاتك، من شعار العمل وألوان السمات إلى ساعات العمل والرسائل غير المتصلة بالإنترنت

**SeaVoice STT/TTS** - نسخ مباشر مع تحويل الكلام إلى نص، ووكلاء مكالمات صوتية فائقة مع تحويل النص إلى كلام

**تكاملات أصلية** - دمج جميع أدواتك بسهولة في واجهة واحدة

**أتمتة الذكاء الاصطناعي** - تحرير وقت الوكلاء باستخدام الوكلاء الفائقين وقاعدة المعرفة وإدارة الحالات المدمجة أصلاً لدينا

**تحليلات قوية** - إنشاء لوحات معلومات وتصدير تقارير، وعرض تسجيلات المكالمات ونصوص الدردشة، وتتبع أداء الوكلاء

**مراقبة المسؤول** - أدوات مدمجة لمراقبة اتصالات العملاء وأداء الوكلاء

للحصول على عرض توضيحي شخصي، ولمعرفة كيف يمكن لـ SeaX أن يساعد في تلبية احتياجات مركز الاتصال الخاص بك، يرجى ملء نموذج "[احجز عرضًا توضيحيًا](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" الخاص بنا.
`;export{n as default};
