const n=`---
title: "欢迎来到 SeaX，一个协作式云联络中心"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "在这篇博客中，我们将介绍 SeaX，我们的云通信联络中心解决方案。这是介绍和深入展示 SeaX 功能的系列博客中的第一篇。"
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*在这篇博客中，我们将介绍 SeaX，我们的云通信联络中心解决方案。这是介绍和深入展示 SeaX 功能的系列博客中的第一篇。*

# 什么是 SeaX？

SeaX（发音为“CX”，客户体验的常用缩写）是一个协作式云通信联络中心解决方案。它设计具有极大的灵活性，可以为每个客户创建可定制的联络中心体验，同时仍然提供开箱即用的解决方案，让您快速启动和运行。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="SeaX 连接和配置 Twilio Flex 的构建块，以帮助您弥合座席和客户之间的差距。">
</center>

*SeaX 连接和配置 Twilio Flex 的构建块，以帮助您弥合座席和客户之间的差距。*

# SeaX 与传统联络中心有何不同？

可定制性、灵活性和自动化是 SeaX 的核心。SeaX 可以在 API 级别进行定制，从而轻松地从用户界面调整到集成内部 CRM 或 ERP 系统。客户不会被联络中心最初的配置所束缚，而是可以随着业务的增长继续进行微调。为了达到相同的定制水平，传统联络中心需要花费大量时间和金钱进行设置，从物理基础设施到通信通道配置，再到集成所需的每个系统。这使得设置联络中心的任何新部分都可能成本高昂且耗时。使用 SeaX，您的座席可以在不到一周的时间内完成设置，并且您的联络中心系统可以完成配置，从而让您快速轻松地启动联络中心。

在传统联络中心，通常需要切换多个程序和系统才能完成客户互动。无论是将客户信息从固定电话呼叫转移到 CRM 的困难，还是在多个消息应用程序之间切换以与客户沟通，在单独的程序中拥有不同的功能会减慢工作速度并使其更加困难。SeaX 将所有联络中心功能集成到一个界面中，允许您的座席在一个地方接听来自所有渠道的电话和消息，并直接在界面中完成其他任务，例如在 CRM 中记录对话信息或记录支持票据。这使得您的座席能够更高效地工作，并专注于手头的任务，而不是寻找他们的笔记窗口。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="SeaX 在一个界面中提供所有呼叫和消息，并提供对案例管理等集成系统的访问。">
</center>

*SeaX 在一个界面中提供所有呼叫和消息，并提供对案例管理等集成系统的访问。*

SeaX 内部的紧密集成还允许您密切跟踪和监控呼叫中心中发生的一切。由于与客户的每次互动都发生在同一个平台上，因此您的所有呼叫中心数据都可以随时查看和用于分析。您可以监控所有通信渠道的座席绩效，从查看聊天记录和通话录音，到跟踪每周处理时间，再到自定义座席绩效评估。借助 Flex Insights，您可以创建分析仪表板来跟踪呼叫中心的 KPI，密切关注绩效的任何变化。

协调多个国家、号码和座席的灵活性是跨国联络中心成功的关键，尤其是在完全远程的环境中。传统联络中心很难扩展到不同的国家或在世界不同地区开设新的联络中心。根据国家/地区的不同，与客户联系有各种规则和规定，确保所有联络中心运行相同并在它们之间平稳地转换呼叫，同时遵守不同的法规和时区，这是一项具有挑战性的任务。SeaX 为您处理这些情况，允许您配置每个位置的开放时间等，并在一个平台上支持您的所有座席，无论他们身在何处。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="按电话号码自定义营业时间，以便您可以为全球不同地点单独控制设置。">
</center>

*按电话号码自定义营业时间，以便您可以为全球不同地点单独控制设置。*

# 人工智能如何协助和赋能座席？

人工智能自动化集成到 SeaX 的每个级别，负责简单重复的任务，并允许您的座席专注于需要他们关注的更大、更复杂的呼叫。

在 SeaX 中，座席被称为超级座席，因为他们与人工智能座席协作工作。客户可以将虚拟座席连接到您的电话和消息通道，这些虚拟座席可以为您处理基本任务，只有在必要时才将客户转接给实时座席。这有广泛的用途，从可以安排约会并自动将其添加到日历的虚拟座席，到可以在 CRM 中查找客户并检查其订单状态的虚拟座席。这减轻了您的座席处理这些简单任务的负担，并让他们有空处理其他具有更复杂问题的客户。

SeaX 还在其他地方使用人工智能自动化，以帮助您的座席更轻松地获取所需信息。集成的 SeaX 知识库在座席与客户交谈时自动搜索您的知识库，并向座席提供与当前对话最相似的帮助文章，从而将这些信息放在座席的指尖。SeaX 案例管理系统将在案例关闭时自动向客户发送调查问卷，并记录回复，确保此任务始终完成。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="从您的自定义知识库获取自动建议，将准确的信息放在座席的指尖。">
</center>

*从您的自定义知识库获取自动建议，将准确的信息放在座席的指尖。*

# 为什么选择 SeaX？

SeaX 简化了座席的工作空间，将他们日常所需的一切都整合到一个界面中，消除了工作中的复杂性和干扰。SeaX 通过人工智能自动化赋能您的座席，将他们从重复性任务中解放出来，并将所需信息放在他们的指尖。SeaX 让您的联络中心解决方案为您服务。

在本系列博客中，我们将深入探讨 SeaX 平台的强大功能，涵盖以下主题及更多内容！

[**全渠道**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - 客户几乎可以从任何平台呼叫和发送短信给您

[**分布式联络中心基础设施**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - 无硬连线电话线，跨平台，易于扩展

**可定制** - 根据您的需求定制界面，从业务徽标和主题颜色到开放时间和离线消息

**SeaVoice STT/TTS** - 实时语音转文本转录，以及语音通话超级座席的文本转语音

**原生集成** - 轻松将所有工具集成到一个界面中

**人工智能自动化** - 通过超级座席和我们原生集成的知识库和案例管理，解放座席的时间

**强大的分析** - 创建仪表板和导出报告，查看通话录音和聊天记录，跟踪座席绩效

**管理员监控** - 内置工具，用于监控客户通信和座席绩效

如需个人演示，并了解 SeaX 如何帮助您满足联络中心需求，请填写我们的“[预约演示](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)”表格。
`;export{n as default};
