const n=`---
title: "歡迎來到 SeaX，一個協作式雲端聯絡中心"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "在本部落格中，我們將介紹 SeaX，我們的雲端通訊聯絡中心解決方案。這是介紹和深入展示 SeaX 功能的系列部落格中的第一篇。"
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*在本部落格中，我們將介紹 SeaX，我們的雲端通訊聯絡中心解決方案。這是介紹和深入展示 SeaX 功能的系列部落格中的第一篇。*

# 什麼是 SeaX？

SeaX（發音為「CX」，客戶體驗的常用縮寫）是一個協作式雲端通訊聯絡中心解決方案。它設計具有極大的靈活性，可以為每個客戶創建可定制的聯絡中心體驗，同時仍然提供開箱即用的解決方案，讓您快速啟動和運行。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="SeaX 連接和配置 Twilio Flex 的構建塊，以幫助您彌合座席和客戶之間的差距。">
</center>

*SeaX 連接和配置 Twilio Flex 的構建塊，以幫助您彌合座席和客戶之間的差距。*

# 什麼讓 SeaX 與傳統聯絡中心不同？

可定制性、靈活性和自動化是 SeaX 的核心。SeaX 可以在 API 級別進行定制，從而輕鬆地從用戶界面調整到整合內部 CRM 或 ERP 系統。客戶不會被聯絡中心最初的配置所束縛，而是可以隨著業務的增長繼續進行微調。為了達到相同的定制水平，傳統聯絡中心需要花費大量時間和金錢進行設置，從物理基礎設施到通信通道配置，再到整合所需的每個系統。這使得設置聯絡中心的任何新部分都可能成本高昂且耗時。使用 SeaX，您的座席可以在不到一周的時間內完成設置，並且您的聯絡中心系統可以完成配置，從而讓您快速輕鬆地啟動聯絡中心。

在傳統聯絡中心，通常需要切換多個程式和系統才能完成客戶互動。無論是將客戶資訊從固定電話呼叫轉移到 CRM 的困難，還是切換多個訊息應用程式以與客戶溝通，在單獨的程式中擁有不同的功能會減慢工作速度並使其更加困難。SeaX 將所有聯絡中心功能整合到一個介面中，允許您的座席在一個地方接聽來自所有通道的電話和訊息，並直接在介面中完成其他任務，例如在 CRM 中記錄對話資訊或記錄支援票據。這使得您的座席能夠更高效地工作，並專注於手頭的任務，而不是尋找他們的筆記視窗。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="SeaX 在一個介面中提供所有呼叫和訊息，並提供對案例管理等整合系統的存取。">
</center>

*SeaX 在一個介面中提供所有呼叫和訊息，並提供對案例管理等整合系統的存取。*

SeaX 內部緊密的整合還允許您密切追蹤和監控呼叫中心中發生的一切。由於與客戶的每次互動都發生在同一個平台上，因此您的所有呼叫中心數據都可以隨時查看和用於分析。您可以監控所有通訊通道的座席績效，從查看聊天記錄和通話錄音，到追蹤每週處理時間，再到自定義座席績效評估。借助 Flex Insights，您可以創建分析儀表板來追蹤呼叫中心的 KPI，密切關注績效的任何變化。

協調多個國家、號碼和座席的靈活性是跨國聯絡中心成功的關鍵，尤其是在完全遠端環境中。傳統聯絡中心很難擴展到其他國家或在世界不同地區開設新的聯絡中心。根據國家/地區的不同，與客戶聯繫有各種規則和規定，確保所有聯絡中心運行相同並在它們之間平穩地轉換呼叫，同時遵守不同的法規和時區，這是一項具有挑戰性的任務。SeaX 為您處理這些情況，允許您配置諸如每個地點的開放時間等，並在一個平台上支援您的所有座席，無論他們身在何處。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="按電話號碼自定義營業時間，以便您可以為全球不同地點單獨控制設定。">
</center>

*按電話號碼自定義營業時間，以便您可以為全球不同地點單獨控制設定。*

# 人工智慧如何協助和賦能座席？

人工智慧自動化整合到 SeaX 的每個層級，負責簡單重複的任務，並允許您的座席專注於需要他們關注的更大、更複雜的呼叫。

在 SeaX 中，座席被稱為超級座席，因為他們與人工智慧座席協同工作。有虛擬座席，客戶可以將其連接到您的電話和訊息通道，這些虛擬座席可以為您處理基本任務，只有在必要時才將客戶轉接給實時座席。這有廣泛的用途，從可以安排約會並自動將其添加到日曆的虛擬座席，到可以在 CRM 中查找客戶並檢查其訂單狀態的虛擬座席。這減輕了您的座席處理這些簡單任務的負擔，並讓他們有空處理其他具有更複雜問題的客戶。

SeaX 還在其他地方使用人工智慧自動化，以幫助您的座席更輕鬆地獲取所需資訊。整合的 SeaX 知識庫在座席與客戶交談時自動搜尋您的知識庫，並向座席提供與當前對話最相似的幫助文章，從而將這些資訊放在座席的指尖。SeaX 案例管理系統將在案例關閉時自動向客戶發送調查問卷，並記錄回覆，確保此任務始終完成。

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="從您的自定義知識庫獲取自動建議，將準確的資訊放在座席的指尖。">
</center>

*從您的自定義知識庫獲取自動建議，將準確的資訊放在座席的指尖。*

# 為什麼選擇 SeaX？

SeaX 簡化了座席的工作空間，將他們日常所需的一切都整合到一個介面中，消除了工作中的複雜性和干擾。SeaX 透過人工智慧自動化賦能您的座席，將他們從重複性任務中解放出來，並將所需資訊放在他們的指尖。SeaX 讓您的聯絡中心解決方案為您服務。

在本系列部落格中，我們將深入探討 SeaX 平台的強大功能，涵蓋以下主題及更多內容！

[**全通道**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - 客戶幾乎可以從任何平台呼叫和傳送簡訊給您

[**分散式聯絡中心基礎設施**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - 無硬連線電話線，跨平台，易於擴展

**可自定義** - 根據您的需求自定義介面，從業務標誌和主題顏色到開放時間和離線訊息

**SeaVoice STT/TTS** - 語音轉文字的即時轉錄，以及語音通話超級座席的文字轉語音

**原生整合** - 輕鬆將所有工具整合到一個介面中

**人工智慧自動化** - 透過超級座席和我們原生整合的知識庫和案例管理，解放座席的時間

**強大分析** - 建立儀表板和匯出報告，查看通話錄音和聊天記錄，追蹤座席績效

**管理員監控** - 內建工具，用於監控客戶通訊和座席績效

如需個人演示，並了解 SeaX 如何幫助您滿足聯絡中心需求，請填寫我們的「[預約演示](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)」表格。
`;export{n as default};
