const n=`---
title: "ยินดีต้อนรับสู่ SeaX ศูนย์ติดต่อคลาวด์แบบร่วมมือ"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "ในบล็อกนี้ เราจะแนะนำ SeaX โซลูชันศูนย์ติดต่อสื่อสารบนคลาวด์ของเรา นี่คือบล็อกแรกในชุดบล็อกที่จะแนะนำและแสดงคุณสมบัติของ SeaX อย่างละเอียด"
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*ในบล็อกนี้ เราจะแนะนำ SeaX โซลูชันศูนย์ติดต่อสื่อสารบนคลาวด์ของเรา นี่คือบล็อกแรกในชุดบล็อกที่จะแนะนำและแสดงคุณสมบัติของ SeaX อย่างละเอียด*

# SeaX คืออะไร?

SeaX (ออกเสียงว่า "CX" ซึ่งเป็นคำย่อทั่วไปสำหรับ Customer eXperience) เป็นโซลูชันศูนย์ติดต่อสื่อสารบนคลาวด์แบบร่วมมือ ได้รับการออกแบบมาพร้อมความยืดหยุ่นสูงเพื่อสร้างประสบการณ์ศูนย์ติดต่อที่ปรับแต่งได้สำหรับลูกค้าแต่ละราย ในขณะที่ยังคงนำเสนอโซลูชันสำเร็จรูปเพื่อให้คุณเริ่มต้นและดำเนินการได้อย่างรวดเร็ว

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="SeaX เชื่อมต่อและกำหนดค่าส่วนประกอบของ Twilio Flex เพื่อช่วยให้คุณเชื่อมช่องว่างระหว่างตัวแทนของคุณและลูกค้าของคุณ">
</center>

*SeaX เชื่อมต่อและกำหนดค่าส่วนประกอบของ Twilio Flex เพื่อช่วยให้คุณเชื่อมช่องว่างระหว่างตัวแทนของคุณและลูกค้าของคุณ*

# อะไรที่ทำให้ SeaX แตกต่างจากศูนย์ติดต่อแบบดั้งเดิม?

ความสามารถในการปรับแต่ง ความยืดหยุ่น และระบบอัตโนมัติคือหัวใจสำคัญของ SeaX SeaX สามารถปรับแต่งได้ในระดับ API ทำให้ง่ายต่อการปรับแต่งตั้งแต่ส่วนต่อประสานผู้ใช้ไปจนถึงการรวมระบบ CRM หรือ ERP ภายใน ลูกค้าจะไม่ถูกจำกัดด้วยการกำหนดค่าเริ่มต้นของศูนย์ติดต่อ แต่สามารถปรับแต่งได้อย่างต่อเนื่องเมื่อธุรกิจเติบโต เพื่อให้ได้ระดับการปรับแต่งที่เท่าเทียมกัน ศูนย์ติดต่อแบบดั้งเดิมต้องใช้เวลาและเงินจำนวนมากในการตั้งค่า ตั้งแต่โครงสร้างพื้นฐานทางกายภาพไปจนถึงการกำหนดค่าช่องทางการสื่อสาร ไปจนถึงการรวมระบบที่จำเป็นทุกระบบ สิ่งนี้อาจทำให้การตั้งค่าส่วนใหม่ของศูนย์ติดต่อมีราคาแพงและใช้เวลานาน ด้วย SeaX ตัวแทนของคุณสามารถตั้งค่าและกำหนดค่าระบบศูนย์ติดต่อของคุณได้ภายในเวลาไม่ถึงหนึ่งสัปดาห์ ทำให้คุณสามารถทำให้ศูนย์ติดต่อของคุณทำงานได้อย่างรวดเร็วและง่ายดาย

ในศูนย์ติดต่อแบบดั้งเดิม มักจะต้องสลับไปมาระหว่างโปรแกรมและระบบหลายโปรแกรมเพื่อดำเนินการโต้ตอบกับลูกค้าให้เสร็จสิ้น ไม่ว่าจะเป็นความยากลำบากในการถ่ายโอนข้อมูลลูกค้าจากการโทรศัพท์พื้นฐานไปยัง CRM หรือการสลับไปมาระหว่างแอปพลิเคชันส่งข้อความหลายตัวเพื่อสื่อสารกับลูกค้า การมีฟังก์ชันที่แตกต่างกันในโปรแกรมแยกกันทำให้การทำงานช้าลงและยากขึ้น SeaX รวมฟังก์ชันการทำงานของศูนย์ติดต่อทั้งหมดไว้ในอินเทอร์เฟซเดียว ทำให้ตัวแทนของคุณสามารถรับสายและข้อความจากทุกช่องทางในที่เดียว และยังสามารถทำงานอื่นๆ ได้โดยตรงในอินเทอร์เฟซ เช่น การบันทึกข้อมูลการสนทนาใน CRM หรือการจดบันทึกตั๋วสนับสนุน สิ่งนี้ช่วยให้ตัวแทนของคุณมีประสิทธิภาพมากขึ้นและมุ่งเน้นไปที่งานที่ทำอยู่ แทนที่จะค้นหาหน้าต่างบันทึกของพวกเขา

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="SeaX ให้บริการการโทรและข้อความทั้งหมดในอินเทอร์เฟซเดียว รวมถึงการเข้าถึงระบบที่รวมเข้าด้วยกัน เช่น การจัดการกรณี">
</center>

*SeaX ให้บริการการโทรและข้อความทั้งหมดในอินเทอร์เฟซเดียว รวมถึงการเข้าถึงระบบที่รวมเข้าด้วยกัน เช่น การจัดการกรณี*

การรวมระบบที่แน่นหนาภายใน SeaX นี้ยังช่วยให้คุณสามารถติดตามและตรวจสอบทุกสิ่งที่เกิดขึ้นในศูนย์บริการลูกค้าของคุณได้อย่างใกล้ชิด เนื่องจากทุกการโต้ตอบกับลูกค้าของคุณเกิดขึ้นบนแพลตฟอร์มเดียวกัน ข้อมูลศูนย์บริการลูกค้าทั้งหมดของคุณจึงพร้อมใช้งานสำหรับการตรวจสอบและใช้ในการวิเคราะห์ คุณสามารถตรวจสอบประสิทธิภาพของตัวแทนในทุกช่องทางการสื่อสาร ตั้งแต่การตรวจสอบบันทึกการสนทนาและบันทึกการโทร ไปจนถึงการติดตามเวลาการจัดการในแต่ละสัปดาห์ ไปจนถึงการประเมินประสิทธิภาพของตัวแทนที่กำหนดเอง ด้วย Flex Insights คุณสามารถสร้างแดชบอร์ดการวิเคราะห์เพื่อติดตาม KPI ของศูนย์บริการลูกค้าของคุณ โดยจับตาดูการเปลี่ยนแปลงประสิทธิภาพอย่างใกล้ชิด

ความยืดหยุ่นในการประสานงานหลายประเทศ หมายเลข และตัวแทนเป็นกุญแจสำคัญสู่ความสำเร็จของศูนย์ติดต่อข้ามชาติ โดยเฉพาะอย่างยิ่งในสภาพแวดล้อมที่ทำงานจากระยะไกลทั้งหมด เป็นเรื่องยากสำหรับศูนย์ติดต่อแบบดั้งเดิมที่จะขยายไปยังประเทศอื่น ๆ หรือเปิดศูนย์ติดต่อใหม่ในส่วนต่างๆ ของโลก มีกฎและข้อบังคับที่แตกต่างกันเกี่ยวกับการติดต่อกับลูกค้าขึ้นอยู่กับประเทศ และการทำให้แน่ใจว่าศูนย์ติดต่อทั้งหมดของคุณทำงานเหมือนกันและเปลี่ยนสายระหว่างกันได้อย่างราบรื่นในขณะที่เคารพกฎระเบียบและเขตเวลาที่แตกต่างกันนั้นเป็นงานที่ท้าทาย SeaX จัดการสถานการณ์เหล่านี้ให้คุณ ทำให้คุณสามารถกำหนดค่าสิ่งต่างๆ เช่น เวลาทำการสำหรับแต่ละสถานที่ และสนับสนุนตัวแทนทั้งหมดของคุณบนแพลตฟอร์มเดียว ไม่ว่าพวกเขาจะอยู่ที่ใดก็ตาม

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="ปรับแต่งเวลาทำการตามหมายเลขโทรศัพท์ เพื่อให้คุณสามารถควบคุมการตั้งค่าแยกกันสำหรับสถานที่ต่างๆ ทั่วโลกของคุณ">
</center>

*ปรับแต่งเวลาทำการตามหมายเลขโทรศัพท์ เพื่อให้คุณสามารถควบคุมการตั้งค่าแยกกันสำหรับสถานที่ต่างๆ ทั่วโลกของคุณ*

# AI สามารถช่วยเหลือและเสริมศักยภาพตัวแทนได้อย่างไร?

ระบบอัตโนมัติ AI ถูกรวมเข้ากับทุกระดับของ SeaX โดยรับผิดชอบงานที่เรียบง่ายและซ้ำซาก และช่วยให้ตัวแทนของคุณมุ่งเน้นไปที่การโทรที่ใหญ่กว่าและซับซ้อนกว่าที่ต้องการความสนใจของพวกเขา

ใน SeaX ตัวแทนจะถูกเรียกว่า Super Agents เพราะพวกเขาทำงานร่วมกับ AI agents มีตัวแทนเสมือนที่ลูกค้าสามารถเชื่อมต่อกับโทรศัพท์และช่องทางการส่งข้อความของคุณ ซึ่งสามารถจัดการงานพื้นฐานให้คุณได้ โดยจะส่งลูกค้าไปยังตัวแทนสดเมื่อจำเป็นเท่านั้น มีการใช้งานที่หลากหลายสำหรับสิ่งนี้ ตั้งแต่ตัวแทนเสมือนที่สามารถกำหนดเวลาการนัดหมายและเพิ่มลงในปฏิทินโดยอัตโนมัติ ไปจนถึงตัวแทนเสมือนที่สามารถค้นหาลูกค้าใน CRM และตรวจสอบสถานะคำสั่งซื้อของพวกเขา สิ่งนี้ช่วยลดภาระงานง่ายๆ เหล่านี้จากตัวแทนของคุณ และทำให้พวกเขามีอิสระในการจัดการลูกค้าคนอื่นๆ ที่มีปัญหาซับซ้อนมากขึ้น

SeaX ยังใช้ระบบอัตโนมัติ AI ในที่อื่น ๆ เพื่อช่วยให้ตัวแทนของคุณเข้าถึงข้อมูลที่ต้องการได้ง่ายขึ้น ฐานความรู้ SeaX ที่รวมเข้าด้วยกันจะค้นหาฐานความรู้ของคุณโดยอัตโนมัติในขณะที่ตัวแทนกำลังพูดคุยกับลูกค้า และให้บทความช่วยเหลือที่คล้ายกับการสนทนาปัจจุบันมากที่สุดแก่ตัวแทน ทำให้ข้อมูลนั้นอยู่ในมือของตัวแทน ระบบจัดการกรณีของ SeaX จะส่งแบบสำรวจไปยังลูกค้าโดยอัตโนมัติเมื่อปิดกรณี และบันทึกคำตอบ เพื่อให้แน่ใจว่างานนี้จะเสร็จสมบูรณ์เสมอ

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="รับคำแนะนำอัตโนมัติจากฐานความรู้ที่กำหนดเองของคุณ ทำให้ข้อมูลที่ถูกต้องอยู่ในมือของตัวแทนของคุณ">
</center>

*รับคำแนะนำอัตโนมัติจากฐานความรู้ที่กำหนดเองของคุณ ทำให้ข้อมูลที่ถูกต้องอยู่ในมือของตัวแทนของคุณ*

# ทำไมต้อง SeaX?

SeaX ทำให้พื้นที่ทำงานของตัวแทนของคุณง่ายขึ้น โดยนำทุกสิ่งที่พวกเขาต้องการในแต่ละวันมารวมไว้ในอินเทอร์เฟซเดียว ขจัดความซับซ้อนและสิ่งรบกวนจากการทำงานของพวกเขา SeaX เสริมศักยภาพตัวแทนของคุณด้วยระบบอัตโนมัติ AI ปลดปล่อยพวกเขาจากงานซ้ำซาก และนำข้อมูลที่พวกเขาต้องการมาไว้ที่ปลายนิ้ว SeaX ทำให้โซลูชันศูนย์ติดต่อของคุณทำงานให้คุณ

ในชุดบล็อกนี้ เราจะเจาะลึกคุณสมบัติที่ยอดเยี่ยมของแพลตฟอร์ม SeaX โดยครอบคลุมหัวข้อด้านล่างและอีกมากมาย!

[**Omni-channel**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - ลูกค้าสามารถโทรและส่งข้อความถึงคุณได้จากแทบทุกแพลตฟอร์ม

[**โครงสร้างพื้นฐานศูนย์ติดต่อแบบกระจาย**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - ไม่มีสายโทรศัพท์แบบมีสาย ข้ามแพลตฟอร์ม และขยายได้ง่าย

**ปรับแต่งได้** - ปรับแต่งอินเทอร์เฟซตามความต้องการของคุณ ตั้งแต่โลโก้ธุรกิจและสีธีมไปจนถึงเวลาทำการและข้อความออฟไลน์

**SeaVoice STT/TTS** - การถอดความสดด้วยการพูดเป็นข้อความ และตัวแทนซุปเปอร์คอลด้วยเสียงพร้อมข้อความเป็นคำพูด

**การรวมระบบแบบเนทีฟ** - รวมเครื่องมือทั้งหมดของคุณเข้ากับอินเทอร์เฟซเดียวได้อย่างง่ายดาย

**ระบบอัตโนมัติ AI** - เพิ่มเวลาให้กับตัวแทนด้วยตัวแทนซุปเปอร์และฐานความรู้และการจัดการกรณีที่รวมเข้าด้วยกัน

**การวิเคราะห์ที่มีประสิทธิภาพ** - สร้างแดชบอร์ดและส่งออกรายงาน ดูบันทึกการโทรและบันทึกการสนทนา ติดตามประสิทธิภาพของตัวแทน

**การตรวจสอบผู้ดูแลระบบ** - เครื่องมือในตัวสำหรับการตรวจสอบการสื่อสารกับลูกค้าและประสิทธิภาพของตัวแทน

สำหรับการสาธิตส่วนตัว และเพื่อดูว่า SeaX สามารถช่วยตอบสนองความต้องการศูนย์ติดต่อของคุณได้อย่างไร โปรดกรอกแบบฟอร์ม "[จองการสาธิต](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" ของเรา
`;export{n as default};
