const n=`---
title: "협업 클라우드 컨택 센터 SeaX에 오신 것을 환영합니다"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-08-01 12:00:00+00:00
draft: false
author: Sarah Reid
description: "이 블로그에서는 클라우드 커뮤니케이션 컨택 센터 솔루션인 SeaX를 소개합니다. 이 블로그는 SeaX를 소개하는 시리즈의 첫 번째입니다."
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*이 블로그에서는 클라우드 커뮤니케이션 컨택 센터 솔루션인 SeaX를 소개합니다. 이 블로그는 SeaX의 기능을 심도 있게 소개하고 보여주는 시리즈의 첫 번째입니다.*

# SeaX란 무엇인가요?

SeaX(고객 경험을 의미하는 일반적인 약어인 "CX"로 발음)는 협업 클라우드 커뮤니케이션 컨택 센터 솔루션입니다. 각 개별 고객에 맞는 맞춤형 컨택 센터 경험을 제공하기 위해 뛰어난 유연성으로 설계되었으며, 동시에 즉시 시작하고 실행할 수 있는 기본 솔루션을 제공합니다.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="SeaX는 Twilio Flex의 구성 요소를 연결하고 구성하여 상담사와 고객 간의 격차를 해소하는 데 도움을 줍니다.">
</center>

*SeaX는 Twilio Flex의 구성 요소를 연결하고 구성하여 상담사와 고객 간의 격차를 해소하는 데 도움을 줍니다.*

# SeaX가 기존 컨택 센터와 다른 점은 무엇인가요?

맞춤화, 유연성 및 자동화는 SeaX의 핵심입니다. SeaX는 API 수준에서 맞춤화가 가능하여 사용자 인터페이스 조정부터 내부 CRM 또는 ERP 시스템 통합까지 쉽게 할 수 있습니다. 고객은 컨택 센터가 처음 구성된 방식에 얽매이지 않고 비즈니스가 성장함에 따라 계속해서 미세 조정할 수 있습니다. 동일한 수준의 맞춤화를 달성하기 위해 기존 컨택 센터는 물리적 인프라부터 통신 채널 구성, 필요한 모든 시스템 통합에 이르기까지 상당한 시간과 비용이 소요됩니다. 이로 인해 컨택 센터의 새로운 부분을 설정하는 데 비용과 시간이 많이 소요될 수 있습니다. SeaX를 사용하면 일주일 이내에 상담사를 설정하고 컨택 센터 시스템을 구성할 수 있으므로 컨택 센터를 빠르고 쉽게 운영할 수 있습니다.

기존 컨택 센터에서는 고객 상호 작용을 완료하기 위해 여러 프로그램과 시스템 간에 전환해야 하는 경우가 많습니다. 유선 전화 통화에서 CRM으로 고객 정보를 전송하는 어려움이든, 고객과 소통하기 위해 여러 메시징 애플리케이션 간에 전환하는 것이든, 별도의 프로그램에 다른 기능이 있으면 작업 속도가 느려지고 더 어려워집니다. SeaX는 모든 컨택 센터 기능을 하나의 인터페이스에 통합하여 상담사가 한 곳에서 모든 채널의 전화와 메시지를 받을 수 있도록 하고, CRM에 대화 정보를 기록하거나 지원 티켓 메모를 작성하는 등 다른 작업도 인터페이스에서 직접 완료할 수 있도록 합니다. 이를 통해 상담사는 메모 창을 찾는 대신 당면한 작업에 더 효율적으로 집중할 수 있습니다.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="SeaX는 하나의 인터페이스에서 모든 통화와 메시지를 처리하며, 사례 관리와 같은 통합 시스템에 대한 액세스도 제공합니다.">
</center>

*SeaX는 하나의 인터페이스에서 모든 통화와 메시지를 처리하며, 사례 관리와 같은 통합 시스템에 대한 액세스도 제공합니다.*

SeaX 내의 이러한 긴밀한 통합을 통해 콜센터에서 일어나는 모든 일을 면밀히 추적하고 모니터링할 수 있습니다. 고객과의 모든 상호 작용이 동일한 플랫폼에서 이루어지므로 모든 콜센터 데이터를 쉽게 검토하고 분석에 사용할 수 있습니다. 채팅 스크립트 및 통화 녹음 검토부터 주별 처리 시간 추적, 맞춤형 상담사 성과 평가에 이르기까지 모든 통신 채널에서 상담사 성과를 모니터링할 수 있습니다. Flex Insights를 사용하면 분석 대시보드를 만들어 콜센터 KPI를 추적하고 성과 변화를 면밀히 주시할 수 있습니다.

여러 국가, 번호 및 상담사를 조정하는 유연성은 특히 완전한 원격 환경에서 성공적인 다국적 컨택 센터의 핵심입니다. 기존 컨택 센터에서는 다른 국가로 확장하거나 세계 다른 지역에 새로운 컨택 센터를 여는 것이 어려웠습니다. 국가에 따라 고객과의 접촉에 대한 다양한 규칙과 규정이 있으며, 모든 컨택 센터가 동일하게 운영되고 다른 규정과 시간대를 존중하면서 원활하게 통화를 전환하도록 보장하는 것은 어려운 작업입니다. SeaX는 이러한 상황을 처리하여 각 위치의 영업 시간과 같은 것을 구성하고, 물리적 위치에 관계없이 단일 플랫폼에서 모든 상담사를 지원합니다.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="전화번호별로 운영 시간을 맞춤 설정하여 전 세계 각기 다른 위치에 대한 설정을 개별적으로 제어할 수 있습니다.">
</center>

*전화번호별로 운영 시간을 맞춤 설정하여 전 세계 각기 다른 위치에 대한 설정을 개별적으로 제어할 수 있습니다.*

# AI는 어떻게 상담사를 지원하고 역량을 강화할 수 있나요?

AI 자동화는 SeaX의 모든 수준에 통합되어 간단하고 반복적인 작업을 담당하고 상담사가 주의를 기울여야 하는 더 크고 복잡한 통화에 집중할 수 있도록 합니다.

SeaX에서 상담사는 AI 상담사와 협력하여 일하기 때문에 슈퍼 상담사라고 불립니다. 고객이 전화 및 메시징 채널에 연결할 수 있는 가상 상담사가 있어 기본적인 작업을 처리해 주며, 필요한 경우에만 고객을 실제 상담사에게 전달합니다. 약속을 예약하고 자동으로 캘린더에 추가할 수 있는 가상 상담사부터 CRM에서 고객을 조회하고 주문 상태를 확인할 수 있는 가상 상담사까지 다양한 용도로 사용할 수 있습니다. 이를 통해 상담사는 이러한 간단한 작업의 부담을 덜고 더 복잡한 문제를 가진 다른 고객을 처리할 수 있습니다.

SeaX는 또한 다른 곳에서 AI 자동화를 사용하여 상담사가 필요한 정보에 더 쉽게 접근할 수 있도록 지원합니다. 통합된 SeaX 지식 베이스는 상담사가 고객과 대화하는 동안 자동으로 지식 베이스를 검색하고 현재 대화와 가장 유사한 도움말 문서를 상담사에게 제공하여 해당 정보를 상담사의 손끝에 놓습니다. SeaX 사례 관리 시스템은 사례가 종결되면 자동으로 고객에게 설문 조사를 보내고 응답을 기록하여 이 작업이 항상 완료되도록 합니다.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="맞춤형 지식 베이스에서 자동화된 제안을 받아 상담사가 정확한 정보를 손쉽게 얻을 수 있습니다.">
</center>

*맞춤형 지식 베이스에서 자동화된 제안을 받아 상담사가 정확한 정보를 손쉽게 얻을 수 있습니다.*

# 왜 SeaX인가요?

SeaX는 상담사의 작업 공간을 단순화하여 일상적으로 필요한 모든 것을 하나의 인터페이스로 가져와 작업의 복잡성과 방해 요소를 제거합니다. SeaX는 AI 자동화로 상담사의 역량을 강화하여 반복적인 작업에서 벗어나 필요한 정보를 손쉽게 얻을 수 있도록 합니다. SeaX는 귀하의 컨택 센터 솔루션이 귀하를 위해 일하도록 합니다.

이 블로그 시리즈에서는 아래 주제 등을 다루면서 SeaX 플랫폼의 뛰어난 기능에 대해 더 깊이 알아볼 것입니다!

[**옴니채널**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - 고객은 거의 모든 플랫폼에서 전화하고 문자를 보낼 수 있습니다

[**분산형 컨택 센터 인프라**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - 유선 전화선 없음, 교차 플랫폼 및 손쉬운 확장

**맞춤형** - 비즈니스 로고 및 테마 색상부터 영업 시간 및 오프라인 메시지까지 필요에 맞게 인터페이스를 맞춤 설정

**SeaVoice STT/TTS** - 음성-텍스트 변환을 통한 실시간 전사 및 텍스트-음성 변환을 통한 음성 통화 슈퍼 상담사

**기본 통합** - 모든 도구를 하나의 인터페이스에 쉽게 통합

**AI 자동화** - 슈퍼 상담사와 기본적으로 통합된 지식 베이스 및 사례 관리를 통해 상담사의 시간 확보

**강력한 분석** - 대시보드 생성 및 보고서 내보내기, 통화 녹음 및 채팅 스크립트 보기, 상담사 성과 추적

**관리자 모니터링** - 고객 커뮤니케이션 및 상담사 성과 모니터링을 위한 내장 도구

개인 데모를 원하시거나 SeaX가 귀하의 컨택 센터 요구 사항에 어떻게 도움이 되는지 확인하려면 "[데모 예약](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" 양식을 작성해 주세요.
`;export{n as default};
