const n=`---
title: "به SeaX خوش آمدید، یک مرکز تماس ابری مشارکتی"
date: 2022-06-22 18:21:32+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "در این وبلاگ SeaX، راه حل مرکز تماس ابری ما را معرفی خواهیم کرد. این اولین وبلاگ از مجموعه وبلاگ هایی است که SeaX را معرفی کرده و ویژگی های آن را به تفصیل نشان می دهد."
weight: 1
tags:
  - SeaX
image: images/blog/18-seax-collaborative-cloud-contact-center-introduction/SeaX_future.png
canonicalURL: /blog/seax-collab-cloud-contact-center-intro/
url: /blog/seax-collab-cloud-contact-center-intro/
---

*در این وبلاگ SeaX، راه حل مرکز تماس ابری ما را معرفی خواهیم کرد. این اولین وبلاگ از مجموعه وبلاگ هایی است که SeaX را معرفی کرده و ویژگی های آن را به تفصیل نشان می دهد.*

# SeaX چیست؟

SeaX (تلفظ "CX"، مخفف رایج Customer eXperience) یک راه حل مرکز تماس ابری مشارکتی است. این راه حل با انعطاف پذیری بالا طراحی شده است تا تجربه مرکز تماس قابل تنظیم را برای هر مشتری فراهم کند، در حالی که یک راه حل آماده برای شروع سریع کار را نیز ارائه می دهد.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/seax-vs-flex.gif" alt="SeaX بلوک های ساختمانی Twilio Flex را به هم متصل و پیکربندی می کند تا به شما در پر کردن شکاف بین نمایندگان و مشتریان خود کمک کند.">
</center>

*SeaX بلوک های ساختمانی Twilio Flex را به هم متصل و پیکربندی می کند تا به شما در پر کردن شکاف بین نمایندگان و مشتریان خود کمک کند.*

# چه چیزی SeaX را از مراکز تماس سنتی متمایز می کند؟

قابلیت سفارشی سازی، انعطاف پذیری و اتوماسیون از ویژگی های اصلی SeaX هستند. SeaX در سطح API قابل سفارشی سازی است و تنظیم آن از رابط کاربری تا ادغام سیستم های CRM یا ERP داخلی را آسان می کند. مشتریان به نحوه پیکربندی اولیه مرکز تماس محدود نخواهند شد، بلکه می توانند با رشد کسب و کار به تنظیم دقیق آن ادامه دهند. برای دستیابی به همین سطح از سفارشی سازی، مراکز تماس سنتی برای راه اندازی، از زیرساخت های فیزیکی گرفته تا پیکربندی کانال ارتباطی و ادغام هر سیستم مورد نیاز، زمان و هزینه قابل توجهی را صرف می کنند. این امر می تواند راه اندازی هر بخش جدیدی از مرکز تماس را پرهزینه و زمان بر کند. با SeaX، نمایندگان شما می توانند در کمتر از یک هفته راه اندازی شوند و سیستم مرکز تماس شما پیکربندی شود، که به شما امکان می دهد مرکز تماس خود را به سرعت و به راحتی راه اندازی کنید.

در مراکز تماس سنتی، اغلب برای تکمیل تعامل با مشتری، نیاز به جابجایی بین چندین برنامه و سیستم وجود دارد. چه مشکل انتقال اطلاعات مشتری از یک تماس تلفنی ثابت به CRM باشد، یا جابجایی بین چندین برنامه پیام رسانی برای برقراری ارتباط با مشتریان، داشتن عملکردهای مختلف در برنامه های جداگانه کار را کندتر و دشوارتر می کند. SeaX تمام عملکردهای مرکز تماس را در یک رابط واحد ادغام می کند، به نمایندگان شما امکان می دهد تماس ها و پیام ها را از همه کانال ها در یک مکان دریافت کنند، و همچنین سایر وظایف را مانند ثبت اطلاعات مکالمه در CRM یا یادداشت برداری از تیکت های پشتیبانی، مستقیماً در رابط انجام دهند. این به نمایندگان شما امکان می دهد کارآمدتر باشند و به جای جستجوی پنجره یادداشت های خود، روی کار در دست تمرکز کنند.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/one-interface.png" alt="SeaX تمام تماس ها و پیام ها را در یک رابط ارائه می دهد، و همچنین دسترسی به سیستم های یکپارچه مانند مدیریت پرونده را فراهم می کند.">
</center>

*SeaX تمام تماس ها و پیام ها را در یک رابط ارائه می دهد، و همچنین دسترسی به سیستم های یکپارچه مانند مدیریت پرونده را فراهم می کند.*

این یکپارچگی تنگاتنگ در SeaX همچنین به شما امکان می دهد تا همه چیزهایی را که در مرکز تماس شما اتفاق می افتد، به دقت ردیابی و نظارت کنید. از آنجایی که هر تعامل با مشتریان شما در یک پلتفرم اتفاق می افتد، تمام داده های مرکز تماس شما به راحتی برای بررسی و استفاده در تجزیه و تحلیل در دسترس است. شما می توانید عملکرد نماینده را در تمام کانال های ارتباطی، از بررسی رونوشت های چت و ضبط تماس ها، تا ردیابی زمان رسیدگی هفته به هفته، تا ارزیابی های عملکرد نماینده سفارشی، نظارت کنید. با Flex Insights، می توانید داشبوردهای تحلیلی برای ردیابی KPI های مرکز تماس خود ایجاد کنید و هرگونه تغییر در عملکرد را به دقت زیر نظر داشته باشید.

انعطاف پذیری در هماهنگی چندین کشور، شماره و نمایندگان، کلید موفقیت یک مرکز تماس چند ملیتی است، به ویژه در یک محیط کاملاً از راه دور. در مراکز تماس سنتی، گسترش به کشورهای دیگر یا افتتاح مراکز تماس جدید در نقاط مختلف جهان دشوار بوده است. قوانین و مقررات مختلفی در مورد تماس با مشتریان بسته به کشور وجود دارد، و اطمینان از اینکه همه مراکز تماس شما به یک شکل عمل می کنند و تماس ها را به طور روان بین خود منتقل می کنند، در حالی که به مقررات و مناطق زمانی مختلف احترام می گذارند، یک کار چالش برانگیز است. SeaX این موقعیت ها را برای شما مدیریت می کند و به شما امکان می دهد مواردی مانند ساعات کاری برای هر مکان را پیکربندی کنید و از همه نمایندگان خود در یک پلتفرم پشتیبانی کنید، صرف نظر از اینکه آنها از نظر فیزیکی کجا هستند.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/hours.png" alt="ساعات کاری را بر اساس شماره تلفن سفارشی کنید، تا بتوانید تنظیمات را به طور جداگانه برای مکان های جداگانه خود در سراسر جهان کنترل کنید.">
</center>

*ساعات کاری را بر اساس شماره تلفن سفارشی کنید، تا بتوانید تنظیمات را به طور جداگانه برای مکان های جداگانه خود در سراسر جهان کنترل کنید.*

# هوش مصنوعی چگونه می تواند به نمایندگان کمک و آنها را توانمند کند؟

اتوماسیون هوش مصنوعی در هر سطح از SeaX ادغام شده است و وظایف ساده و تکراری را بر عهده می گیرد و به نمایندگان شما اجازه می دهد تا بر روی تماس های بزرگتر و پیچیده تری که نیاز به توجه آنها دارند تمرکز کنند.

در SeaX، نمایندگان را Super Agents می نامند زیرا آنها با نمایندگان هوش مصنوعی همکاری می کنند. نمایندگان مجازی وجود دارند که مشتریان می توانند آنها را به تلفن و کانال های پیام رسانی شما متصل کنند که می توانند وظایف اساسی را برای شما انجام دهند و فقط در صورت لزوم مشتری را به یک نماینده زنده منتقل کنند. طیف گسترده ای از کاربردها برای این کار وجود دارد، از یک نماینده مجازی که می تواند قرار ملاقات ها را برنامه ریزی کرده و به طور خودکار به تقویم اضافه کند، تا یک نماینده مجازی که می تواند مشتری را در CRM جستجو کرده و وضعیت سفارش او را بررسی کند. این کار بار این وظایف ساده را از دوش نمایندگان شما برمی دارد و آنها را برای رسیدگی به سایر مشتریان با مسائل پیچیده تر آزاد می کند.

SeaX همچنین از اتوماسیون هوش مصنوعی در مکان‌های دیگر برای کمک به نمایندگان شما برای دسترسی آسان‌تر به اطلاعات مورد نیازشان استفاده می‌کند. پایگاه دانش یکپارچه SeaX به طور خودکار پایگاه دانش شما را در حالی که نماینده با مشتری صحبت می‌کند، جستجو می‌کند و مقالات کمکی را که بیشترین شباهت را به مکالمه فعلی دارند، در اختیار نماینده قرار می‌دهد و آن اطلاعات را در دسترس نماینده قرار می‌دهد. سیستم مدیریت پرونده SeaX به طور خودکار یک نظرسنجی را برای مشتریان پس از بسته شدن پرونده ارسال می‌کند و پاسخ را ثبت می‌کند و اطمینان حاصل می‌کند که این کار همیشه انجام می‌شود.

<center>
<img src="/images/blog/18-seax-collaborative-cloud-contact-center-introduction/kb.png" alt="پیشنهادات خودکار را از پایگاه دانش سفارشی خود دریافت کنید، اطلاعات دقیق را در دسترس نمایندگان خود قرار دهید.">
</center>

*پیشنهادات خودکار را از پایگاه دانش سفارشی خود دریافت کنید، اطلاعات دقیق را در دسترس نمایندگان خود قرار دهید.*

# چرا SeaX؟

SeaX فضای کاری نمایندگان شما را ساده می کند و هر آنچه را که روزانه نیاز دارند در یک رابط واحد جمع آوری می کند و پیچیدگی ها و حواس پرتی ها را از کار آنها حذف می کند. SeaX نمایندگان شما را با اتوماسیون هوش مصنوعی توانمند می کند، آنها را از وظایف تکراری آزاد می کند و اطلاعات مورد نیاز آنها را در دسترس آنها قرار می دهد. SeaX راه حل مرکز تماس شما را برای شما کارآمد می کند.

در این مجموعه وبلاگ، ما عمیق تر به ویژگی های عالی پلتفرم SeaX خواهیم پرداخت و موضوعات زیر و موارد دیگر را پوشش خواهیم داد!

[**چند کاناله**](https://seasalt.ai/blog/19-seax-omnichannel-communication/) - مشتریان می توانند تقریباً از هر پلتفرمی با شما تماس بگیرند و پیامک ارسال کنند

[**زیرساخت مرکز تماس توزیع شده**](https://seasalt.ai/blog/20-seax-distributed-contact-center/) - بدون خطوط تلفن سیمی، چند پلتفرمی و به راحتی قابل توسعه

**قابل تنظیم** - رابط کاربری را مطابق با نیازهای خود سفارشی کنید، از لوگوی کسب و کار و رنگ های تم گرفته تا ساعات کاری و پیام های آفلاین

**SeaVoice STT/TTS** - رونویسی زنده با گفتار به متن، و سوپر ایجنت های تماس صوتی با متن به گفتار

**ادغام های بومی** - به راحتی تمام ابزارهای خود را در یک رابط واحد ادغام کنید

**اتوماسیون های هوش مصنوعی** - با سوپر ایجنت ها و پایگاه دانش و مدیریت پرونده یکپارچه بومی ما، زمان نمایندگان را آزاد کنید

**تحلیل های قدرتمند** - داشبورد ایجاد کنید و گزارش ها را صادر کنید، ضبط تماس ها و رونوشت های چت را مشاهده کنید، عملکرد نماینده را ردیابی کنید

**نظارت مدیر** - ابزارهای داخلی برای نظارت بر ارتباط با مشتری و عملکرد نماینده

برای یک دموی شخصی، و برای اینکه ببینید چگونه SeaX می تواند به نیازهای مرکز تماس شما کمک کند، لطفاً فرم "[رزرو دمو](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" ما را پر کنید.
`;export{n as default};
