const n=`---
title: "SeaX ओमनीचैनल कम्युनिकेशन के साथ किसी भी चैनल से ग्राहकों को एक ही स्थान पर लाएँ"
metatitle: "SeaX ओमनीचैनल कम्युनिकेशन के साथ ग्राहक टचपॉइंट को एकीकृत करें"
date: 2022-07-15 13:56:54-07:00
modified_date: 2025-08-02 17:00:00-07:00
draft: false
author: Kim Dodds
description: "इस ब्लॉग में, हम SeaX के ओमनीचैनल संचारों में से एक पर प्रकाश डालते हैं, जो किसी भी चैनल से उपयोगकर्ता संदेशों को SeaX प्लेटफ़ॉर्म पर प्रदर्शित करने की अनुमति देता है।"
weight: 1
tags:
  - SeaX
image: images/blog/19-seax-omnichannel-communication/0-thumbnail.png
canonicalURL: /blog/seax-omnichannel-communication/
url: /blog/seax-omnichannel-communication/
---

*हमारे पिछले ब्लॉग पोस्ट में, [SeaX में आपका स्वागत है, एक सहयोगी क्लाउड संपर्क केंद्र](https://seasalt.ai/blog/18-seax-collaborative-cloud-contact-center-introduction/), हमने SeaX, हमारे सहयोगी क्लाउड संचार संपर्क केंद्र समाधान का परिचय दिया। जबकि हमारे पहले ब्लॉग पोस्ट ने SeaX की बुनियादी और अधिक उन्नत सुविधाओं का एक व्यापक अवलोकन दिया, हमारे बाद के पोस्ट कुछ व्यक्तिगत विशेषताओं में गहराई से उतरेंगे जो SeaX को सबसे अलग बनाती हैं। इस पोस्ट में, हम SeaX के ओमनीचैनल समर्थन पर करीब से नज़र डालेंगे और देखेंगे कि विभिन्न चैनलों से कॉल और संदेश SeaX प्लेटफ़ॉर्म पर कैसे दिखाई देते हैं।*

# विषय-सूची
- [ओमनीचैनल संचार क्या है?](#what-is-omnichannel-communication)
- [संदेश जीवनचक्र](#message-lifecycle)
    - [चैनल](#channel)
    - [संदेश रूटिंग](#message-routing)
    - [TaskRouter](#taskrouter)
    - [SeaX प्लेटफ़ॉर्म](#seax-platform)
- [समर्थित चैनल](#supported-channels)

# ओमनीचैनल संचार क्या है?

सबसे पहले, "ओमनीचैनल" का वास्तव में क्या मतलब है? इसे तोड़कर देखें तो, "ओमनी" एक उपसर्ग है जिसका अर्थ है "सभी," और "चैनल" वे विभिन्न प्लेटफ़ॉर्म हैं जिन पर आप अपने ग्राहकों के साथ जुड़ सकते हैं। इसलिए, सरल शब्दों में, "ओमनीचैनल संचार" का अर्थ है किसी भी और सभी उपलब्ध चैनलों के माध्यम से संवाद करने में सक्षम होना। इतना ही नहीं, बल्कि ओमनीचैनल संचार का यह भी अर्थ है कि चैनलों के बीच का अनुभव सहज है। एजेंट की ओर से, सभी चैनलों से संचार एक एकीकृत इंटरफ़ेस में प्रस्तुत किए जाते हैं। ग्राहक के लिए, उनका इंटरैक्शन डेटा चैनलों में लगातार बना रहता है।

पारंपरिक कॉल सेंटर अक्सर केवल फोन कॉल का समर्थन करते हैं। अधिक उन्नत संपर्क केंद्र जो ईमेल, वेब चैट और फोन जैसे कई चैनलों पर ग्राहकों से जुड़ते हैं, उनके पास एक मल्टीचैनल संपर्क केंद्र होता है। हालाँकि, सिर्फ इसलिए कि एक संपर्क केंद्र कई चैनलों का उपयोग करता है, इसका मतलब यह नहीं है कि उनका अनुभव सहज है। एक मल्टीचैनल संपर्क केंद्र में, अलग-अलग चैनलों को अलग-अलग प्लेटफ़ॉर्म के माध्यम से एक्सेस किया जा सकता है, और/या ग्राहक डेटा चैनलों में लिंक नहीं हो सकता है। इसके विपरीत, एक ओमनीचैनल संपर्क केंद्र एजेंटों को ग्राहक वार्तालापों को ट्रैक करने की अनुमति देता है, चाहे वे कहीं भी जाएं, बिना किसी एक चैनल में बंद हुए या एक दर्जन प्लेटफ़ॉर्म पर फैले हुए।

<center>
<img src="/images/blog/19-seax-omnichannel-communication/1-contact-center-comparison.png" alt="फ़ीचर तुलना: पारंपरिक कॉल सेंटर बनाम संपर्क केंद्र; मल्टीचैनल बनाम ओमनीचैनल।"/>

*फ़ीचर तुलना: पारंपरिक कॉल सेंटर बनाम संपर्क केंद्र; मल्टीचैनल बनाम ओमनीचैनल।*
</center>

SeaX वस्तुतः किसी भी चैनल के साथ एकीकृत करने में सक्षम है, जिसमें डिफ़ॉल्ट रूप से शामिल हैं: टेक्स्ट, फोन, वेब चैट, फेसबुक, और बहुत कुछ। सभी संदेश और कॉल एक एकीकृत प्लेटफ़ॉर्म पर प्रदर्शित होते हैं, और सभी चैनलों से उपयोगकर्ता डेटा आसानी से उपलब्ध होता है।

यदि आप सीधे डेमो पर जाना चाहते हैं, तो हमारा संक्षिप्त वीडियो देखें जहाँ हम SeaX के ओमनीचैनल संचार का प्रदर्शन करते हैं। इस ब्लॉग के शेष भाग में, हम चरण-दर-चरण चलेंगे कि कैसे विभिन्न चैनलों से संदेश और कॉल SeaX में एक एजेंट को रूट किए जाते हैं। हम आउट-ऑफ-द-बॉक्स समर्थित चैनलों को भी साझा करेंगे और चर्चा करेंगे कि नए चैनलों को कवर करने के लिए SeaX का विस्तार कैसे किया जा सकता है।

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/usb-RK7sHlA" title="YouTube वीडियो प्लेयर" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

# संदेश जीवनचक्र

SeaX [Twilio Flex](https://www.twilio.com/flex) के शीर्ष पर बनाया गया है, जो एक क्लाउड-आधारित संपर्क केंद्र है जो Twilio के क्लाउड संचार प्लेटफ़ॉर्म का उपयोग करता है। Twilio SeaX के लिए मूलभूत बिल्डिंग ब्लॉक प्रदान करता है, जैसे कि दूरसंचार अवसंरचना, संदेश और कार्य रूटिंग, और एक बुनियादी संपर्क केंद्र UI। अब आइए एक आने वाले उपयोगकर्ता संदेश के जीवनचक्र को ट्रैक करें और देखें कि SeaX संदेश को SeaX प्लेटफ़ॉर्म पर एक लाइव एजेंट को रूट करने के लिए कस्टम घटकों के संयोजन में बुनियादी Twilio आर्किटेक्चर का उपयोग कैसे करता है।

## चैनल

<center>
<img src="/images/blog/19-seax-omnichannel-communication/2-example-message.jpg" alt="एक उपयोगकर्ता Google Business Messages पर एक व्यवसाय को संदेश भेज रहा है।" style="width:50%"/>

*Google Business Messages पर किसी व्यवसाय को संदेश भेजना।*
</center>

एक संदेश की यात्रा एक समर्थित प्लेटफ़ॉर्म पर एक उपयोगकर्ता द्वारा एक संदेश लिखने और भेजने के साथ शुरू होती है। उपरोक्त उदाहरण में एक व्यक्ति Google Business Messages पर Seasalt.ai चैटबॉट को संदेश भेज रहा है। डिफ़ॉल्ट रूप से, Twilio Google Business Messages का समर्थन नहीं करता है, इसलिए हम Google प्लेटफ़ॉर्म को Twilio और SeaX से जोड़ने के लिए Seasalt.ai द्वारा विकसित एक कस्टम चैनल कनेक्टर का उपयोग करते हैं।

एक बार संदेश भेजे जाने के बाद, इसे कस्टम कनेक्टर द्वारा Twilio मैसेजिंग API को पास कर दिया जाता है। इस बिंदु पर, Twilio उपयोगकर्ता के लिए एक नया वार्तालाप संदर्भ बनाता है और संदेश को रूट करने की तैयारी करता है।

## संदेश रूटिंग

<center>
<img src="/images/blog/19-seax-omnichannel-communication/3-studio-flow.png" alt="एक साधारण स्टूडियो प्रवाह जो संदेशों को चैटबॉट या लाइव एजेंट को रूट करता है।"/>

*एक साधारण स्टूडियो प्रवाह जो संदेशों को चैटबॉट या लाइव एजेंट को रूट करता है।*
</center>

एक बार जब संदेश Twilio द्वारा प्राप्त हो जाता है, तो उसे सही स्थान पर रूट करने की आवश्यकता होती है। ऐसा करने के लिए, हम यह निर्धारित करने के लिए [Twilio Studio Flows](https://www.twilio.com/studio) का उपयोग करते हैं कि क्या एक स्वचालित प्रतिक्रिया देनी है, संदेश को चैटबॉट पर भेजना है, उपयोगकर्ता को एक लाइव एजेंट से जोड़ना है, या कोई अन्य कार्रवाई करनी है।

ऊपर दिए गए सरल उदाहरण में, सभी आने वाले संदेशों को एक चैटबॉट पर भेजा जाएगा जब तक कि उनमें "लाइव एजेंट" वाक्यांश न हो, जिस स्थिति में उपयोगकर्ता को SeaX प्लेटफ़ॉर्म पर एक लाइव एजेंट को स्थानांतरित कर दिया जाएगा।

## TaskRouter

<center>
<img src="/images/blog/19-seax-omnichannel-communication/4-taskrouter.png" alt="TaskRouter आर्किटेक्चर आरेख।"/>

*TaskRouter आर्किटेक्चर आरेख। [स्रोत](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png)।*
</center>

संदेश को SeaX में स्थानांतरित करने के बाद, अगला कदम यह तय करना है कि कौन सा एजेंट इसे प्राप्त करेगा। [Twilio's TaskRouter](https://www.twilio.com/taskrouter) संदेशों और फोन कॉलों जैसे कार्यों को SeaX में उस एजेंट को सौंपता है जो उन्हें संभालने के लिए सबसे अच्छी तरह से सुसज्जित है। SeaX में प्रत्येक एजेंट को कौशल सौंपा जा सकता है, जैसे कि वे कौन सी भाषाएँ बोलते हैं, वे किस विभाग में काम करते हैं, क्या उन्हें वीआईपी ग्राहकों को संभालना चाहिए, आदि। TaskRouter उपयोगकर्ता और संदेश के बारे में ज्ञात जानकारी की जाँच करेगा और फिर समस्या को संभालने के लिए सबसे उपयुक्त कर्मचारी का चयन करेगा। पिछले चरण से स्टूडियो प्रवाह को अतिरिक्त जानकारी (जैसे पसंदीदा भाषा) प्राप्त करने के लिए अनुकूलित किया जा सकता है, और यह सुनिश्चित करने के लिए कि उनका अनुभव सहज है, ग्राहक जानकारी को वार्तालापों और चैनलों में बनाए रखा जा सकता है।

## SeaX प्लेटफ़ॉर्म

<center>
<img src="/images/blog/19-seax-omnichannel-communication/5-seax-incoming-messages.png" alt="आने वाली कॉल और संदेश SeaX प्लेटफ़ॉर्म पर दिखाई देते हैं।" style="width:50%"/>

*आने वाली कॉल और संदेश SeaX प्लेटफ़ॉर्म पर दिखाई देते हैं।*
</center>

अंत में, आने वाले संदेश को SeaX प्लेटफ़ॉर्म पर उपयुक्त एजेंट के सामने प्रस्तुत किया जाएगा। एजेंट एक साथ कई चैनलों से कई कार्यों को संभाल सकते हैं। उपरोक्त छवि में, एक एजेंट के पास एक इनकमिंग कॉल, एक फेसबुक संदेश और एक वेब चैट संदेश है। एजेंट कार्य को स्वीकार कर सकता है या इसे अगले उपलब्ध एजेंट को पास करने के लिए अस्वीकार कर सकता है।

# समर्थित चैनल

उम्मीद है, अब यह स्पष्ट हो गया है कि ओमनीचैनल संचार क्या है और यह उपयोगकर्ता और एजेंट दोनों के अनुभव को कैसे बढ़ाता है। अंतिम प्रश्न यह है: बॉक्स से बाहर कौन से चैनल समर्थित हैं?

<center>
<img src="/images/blog/19-seax-omnichannel-communication/6-channel-comparison.png" alt="एक पारंपरिक कॉल सेंटर, मूल Twilio Flex और SeaX के बीच समर्थित चैनलों की तुलना।"/>

*एक पारंपरिक कॉल सेंटर, मूल Twilio Flex और SeaX के बीच समर्थित चैनलों की तुलना।*
</center>

जैसा कि पहले उल्लेख किया गया है, पारंपरिक कॉल सेंटर अक्सर केवल फोन कॉल का समर्थन करते हैं। कंपनियाँ अभी भी सोशल मीडिया या ईमेल के माध्यम से ग्राहकों से जुड़ सकती हैं, लेकिन ये संदेश एक एकीकृत प्लेटफ़ॉर्म में एकीकृत नहीं हैं।

दूसरी ओर, Twilio Flex एक उत्कृष्ट ओमनीचैनल संपर्क केंद्र की नींव रखता है। हालाँकि, इसमें बहुत कम आउट-ऑफ-द-बॉक्स चैनल हैं। फोन कॉल और एसएमएस के अलावा, उनके पास फेसबुक, व्हाट्सएप और ईमेल के लिए बीटा समर्थन है।

SeaX Flex के शीर्ष पर बनाया गया है और कुछ सबसे अधिक अनुरोधित चैनलों के लिए अंतर्निहित समर्थन जोड़ता है: जैसे Google Business Messages, Discord, Line, और Instagram। इसके अतिरिक्त, Seasalt.ai हमेशा नए चैनलों को SeaX उत्पाद लाइन में लाने के लिए ग्राहकों के साथ काम कर रहा है। SeaX अत्यधिक अनुकूलन योग्य और आसानी से विस्तार योग्य है - इसका मतलब है कि हम आपकी कंपनी के साथ काम कर सकते हैं ताकि आप जिस भी चैनल को सबसे ज्यादा चाहते हैं उसे एकीकृत कर सकें।

यह पढ़ने के लिए समय निकालने के लिए धन्यवाद कि कैसे SeaX क्लाउड संपर्क केंद्र एक सहज ग्राहक और एजेंट अनुभव प्रदान करने के लिए ओमनीचैनल संचार का लाभ उठाता है। हमारे अगले ब्लॉग पोस्ट के लिए बने रहें, जो यह पता लगाएगा कि "वितरित संपर्क केंद्र" होने का क्या मतलब है। यदि आप अभी और जानने में रुचि रखते हैं, तो SeaX प्लेटफ़ॉर्म का प्रत्यक्ष अनुभव करने के लिए हमारा [डेमो अनुरोध फ़ॉर्म](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) भरें।`;export{n as default};
