const n=`---
title: "اجمع العملاء من أي قناة في مكان واحد باستخدام اتصالات SeaX متعددة القنوات"
metatitle: "توحيد جهات اتصال العملاء من خلال اتصالات SeaX متعددة القنوات"
date: 2022-07-15 13:56:54-07:00
modified_date: 2025-08-02 17:00:00-07:00
draft: false
author: Kim Dodds
description: "في هذه المدونة، نسلط الضوء على أحد اتصالات SeaX متعددة القنوات، والذي يسمح بعرض رسائل المستخدم من أي قناة على منصة SeaX."
weight: 1
tags:
  - SeaX
image: images/blog/19-seax-omnichannel-communication/0-thumbnail.png
canonicalURL: /blog/seax-omnichannel-communication/
url: /blog/seax-omnichannel-communication/
---

*في منشور مدونتنا السابق، [مرحبًا بك في SeaX، مركز اتصال سحابي تعاوني](https://seasalt.ai/blog/18-seax-collaborative-cloud-contact-center-introduction/)، قدمنا SeaX، حل مركز الاتصال السحابي التعاوني الخاص بنا. بينما قدم منشور مدونتنا الأول نظرة عامة شاملة على الميزات الأساسية والأكثر تقدمًا في SeaX، فإن منشوراتنا اللاحقة ستتعمق في بعض الميزات الفردية التي تجعل SeaX متميزًا. في هذا المنشور، سنلقي نظرة فاحصة على دعم SeaX متعدد القنوات ونرى كيف تظهر المكالمات والرسائل من قنوات مختلفة على منصة SeaX.*

# جدول المحتويات
- [ما هي الاتصالات متعددة القنوات؟](#what-is-omnichannel-communication)
- [دورة حياة الرسالة](#message-lifecycle)
    - [القناة](#channel)
    - [توجيه الرسائل](#message-routing)
    - [TaskRouter](#taskrouter)
    - [منصة SeaX](#seax-platform)
- [القنوات المدعومة](#supported-channels)

# ما هي الاتصالات متعددة القنوات؟

أولاً، ماذا يعني مصطلح "متعدد القنوات" بالضبط؟ عند تقسيمه، "omni" هي بادئة تعني "الكل"، و "القناة" هي المنصات المختلفة التي يمكنك من خلالها التفاعل مع عملائك. لذلك، ببساطة، تعني "الاتصالات متعددة القنوات" القدرة على التواصل عبر أي وجميع القنوات المتاحة. ليس ذلك فحسب، بل تعني الاتصالات متعددة القنوات أيضًا أن التجربة بين القنوات سلسة. من جانب الوكيل، يتم تقديم الاتصالات من جميع القنوات في واجهة موحدة. بالنسبة للعميل، تكون بيانات تفاعله ثابتة عبر القنوات.

غالبًا ما تدعم مراكز الاتصال التقليدية المكالمات الهاتفية فقط. مراكز الاتصال الأكثر تقدمًا التي تتواصل مع العملاء عبر قنوات متعددة، مثل البريد الإلكتروني والدردشة عبر الويب والهاتف، لديها مراكز اتصال متعددة القنوات. ومع ذلك، لمجرد أن مركز الاتصال يستخدم قنوات متعددة لا يعني أن تجربته سلسة. في مركز اتصال متعدد القنوات، قد يتم الوصول إلى قنوات مختلفة عبر منصات منفصلة، و/أو قد لا تكون بيانات العملاء مرتبطة عبر القنوات. في المقابل، يتيح مركز الاتصال متعدد القنوات للوكلاء تتبع محادثات العملاء أينما ذهبوا، دون أن يكونوا محصورين في قناة واحدة أو منتشرين عبر عشرات المنصات.

<center>
<img src="/images/blog/19-seax-omnichannel-communication/1-contact-center-comparison.png" alt="مقارنة الميزات: مركز الاتصال التقليدي مقابل مركز الاتصال؛ متعدد القنوات مقابل متعدد القنوات."/>

*مقارنة الميزات: مركز الاتصال التقليدي مقابل مركز الاتصال؛ متعدد القنوات مقابل متعدد القنوات.*
</center>

SeaX قادر على التكامل مع أي قناة تقريبًا، بما في ذلك افتراضيًا: الرسائل النصية والهاتف والدردشة عبر الويب و Facebook والمزيد. يتم عرض جميع الرسائل والمكالمات على منصة موحدة، وتكون بيانات المستخدم من جميع القنوات متاحة بسهولة.

إذا كنت ترغب في مشاهدة العرض التوضيحي مباشرة، شاهد مقطع الفيديو القصير الخاص بنا الذي يعرض اتصالات SeaX متعددة القنوات. في بقية هذه المدونة، سنستعرض خطوة بخطوة كيفية توجيه الرسائل والمكالمات من قنوات مختلفة إلى وكيل في SeaX. سنشارك أيضًا القنوات المدعومة الجاهزة ونناقش كيفية توسيع SeaX لتغطية قنوات جديدة.

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/usb-RK7sHlA" title="مشغل فيديو يوتيوب" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

# دورة حياة الرسالة

تم بناء SeaX على [Twilio Flex](https://www.twilio.com/flex)، وهو مركز اتصال قائم على السحابة يستخدم منصة اتصالات Twilio السحابية. يوفر Twilio اللبنات الأساسية لـ SeaX، مثل البنية التحتية للاتصالات وتوجيه الرسائل والمهام وواجهة مستخدم مركز الاتصال الأساسية. لنتتبع الآن دورة حياة رسالة مستخدم واردة ونرى كيف يستخدم SeaX بنية Twilio الأساسية جنبًا إلى جنب مع المكونات المخصصة لتوجيه الرسالة إلى وكيل مباشر على منصة SeaX.

## القناة

<center>
<img src="/images/blog/19-seax-omnichannel-communication/2-example-message.jpg" alt="يرسل المستخدم رسالة إلى شركة عبر رسائل Google Business." style="width:50%"/>

*إرسال رسالة إلى شركة عبر رسائل Google Business.*
</center>

تبدأ رحلة الرسالة عندما يقوم المستخدم بإنشاء رسالة وإرسالها على منصة مدعومة. يوضح المثال أعلاه شخصًا يرسل رسالة إلى روبوت محادثة Seasalt.ai على رسائل Google Business. بشكل افتراضي، لا تدعم Twilio رسائل Google Business، لذلك نستخدم موصل قناة مخصص تم تطويره بواسطة Seasalt.ai لربط منصة Google بـ Twilio و SeaX.

بمجرد إرسال الرسالة، يتم تمريرها بواسطة الموصل المخصص إلى واجهة برمجة تطبيقات Twilio للمراسلة. في هذه المرحلة، تنشئ Twilio سياق محادثة جديدًا للمستخدم وتستعد لتوجيه الرسالة.

## توجيه الرسائل

<center>
<img src="/images/blog/19-seax-omnichannel-communication/3-studio-flow.png" alt="تدفق استوديو بسيط يوجه الرسائل إلى روبوت محادثة أو وكيل مباشر."/>

*تدفق استوديو بسيط يوجه الرسائل إلى روبوت محادثة أو وكيل مباشر.*
</center>

بمجرد استلام الرسالة بواسطة Twilio، يجب توجيهها إلى الموقع الصحيح. للقيام بذلك، نستخدم [Twilio Studio Flows](https://www.twilio.com/studio) لتحديد ما إذا كنا سنقدم ردًا آليًا، أو نعيد توجيه الرسالة إلى روبوت محادثة، أو نربط المستخدم بوكيل مباشر، أو نقوم بإجراء آخر.

في المثال البسيط المقدم أعلاه، سيتم إعادة توجيه جميع الرسائل الواردة إلى روبوت محادثة ما لم تتضمن عبارة "وكيل مباشر"، وفي هذه الحالة سيتم نقل المستخدم إلى وكيل مباشر على منصة SeaX.

## TaskRouter

<center>
<img src="/images/blog/19-seax-omnichannel-communication/4-taskrouter.png" alt="رسم تخطيطي لبنية TaskRouter."/>

*رسم تخطيطي لبنية TaskRouter. [المصدر](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

بعد نقل الرسالة إلى SeaX، فإن الخطوة التالية هي تحديد الوكيل الذي سيستلمها. يقوم [Twilio's TaskRouter](https://www.twilio.com/taskrouter) بتعيين مهام مثل الرسائل والمكالمات الهاتفية للوكيل في SeaX الأفضل تجهيزًا للتعامل معها. يمكن تعيين مهارات لكل وكيل في SeaX، مثل اللغات التي يتحدثونها، والقسم الذي يعملون فيه، وما إذا كان ينبغي عليهم التعامل مع عملاء VIP، وما إلى ذلك. سيقوم TaskRouter بفحص المعلومات المعروفة حول المستخدم والرسالة ثم تحديد الموظف الأنسب للتعامل مع المشكلة. يمكن تخصيص تدفق الاستوديو من الخطوة السابقة للحصول على معلومات إضافية (مثل اللغة المفضلة)، ويمكن الاحتفاظ بمعلومات العميل عبر المحادثات والقنوات لضمان أن تكون تجربتهم سلسة.

## منصة SeaX

<center>
<img src="/images/blog/19-seax-omnichannel-communication/5-seax-incoming-messages.png" alt="تظهر المكالمات والرسائل الواردة على منصة SeaX." style="width:50%"/>

*تظهر المكالمات والرسائل الواردة على منصة SeaX.*
</center>

أخيرًا، سيتم عرض الرسالة الواردة على الوكيل المناسب على منصة SeaX. يمكن للوكلاء التعامل مع مهام متعددة من قنوات متعددة في وقت واحد. في الصورة أعلاه، لدى وكيل واحد مكالمة واردة ورسالة Facebook ورسالة دردشة عبر الويب. يمكن للوكيل قبول المهمة أو رفضها لتمريرها إلى الوكيل المتاح التالي.

# القنوات المدعومة

نأمل أن يكون من الواضح الآن ما هي الاتصالات متعددة القنوات وكيف تعزز تجربة المستخدم والوكيل. السؤال الأخير هو: ما هي القنوات المدعومة الجاهزة؟

<center>
<img src="/images/blog/19-seax-omnichannel-communication/6-channel-comparison.png" alt="مقارنة القنوات المدعومة بين مركز الاتصال التقليدي و Twilio Flex الأساسي و SeaX."/>

*مقارنة القنوات المدعومة بين مركز الاتصال التقليدي و Twilio Flex الأساسي و SeaX.*
</center>

كما ذكرنا سابقًا، غالبًا ما تدعم مراكز الاتصال التقليدية المكالمات الهاتفية فقط. قد لا تزال الشركات تتفاعل مع العملاء عبر وسائل التواصل الاجتماعي أو البريد الإلكتروني، ولكن هذه الرسائل ليست مدمجة في منصة موحدة.

من ناحية أخرى، يضع Twilio Flex الأساس لمركز اتصال ممتاز متعدد القنوات. ومع ذلك، فإنه يحتوي على عدد قليل من القنوات الجاهزة. بالإضافة إلى المكالمات الهاتفية والرسائل القصيرة، لديهم دعم تجريبي لـ Facebook و WhatsApp والبريد الإلكتروني.

تم بناء SeaX على Flex ويضيف دعمًا مدمجًا لبعض القنوات الأكثر طلبًا: مثل رسائل Google Business و Discord و Line و Instagram. بالإضافة إلى ذلك، تعمل Seasalt.ai دائمًا مع العملاء لتقديم قنوات جديدة إلى خط إنتاج SeaX. SeaX قابل للتخصيص بدرجة عالية وقابل للتوسيع بسهولة - مما يعني أنه يمكننا العمل مع شركتك لدمج أي قناة تريدها بشدة.

شكرًا لك على الوقت الذي قضيته في قراءة كيف يستفيد مركز اتصال SeaX السحابي من الاتصالات متعددة القنوات لتوفير تجربة سلسة للعملاء والوكلاء. ترقبوا منشور مدونتنا التالي، والذي سيستكشف ما يعنيه أن تكون "مركز اتصال موزع". إذا كنت مهتمًا بمعرفة المزيد الآن، فاملأ [نموذج طلب العرض التوضيحي](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) لتجربة منصة SeaX بنفسك.`;export{n as default};
