const n=`---
title: "எந்த சேனலிலிருந்தும் SeaX முழு சேனல் தகவல் தொடர்பு மூலம் வாடிக்கையாளர்களை ஒரு இடத்திற்கு கொண்டு வருதல்"
metatitle: "SeaX முழு சேனல் தகவல் தொடர்பு மூலம் வாடிக்கையாளர் தொடர்புகளை ஒருங்கிணைத்தல்"
date: 2022-07-15 13:56:54-07:00
modified_date: 2024-12-19 10:30:00+00:00
draft: false
author: Kim Dodds
description: "இந்த வலைப்பதிவில், SeaX இன் முழு சேனல் தகவல் தொடர்பு அம்சங்களில் ஒன்றை நாங்கள் மையமாக வைத்துள்ளோம், இது எந்த சேனலிலிருந்தும் வரும் பயனர் செய்திகளை SeaX தளத்தில் காட்ட அனுமதிக்கிறது."
weight: 1
tags:
  - SeaX
image: images/blog/19-seax-omnichannel-communication/0-thumbnail.png
canonicalURL: /blog/seax-omnichannel-communication/
url: /blog/seax-omnichannel-communication/
---

*எங்கள் முந்தைய வலைப்பதிவு இடுகையில், [SeaX க்கு வரவேற்கிறோம், ஒரு கூட்டு கிளவுட் தொடர்பு மையம்](https://seasalt.ai/blog/18-seax-collaborative-cloud-contact-center-introduction/), நாங்கள் எங்கள் கூட்டு கிளவுட் தகவல் தொடர்பு தொடர்பு மைய தீர்வான SeaX ஐ அறிமுகப்படுத்தினோம். எங்கள் முதல் வலைப்பதிவு இடுகை SeaX இன் அடிப்படை மற்றும் மேம்பட்ட அம்சங்களின் விரிவான கண்ணோட்டத்தை வழங்கியிருந்தாலும், எங்கள் அடுத்தடுத்த இடுகைகள் SeaX ஐ தனித்து நிற்கச் செய்யும் சில தனிப்பட்ட அம்சங்களை ஆழமாக ஆராயும். இந்த இடுகையில், SeaX இன் முழு சேனல் ஆதரவை நாங்கள் கூர்ந்து கவனித்து, வெவ்வேறு சேனல்களிலிருந்து அழைப்புகள் மற்றும் செய்திகள் SeaX தளத்தில் எவ்வாறு தோன்றும் என்பதைக் காண்போம்.*

# பொருளடக்கம்
- [முழு சேனல் தகவல் தொடர்பு என்றால் என்ன?](#what-is-omnichannel-communication)
- [செய்தி வாழ்க்கைச் சுழற்சி](#message-lifecycle)
    - [சேனல்](#channel)
    - [செய்தி வழித்தடம்](#message-routing)
    - [TaskRouter](#taskrouter)
    - [SeaX தளம்](#seax-platform)
- [ஆதரிக்கப்படும் சேனல்கள்](#supported-channels)

# முழு சேனல் தகவல் தொடர்பு என்றால் என்ன?

முதலில், "முழு சேனல்" என்பதன் அர்த்தம் என்ன? பிரித்தெழுதினால், "omni" என்பது "அனைத்து" என்று பொருள்படும் ஒரு முன்னொட்டு, மற்றும் "சேனல்" என்பது உங்கள் வாடிக்கையாளர்களுடன் நீங்கள் ஈடுபடக்கூடிய பல்வேறு தளங்கள். எனவே, எளிமையாகச் சொன்னால், "முழு சேனல் தகவல் தொடர்பு" என்பது கிடைக்கக்கூடிய எந்த மற்றும் அனைத்து சேனல்கள் மூலமாகவும் தொடர்பு கொள்ள முடிவதாகும். அது மட்டுமல்லாமல், முழு சேனல் தகவல் தொடர்பு என்பது சேனல்களுக்கு இடையிலான அனுபவம் தடையற்றது என்பதையும் குறிக்கிறது. முகவர் பக்கத்தில், அனைத்து சேனல்களிலிருந்தும் வரும் தகவல் தொடர்புகள் ஒரு ஒருங்கிணைந்த இடைமுகத்தில் வழங்கப்படுகின்றன. வாடிக்கையாளருக்கு, அவர்களின் தொடர்புத் தரவு சேனல்கள் முழுவதும் நீடித்திருக்கும்.

பாரம்பரிய அழைப்பு மையங்கள் பெரும்பாலும் தொலைபேசி அழைப்புகளை மட்டுமே ஆதரிக்கின்றன. மின்னஞ்சல், வலை அரட்டை மற்றும் தொலைபேசி போன்ற பல சேனல்களில் வாடிக்கையாளர்களுடன் ஈடுபடும் மேம்பட்ட தொடர்பு மையங்கள் ஒரு பல சேனல் தொடர்பு மையத்தைக் கொண்டுள்ளன. இருப்பினும், ஒரு தொடர்பு மையம் பல சேனல்களைப் பயன்படுத்துவதால் அவர்களின் அனுபவம் தடையற்றது என்று அர்த்தமல்ல. ஒரு பல சேனல் தொடர்பு மையத்தில், வெவ்வேறு சேனல்களை தனித்தனி தளங்கள் மூலம் அணுகலாம், மற்றும்/அல்லது வாடிக்கையாளர் தரவு சேனல்கள் முழுவதும் இணைக்கப்படாமல் இருக்கலாம். இதற்கு மாறாக, ஒரு முழு சேனல் தொடர்பு மையம் முகவர்கள் வாடிக்கையாளர் உரையாடல்களை அவர்கள் எங்கு சென்றாலும் கண்காணிக்க அனுமதிக்கிறது, ஒரு சேனலில் பூட்டப்படாமல் அல்லது ஒரு டஜன் தளங்களில் பரவாமல்.

<center>
<img src="/images/blog/19-seax-omnichannel-communication/1-contact-center-comparison.png" alt="அம்ச ஒப்பீடு: பாரம்பரிய அழைப்பு மையம் vs. தொடர்பு மையம்; பல சேனல் vs. முழு சேனல்."/>

*அம்ச ஒப்பீடு: பாரம்பரிய அழைப்பு மையம் vs. தொடர்பு மையம்; பல சேனல் vs. முழு சேனல்.*
</center>

SeaX இயல்பாகவே எந்த சேனலுடனும் ஒருங்கிணைக்க முடியும், இதில் இயல்பாகவே அடங்கும்: உரை, தொலைபேசி, வலை அரட்டை, Facebook மற்றும் பல. அனைத்து செய்திகளும் அழைப்புகளும் ஒரு ஒருங்கிணைந்த தளத்தில் காட்டப்படும், மேலும் அனைத்து சேனல்களிலிருந்தும் பயனர் தரவு உடனடியாகக் கிடைக்கும்.

நீங்கள் நேரடியாக டெமோவிற்குச் செல்ல விரும்பினால், SeaX இன் முழு சேனல் தகவல் தொடர்பை நாங்கள் ஆர்ப்பரிக்கும் எங்கள் குறுகிய வீடியோவைப் பாருங்கள். இந்த வலைப்பதிவின் மீதமுள்ள பகுதியில், பல்வேறு சேனல்களிலிருந்து செய்திகளும் அழைப்புகளும் SeaX இல் உள்ள ஒரு முகவருக்கு எவ்வாறு அனுப்பப்படுகின்றன என்பதை படிப்படியாகப் பார்ப்போம். பெட்டிக்கு வெளியே ஆதரிக்கப்படும் சேனல்களையும் நாங்கள் பகிர்ந்துகொள்வோம், மேலும் புதிய சேனல்களை உள்ளடக்க SeaX ஐ எவ்வாறு விரிவாக்கலாம் என்பதைப் பற்றி விவாதிப்போம்.

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/usb-RK7sHlA" title="YouTube வீடியோ பிளேயர்" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

# செய்தி வாழ்க்கைச் சுழற்சி

SeaX [Twilio Flex](https://www.twilio.com/flex) இன் மேல் கட்டமைக்கப்பட்டுள்ளது, இது Twilio இன் கிளவுட் தகவல் தொடர்பு தளத்தைப் பயன்படுத்தும் ஒரு கிளவுட் அடிப்படையிலான தொடர்பு மையம். Twilio தொலைத்தொடர்பு உள்கட்டமைப்பு, செய்தி மற்றும் பணி வழித்தடம் மற்றும் ஒரு அடிப்படை தொடர்பு மைய UI போன்ற SeaX க்கான அடிப்படைக் கட்டுமானத் தொகுதிகளை வழங்குகிறது. இப்போது உள்வரும் பயனர் செய்தியின் வாழ்க்கைச் சுழற்சியைக் கண்காணித்து, SeaX அடிப்படை Twilio கட்டமைப்பை தனிப்பயன் கூறுகளுடன் இணைந்து SeaX தளத்தில் ஒரு நேரடி முகவருக்கு செய்தியை எவ்வாறு அனுப்புகிறது என்பதைப் பார்ப்போம்.

## சேனல்

<center>
<img src="/images/blog/19-seax-omnichannel-communication/2-example-message.jpg" alt="ஒரு பயனர் Google Business Messages இல் ஒரு வணிகத்திற்கு செய்தி அனுப்புகிறார்." style="width:50%"/>

*Google Business Messages இல் ஒரு வணிகத்திற்கு செய்தி அனுப்புதல்.*
</center>

ஒரு செய்தியின் பயணம் ஒரு பயனர் ஆதரிக்கப்படும் தளத்தில் ஒரு செய்தியை உருவாக்கி அனுப்புவதில் தொடங்குகிறது. மேலே உள்ள எடுத்துக்காட்டு Google Business Messages இல் Seasalt.ai அரட்டை ரோபோவிற்கு யாரோ செய்தி அனுப்புவதைக் காட்டுகிறது. இயல்பாக, Twilio Google Business Messages ஐ ஆதரிக்காது, எனவே Google தளத்தை Twilio மற்றும் SeaX உடன் இணைக்க Seasalt.ai ஆல் உருவாக்கப்பட்ட தனிப்பயன் சேனல் இணைப்பியை நாங்கள் பயன்படுத்துகிறோம்.

செய்தி அனுப்பப்பட்டதும், அது தனிப்பயன் இணைப்பியால் Twilio Messaging API க்கு அனுப்பப்படுகிறது. இந்த கட்டத்தில், Twilio பயனருக்காக ஒரு புதிய உரையாடல் சூழலை உருவாக்கி, செய்தியை அனுப்பத் தயாராகிறது.

## செய்தி வழித்தடம்

<center>
<img src="/images/blog/19-seax-omnichannel-communication/3-studio-flow.png" alt="செய்திகளை ஒரு அரட்டை ரோபோ அல்லது நேரடி முகவருக்கு அனுப்பும் ஒரு எளிய Studio பாய்வு."/>

*செய்திகளை ஒரு அரட்டை ரோபோ அல்லது நேரடி முகவருக்கு அனுப்பும் ஒரு எளிய Studio பாய்வு.*
</center>

செய்தி Twilio ஆல் பெறப்பட்டதும், அதை சரியான இடத்திற்கு அனுப்ப வேண்டும். இதைச் செய்ய, தானியங்கு பதிலை அளிக்க வேண்டுமா, செய்தியை ஒரு அரட்டை ரோபோவிற்கு அனுப்ப வேண்டுமா, பயனரை ஒரு நேரடி முகவருடன் இணைக்க வேண்டுமா, அல்லது வேறு சில செயல்களைச் செய்ய வேண்டுமா என்பதைத் தீர்மானிக்க [Twilio Studio Flows](https://www.twilio.com/studio) ஐப் பயன்படுத்துகிறோம்.

மேலே கொடுக்கப்பட்டுள்ள எளிய எடுத்துக்காட்டில், உள்வரும் அனைத்து செய்திகளும் "நேரடி முகவர்" என்ற சொற்றொடரைக் கொண்டிருக்காவிட்டால் ஒரு அரட்டை ரோபோவிற்கு அனுப்பப்படும், அந்த நிலையில் பயனர் SeaX தளத்தில் ஒரு நேரடி முகவருக்கு மாற்றப்படுவார்.

## TaskRouter

<center>
<img src="/images/blog/19-seax-omnichannel-communication/4-taskrouter.png" alt="TaskRouter கட்டமைப்பு வரைபடம்."/>

*TaskRouter கட்டமைப்பு வரைபடம். [ஆதாரம்](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

செய்தி SeaX க்கு மாற்றப்பட்ட பிறகு, அடுத்த கட்டமாக எந்த முகவர் அதைப் பெறுவார் என்பதைத் தீர்மானிப்பதாகும். [Twilio's TaskRouter](https://www.twilio.com/taskrouter) செய்திகள் மற்றும் தொலைபேசி அழைப்புகள் போன்ற பணிகளை SeaX இல் உள்ள முகவருக்கு ஒதுக்குகிறது, அவர் அவற்றைக் கையாள சிறந்த முறையில் தயாராக இருப்பார். SeaX இல் உள்ள ஒவ்வொரு முகவருக்கும் அவர்கள் பேசும் மொழிகள், அவர்கள் எந்தத் துறையில் பணிபுரிகிறார்கள், அவர்கள் VIP வாடிக்கையாளர்களைக் கையாள வேண்டுமா போன்ற திறன்களை ஒதுக்கலாம். TaskRouter பயனர் மற்றும் செய்தியைப் பற்றிய அறியப்பட்ட தகவல்களைச் சரிபார்த்து, சிக்கலைக் கையாள மிகவும் பொருத்தமான பணியாளரைத் தேர்ந்தெடுக்கும். முந்தைய படியிலிருந்து Studio பாய்வு கூடுதல் தகவல்களை (விருப்பமான மொழி போன்றவை) பெற தனிப்பயனாக்கப்படலாம், மேலும் வாடிக்கையாளர் தகவல்கள் உரையாடல்கள் மற்றும் சேனல்கள் முழுவதும் நீடித்திருக்கலாம், அவர்களின் அனுபவம் தடையற்றது என்பதை உறுதிப்படுத்த.

## SeaX தளம்

<center>
<img src="/images/blog/19-seax-omnichannel-communication/5-seax-incoming-messages.png" alt="உள்வரும் அழைப்புகள் மற்றும் செய்திகள் SeaX தளத்தில் தோன்றும்." style="width:50%"/>

*உள்வரும் அழைப்புகள் மற்றும் செய்திகள் SeaX தளத்தில் தோன்றும்.*
</center>

இறுதியாக, உள்வரும் செய்தி SeaX தளத்தில் பொருத்தமான முகவருக்கு வழங்கப்படும். முகவர்கள் ஒரே நேரத்தில் பல சேனல்களிலிருந்து பல பணிகளைக் கையாள முடியும். மேலே உள்ள படத்தில், ஒரு முகவருக்கு உள்வரும் அழைப்பு, ஒரு Facebook செய்தி மற்றும் ஒரு வலை அரட்டை செய்தி உள்ளது. முகவர் பணியை ஏற்கலாம் அல்லது அடுத்த கிடைக்கக்கூடிய முகவருக்கு அனுப்ப அதை நிராகரிக்கலாம்.

# ஆதரிக்கப்படும் சேனல்கள்

முழு சேனல் தகவல் தொடர்பு என்றால் என்ன, அது பயனர் மற்றும் முகவர் அனுபவத்தை எவ்வாறு மேம்படுத்துகிறது என்பது இப்போது தெளிவாக இருக்கும் என்று நம்புகிறோம். கடைசி கேள்வி: பெட்டிக்கு வெளியே எந்த சேனல்கள் ஆதரிக்கப்படுகின்றன?

<center>
<img src="/images/blog/19-seax-omnichannel-communication/6-channel-comparison.png" alt="ஒரு பாரம்பரிய அழைப்பு மையம், அடிப்படை Twilio Flex மற்றும் SeaX ஆகியவற்றுக்கு இடையே ஆதரிக்கப்படும் சேனல்களின் ஒப்பீடு."/>

*ஒரு பாரம்பரிய அழைப்பு மையம், அடிப்படை Twilio Flex மற்றும் SeaX ஆகியவற்றுக்கு இடையே ஆதரிக்கப்படும் சேனல்களின் ஒப்பீடு.*
</center>

முன்னர் குறிப்பிட்டபடி, பாரம்பரிய அழைப்பு மையங்கள் பெரும்பாலும் தொலைபேசி அழைப்புகளை மட்டுமே ஆதரிக்கின்றன. நிறுவனங்கள் இன்னும் சமூக ஊடகங்கள் அல்லது மின்னஞ்சல் வழியாக வாடிக்கையாளர்களுடன் ஈடுபடலாம், ஆனால் இந்த செய்திகள் ஒரு ஒருங்கிணைந்த தளத்தில் ஒருங்கிணைக்கப்படவில்லை.

மறுபுறம், Twilio Flex ஒரு சிறந்த முழு சேனல் தொடர்பு மையத்திற்கான அடித்தளத்தை அமைக்கிறது. இருப்பினும், இது பெட்டிக்கு வெளியே மிகக் குறைவான சேனல்களைக் கொண்டுள்ளது. தொலைபேசி அழைப்புகள் மற்றும் SMS தவிர, Facebook, WhatsApp மற்றும் மின்னஞ்சலுக்கான பீட்டா ஆதரவைக் கொண்டுள்ளன.

SeaX Flex இன் மேல் கட்டமைக்கப்பட்டுள்ளது மற்றும் Google Business Messages, Discord, Line மற்றும் Instagram போன்ற மிகவும் கோரப்பட்ட சில சேனல்களுக்கு உள்ளமைக்கப்பட்ட ஆதரவைச் சேர்க்கிறது. கூடுதலாக, Seasalt.ai புதிய சேனல்களை SeaX தயாரிப்பு வரிசையில் கொண்டு வர வாடிக்கையாளர்களுடன் தொடர்ந்து பணியாற்றி வருகிறது. SeaX மிகவும் தனிப்பயனாக்கக்கூடியது மற்றும் எளிதில் விரிவாக்கக்கூடியது - இதன் பொருள், நீங்கள் மிகவும் விரும்பும் எந்த சேனலையும் ஒருங்கிணைக்க உங்கள் நிறுவனத்துடன் நாங்கள் பணியாற்ற முடியும்.

SeaX கிளவுட் தொடர்பு மையம் முழு சேனல் தகவல் தொடர்பைப் பயன்படுத்தி ஒரு தடையற்ற வாடிக்கையாளர் மற்றும் முகவர் அனுபவத்தை வழங்குகிறது. எங்கள் அடுத்த வலைப்பதிவு இடுகைக்காக காத்திருங்கள், இது "விநியோகிக்கப்பட்ட தொடர்பு மையம்" என்றால் என்ன என்பதை ஆராயும். நீங்கள் இப்போது மேலும் அறிய ஆர்வமாக இருந்தால், SeaX தளத்தை நேரில் அனுபவிக்க எங்கள் [டெமோ கோரிக்கை படிவத்தை](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) நிரப்பவும்.`;export{n as default};
