const n=`---
title: "مشتریان را از هر کانالی با ارتباطات چند کاناله SeaX به یک مکان بیاورید"
metatitle: "نقاط تماس مشتری را با ارتباطات چند کاناله SeaX یکپارچه کنید"
date: 2022-07-15 13:56:54-07:00
modified_date: 2025-08-02 17:00:00-07:00
draft: false
author: Kim Dodds
description: "در این وبلاگ، ما یکی از ارتباطات چند کاناله SeaX را برجسته می کنیم که به پیام های کاربر از هر کانالی اجازه می دهد تا در پلتفرم SeaX ظاهر شوند."
weight: 1
tags:
  - SeaX
image: images/blog/19-seax-omnichannel-communication/0-thumbnail.png
canonicalURL: /blog/seax-omnichannel-communication/
url: /blog/seax-omnichannel-communication/
---

*در پست وبلاگ قبلی ما، [به SeaX خوش آمدید، یک مرکز تماس ابری مشترک](https://seasalt.ai/blog/18-seax-collaborative-cloud-contact-center-introduction/)، ما SeaX، راه حل مرکز تماس ارتباطات ابری مشترک خود را معرفی کردیم. در حالی که اولین پست وبلاگ ما یک نمای کلی از ویژگی های اساسی و پیشرفته تر SeaX ارائه می دهد، پست های بعدی ما به برخی از ویژگی های فردی که SeaX را متمایز می کند، عمیق تر می پردازند. در این پست، ما نگاهی دقیق تر به پشتیبانی چند کاناله SeaX خواهیم داشت و خواهیم دید که چگونه تماس ها و پیام ها از کانال های مختلف در پلتفرم SeaX ظاهر می شوند.*

# فهرست مطالب
- [ارتباطات چند کاناله چیست؟](#what-is-omnichannel-communication)
- [چرخه عمر پیام](#message-lifecycle)
    - [کانال](#channel)
    - [مسیریابی پیام](#message-routing)
    - [TaskRouter](#taskrouter)
    - [پلتفرم SeaX](#seax-platform)
- [کانال های پشتیبانی شده](#supported-channels)

# ارتباطات چند کاناله چیست؟

اول از همه، "چند کاناله" دقیقا به چه معناست؟ به طور خلاصه، "omni" یک پیشوند به معنای "همه" است و "کانال" پلتفرم های مختلفی است که می توانید با مشتریان خود در آن تعامل داشته باشید. بنابراین، به زبان ساده، "ارتباطات چند کاناله" به معنای توانایی برقراری ارتباط از طریق هر و همه کانال های موجود است. نه تنها این، بلکه ارتباطات چند کاناله به این معنی است که تجربه بین کانال ها یکپارچه است. از طرف نماینده، ارتباطات از همه کانال ها در یک رابط یکپارچه ارائه می شود. برای مشتری، داده های تعامل آنها در سراسر کانال ها پایدار است.

مراکز تماس سنتی اغلب فقط از تماس های تلفنی پشتیبانی می کنند. مراکز تماس پیشرفته تر که با مشتریان از طریق چندین کانال مانند ایمیل، چت وب و تلفن در ارتباط هستند، یک مرکز تماس چند کاناله دارند. با این حال، فقط به این دلیل که یک مرکز تماس از چندین کانال استفاده می کند، به این معنی نیست که تجربه آنها یکپارچه است. در یک مرکز تماس چند کاناله، ممکن است به کانال های مختلف از طریق پلتفرم های جداگانه دسترسی پیدا شود و/یا داده های مشتری ممکن است در سراسر کانال ها مرتبط نباشد. در مقابل، یک مرکز تماس چند کاناله به نمایندگان اجازه می دهد تا مکالمات مشتری را در هر کجا که می روند ردیابی کنند، بدون اینکه در یک کانال قفل شوند یا در ده ها پلتفرم پخش شوند.

<center>
<img src="/images/blog/19-seax-omnichannel-communication/1-contact-center-comparison.png" alt="مقایسه ویژگی ها: مرکز تماس سنتی در مقابل مرکز تماس؛ چند کاناله در مقابل چند کاناله."/>

*مقایسه ویژگی ها: مرکز تماس سنتی در مقابل مرکز تماس؛ چند کاناله در مقابل چند کاناله.*
</center>

SeaX قادر به ادغام با تقریبا هر کانالی است، از جمله به طور پیش فرض: متن، تلفن، چت وب، فیس بوک و موارد دیگر. همه پیام ها و تماس ها در یک پلتفرم یکپارچه نمایش داده می شوند و داده های کاربر از همه کانال ها به راحتی در دسترس است.

اگر می خواهید مستقیماً به نسخه ی نمایشی بروید، ویدیوی کوتاه ما را که ارتباطات چند کاناله SeaX را نشان می دهد، تماشا کنید. در ادامه این وبلاگ، ما گام به گام نحوه مسیریابی پیام ها و تماس ها از کانال های مختلف به یک نماینده در SeaX را بررسی خواهیم کرد. ما همچنین کانال های پشتیبانی شده خارج از جعبه را به اشتراک می گذاریم و در مورد چگونگی گسترش SeaX برای پوشش کانال های جدید بحث خواهیم کرد.

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/usb-RK7sHlA" title="پخش کننده ویدیوی یوتیوب" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

# چرخه عمر پیام

SeaX بر روی [Twilio Flex](https://www.twilio.com/flex) ساخته شده است، یک مرکز تماس مبتنی بر ابر که از پلتفرم ارتباطات ابری Twilio استفاده می کند. Twilio بلوک های ساختمانی اساسی را برای SeaX فراهم می کند، مانند زیرساخت های مخابراتی، مسیریابی پیام و وظیفه، و یک رابط کاربری مرکز تماس اساسی. اکنون بیایید چرخه عمر یک پیام کاربر ورودی را ردیابی کنیم و ببینیم که چگونه SeaX از معماری اساسی Twilio در ترکیب با اجزای سفارشی برای مسیریابی پیام به یک نماینده زنده در پلتفرم SeaX استفاده می کند.

## کانال

<center>
<img src="/images/blog/19-seax-omnichannel-communication/2-example-message.jpg" alt="یک کاربر از طریق پیام های تجاری Google به یک کسب و کار پیام می دهد." style="width:50%"/>

*ارسال پیام به یک کسب و کار از طریق پیام های تجاری Google.*
</center>

سفر یک پیام با نوشتن و ارسال پیام توسط کاربر در یک پلتفرم پشتیبانی شده آغاز می شود. مثال بالا نشان می دهد که شخصی در حال ارسال پیام به ربات چت Seasalt.ai در پیام های تجاری Google است. به طور پیش فرض، Twilio از پیام های تجاری Google پشتیبانی نمی کند، بنابراین ما از یک اتصال دهنده کانال سفارشی که توسط Seasalt.ai برای اتصال پلتفرم Google به Twilio و SeaX توسعه یافته است، استفاده می کنیم.

هنگامی که پیام ارسال می شود، توسط اتصال دهنده سفارشی به API پیام رسانی Twilio منتقل می شود. در این مرحله، Twilio یک زمینه مکالمه جدید برای کاربر ایجاد می کند و برای مسیریابی پیام آماده می شود.

## مسیریابی پیام

<center>
<img src="/images/blog/19-seax-omnichannel-communication/3-studio-flow.png" alt="یک جریان استودیویی ساده که پیام ها را به یک ربات چت یا یک نماینده زنده هدایت می کند."/>

*یک جریان استودیویی ساده که پیام ها را به یک ربات چت یا یک نماینده زنده هدایت می کند.*
</center>

هنگامی که پیام توسط Twilio دریافت شد، باید به مکان مناسب هدایت شود. برای انجام این کار، ما از [Twilio Studio Flows](https://www.twilio.com/studio) برای تعیین اینکه آیا پاسخ خودکار بدهیم، پیام را به یک ربات چت ارسال کنیم، کاربر را با یک نماینده زنده وصل کنیم یا اقدام دیگری انجام دهیم، استفاده می کنیم.

در مثال ساده ارائه شده در بالا، تمام پیام های ورودی به یک ربات چت ارسال می شوند مگر اینکه حاوی عبارت "نماینده زنده" باشند، در این صورت کاربر به یک نماینده زنده در پلتفرم SeaX منتقل می شود.

## TaskRouter

<center>
<img src="/images/blog/19-seax-omnichannel-communication/4-taskrouter.png" alt="نمودار معماری TaskRouter."/>

*نمودار معماری TaskRouter. [منبع](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

پس از انتقال پیام به SeaX، مرحله بعدی تصمیم گیری در مورد اینکه کدام نماینده آن را دریافت خواهد کرد، است. [TaskRouter Twilio](https://www.twilio.com/taskrouter) وظایفی مانند پیام ها و تماس های تلفنی را به نماینده ای در SeaX که بهترین تجهیزات را برای رسیدگی به آنها دارد، اختصاص می دهد. به هر نماینده در SeaX می توان مهارت هایی مانند زبان هایی که صحبت می کنند، بخشی که در آن کار می کنند، اینکه آیا باید مشتریان VIP را اداره کنند و غیره اختصاص داد. TaskRouter اطلاعات شناخته شده در مورد کاربر و پیام را بررسی می کند و سپس مناسب ترین کارمند را برای رسیدگی به مشکل انتخاب می کند. جریان استودیو از مرحله قبل می تواند برای به دست آوردن اطلاعات اضافی (مانند زبان ترجیحی) سفارشی شود و اطلاعات مشتری می تواند در سراسر مکالمات و کانال ها برای اطمینان از یکپارچه بودن تجربه آنها حفظ شود.

## پلتفرم SeaX

<center>
<img src="/images/blog/19-seax-omnichannel-communication/5-seax-incoming-messages.png" alt="تماس ها و پیام های ورودی در پلتفرم SeaX ظاهر می شوند." style="width:50%"/>

*تماس ها و پیام های ورودی در پلتفرم SeaX ظاهر می شوند.*
</center>

در نهایت، پیام ورودی به نماینده مناسب در پلتفرم SeaX ارائه می شود. نمایندگان می توانند چندین کار را از چندین کانال به طور همزمان انجام دهند. در تصویر بالا، یک نماینده یک تماس ورودی، یک پیام فیس بوک و یک پیام چت وب دارد. نماینده می تواند کار را بپذیرد یا آن را رد کند تا آن را به نماینده بعدی در دسترس منتقل کند.

# کانال های پشتیبانی شده

امیدوارم اکنون واضح تر باشد که ارتباطات چند کاناله چیست و چگونه هم تجربه کاربر و هم نماینده را افزایش می دهد. آخرین سوال این است: کدام کانال ها خارج از جعبه پشتیبانی می شوند؟

<center>
<img src="/images/blog/19-seax-omnichannel-communication/6-channel-comparison.png" alt="مقایسه کانال های پشتیبانی شده بین یک مرکز تماس سنتی، Twilio Flex پایه و SeaX."/>

*مقایسه کانال های پشتیبانی شده بین یک مرکز تماس سنتی، Twilio Flex پایه و SeaX.*
</center>

همانطور که قبلا ذکر شد، مراکز تماس سنتی اغلب فقط از تماس های تلفنی پشتیبانی می کنند. شرکت ها ممکن است هنوز با مشتریان از طریق رسانه های اجتماعی یا ایمیل در تعامل باشند، اما این پیام ها در یک پلتفرم یکپارچه ادغام نشده اند.

از سوی دیگر، Twilio Flex پایه و اساس یک مرکز تماس چند کاناله عالی را ایجاد می کند. با این حال، کانال های بسیار کمی خارج از جعبه دارد. علاوه بر تماس های تلفنی و پیامک، آنها از فیس بوک، واتس اپ و ایمیل پشتیبانی بتا دارند.

SeaX بر روی Flex ساخته شده است و پشتیبانی داخلی را برای برخی از کانال های پرطرفدار اضافه می کند: مانند پیام های تجاری Google، Discord، Line و Instagram. علاوه بر این، Seasalt.ai همیشه با مشتریان برای آوردن کانال های جدید به خط تولید SeaX کار می کند. SeaX بسیار قابل تنظیم و به راحتی قابل توسعه است - به این معنی که ما می توانیم با شرکت شما برای ادغام هر کانالی که بیشتر می خواهید کار کنیم.

از اینکه وقت گذاشتید و خواندید که چگونه مرکز تماس ابری SeaX از ارتباطات چند کاناله برای ارائه یک تجربه یکپارچه برای مشتری و نماینده استفاده می کند، سپاسگزاریم. منتظر پست وبلاگ بعدی ما باشید که به بررسی این موضوع می پردازد که "مرکز تماس توزیع شده" بودن به چه معناست. اگر علاقه مند به کسب اطلاعات بیشتر در حال حاضر هستید، [فرم درخواست نسخه ی نمایشی](https.meetings.hubspot.com/seasalt-ai/seasalt-meeting) ما را پر کنید تا پلتفرم SeaX را از نزدیک تجربه کنید.`;export{n as default};
