const n=`---
title: "ขยายขอบเขตศูนย์ติดต่อของคุณด้วยศูนย์ติดต่อแบบกระจาย"
metatitle: "ขยายขอบเขตของคุณด้วยศูนย์ติดต่อแบบกระจาย"
date: 2022-07-27 21:46:45+00:00
draft: false
author: Sarah Reid
description: "ในบล็อกนี้ เราจะมาดูศูนย์ติดต่อแบบ 'กระจาย': คืออะไร มีประโยชน์ต่อคุณอย่างไร และ SeaX ใช้สิ่งนี้เพื่อให้บริการลูกค้าของเราได้ดียิ่งขึ้นได้อย่างไร"
weight: 1
tags:
  - SeaX
image: images/blog/20-seax-distributed-contact-center/0-main.png
canonicalURL: /blog/seax-distributed-contact-center/
url: /blog/seax-distributed-contact-center/
---

*ในบล็อกโพสต์ก่อนหน้าของเรา [นำลูกค้าจากทุกช่องทางมารวมไว้ในที่เดียวด้วยการสื่อสารแบบ Omnichannel ของ SeaX](https://seasalt.ai/blog/19-seax-omnichannel-communication/) เราได้แสดงให้เห็นถึงพลังของการสื่อสารแบบ Omnichannel บน SeaX ซึ่งช่วยให้ข้อความของผู้ใช้จากแทบทุกช่องทางสามารถแสดงบนแพลตฟอร์ม SeaX ได้ ในโพสต์นี้ เราจะมาดูศูนย์ติดต่อแบบ 'กระจาย': คืออะไร มีประโยชน์ต่อคุณอย่างไร และ SeaX ใช้แพลตฟอร์มแบบกระจายเพื่อให้บริการลูกค้าของเราได้ดียิ่งขึ้นได้อย่างไร*

# สารบัญ
- [ศูนย์ติดต่อแบบ "กระจาย" คืออะไร?](#ศูนย์ติดต่อแบบ-กระจาย-คืออะไร)
- [ศูนย์ติดต่อแบบ "กระจาย" มีประโยชน์อย่างไร?](#ศูนย์ติดต่อแบบ-กระจาย-มีประโยชน์อย่างไร)
- [ศูนย์ติดต่อแบบ "กระจาย" มีความท้าทายอย่างไร?](#ศูนย์ติดต่อแบบ-กระจาย-มีความท้าทายอย่างไร)
- [SeaX แก้ปัญหาเหล่านี้ได้อย่างไร?](#seax-แก้ปัญหาเหล่านี้ได้อย่างไร)
    - [การกำหนดเส้นทางสายไปยังสถานที่และตัวแทนแบบกระจาย](#การกำหนดเส้นทางสายไปยังสถานที่และตัวแทนแบบกระจาย)
    - [การกำหนดค่าความพร้อมใช้งานของสถานที่แบบกระจาย](#การกำหนดค่าความพร้อมใช้งานของสถานที่แบบกระจาย)
    - [การปรับแต่งข้อความสถานที่แบบกระจาย](#การปรับแต่งข้อความสถานที่แบบกระจาย)

# ศูนย์ติดต่อแบบ "กระจาย" คืออะไร?
ในระดับที่ง่ายที่สุด ศูนย์ติดต่อแบบกระจายคือศูนย์ติดต่อที่มีอยู่ในหลายสถานที่ ซึ่งแตกต่างจากศูนย์ติดต่อแบบดั้งเดิมที่มีสถานที่เดียว อาจเป็นศูนย์ติดต่อที่มีหลายสำนักงาน หรือหลายสถานที่ในประเทศต่างๆ หรือแม้แต่ศูนย์ติดต่อที่ไม่มีสถานที่จริง ซึ่งตัวแทนทุกคนทำงานจากระยะไกล อย่างไรก็ตาม ศูนย์ติดต่อแบบกระจายยังคงต้องทำงานเหมือนศูนย์ติดต่อแบบดั้งเดิมที่มีสถานที่เดียว โดยมอบประสบการณ์ที่ราบรื่นสำหรับทุกคนที่เกี่ยวข้อง สำหรับตัวแทน หมายถึงการได้รับการสนับสนุนบนแพลตฟอร์มเดียว ไม่ว่าจะอยู่ที่ใด สำหรับลูกค้า หมายถึงการเชื่อมต่อกับสถานที่และตัวแทนที่เหมาะสมอย่างถูกต้อง ขึ้นอยู่กับความต้องการของพวกเขา

# ศูนย์ติดต่อแบบ "กระจาย" มีประโยชน์อย่างไร?
ศูนย์ติดต่อแบบกระจายมีประโยชน์หลายประการเหนือศูนย์ติดต่อแบบดั้งเดิม โดยเฉพาะอย่างยิ่งในด้านความครอบคลุมและการขยายตัว การมีตัวแทนในเขตเวลาที่หลากหลายช่วยให้มั่นใจได้ว่าลูกค้าสามารถติดต่อคุณได้ทุกเมื่อที่ต้องการความช่วยเหลือ ด้วยศูนย์ติดต่อแบบดั้งเดิม ลูกค้าจะถูกจำกัดให้โทรเข้าในช่วงเวลาทำการเพียงชุดเดียว ทำให้ยากต่อการติดต่อธุรกิจของคุณ การมีตัวแทนแบบกระจายทำให้ธุรกิจของคุณมีโอกาสมากขึ้นในการจ้างบุคคลที่มีทักษะและความเชี่ยวชาญที่หลากหลาย เช่น ตัวแทนที่ครอบคลุมภาษาที่หลากหลาย ศูนย์ติดต่อแบบดั้งเดิมที่มีสถานที่เดียวถูกจำกัดให้จ้างตัวแทนในสถานที่นั้นๆ เสี่ยงที่จะไม่สามารถหาตัวแทนที่มีทักษะที่คุณต้องการได้ สุดท้าย การมีตัวแทนกระจายอยู่ใกล้ลูกค้ามากขึ้น ตัวแทนสามารถมีความเข้าใจที่ลึกซึ้งยิ่งขึ้นเกี่ยวกับกฎและข้อบังคับเฉพาะในพื้นที่นั้นๆ ในศูนย์ติดต่อแบบดั้งเดิมที่มีสถานที่เดียว ตัวแทนอาจไม่ทราบรายละเอียดเฉพาะเกี่ยวกับบางสิ่ง เช่น การขนส่งในประเทศที่อยู่อีกซีกโลกหนึ่ง ทำให้ยากต่อการช่วยเหลือลูกค้า


# ศูนย์ติดต่อแบบ "กระจาย" มีความท้าทายอย่างไร?
แม้ว่าลักษณะการกระจายของศูนย์ติดต่อเหล่านี้จะนำมาซึ่งประโยชน์มากมายต่อธุรกิจของคุณ แต่ก็มีความท้าทายบางประการสำหรับศูนย์ติดต่อแบบกระจาย การมีตัวแทนในเขตเวลาที่หลากหลายช่วยให้สื่อสารกับลูกค้าได้ง่ายตลอดเวลา แต่ก็หมายความว่าการกำหนดเส้นทางสายอย่างถูกต้องเป็นสิ่งสำคัญอย่างยิ่ง เพื่อไม่ให้ลูกค้าถูกกำหนดเส้นทางไปยังสถานที่ที่ปิดอยู่ หรือตัวแทนที่ไม่อยู่ในหน้าที่ นอกจากนี้ยังเป็นสิ่งสำคัญที่จะต้องส่งลูกค้าไปยังตัวแทนที่พูดภาษาที่ลูกค้าร้องขอ และผู้ที่ได้รับการฝึกอบรมที่ถูกต้องเพื่อแก้ไขปัญหาของพวกเขา ด้วยจำนวนตัวแทนจำนวนมากในสถานที่ต่างๆ ที่มีทักษะแตกต่างกัน งานการกำหนดเส้นทางนี้อาจกลายเป็นเรื่องซับซ้อนได้อย่างรวดเร็ว

<center>
<img src="/images/blog/20-seax-distributed-contact-center/1-feature-comparison.png" alt="การเปรียบเทียบคุณสมบัติ: ศูนย์บริการลูกค้าแบบดั้งเดิม vs ศูนย์ติดต่อแบบกระจาย vs SeaX."/>

*การเปรียบเทียบคุณสมบัติ: ศูนย์บริการลูกค้าแบบดั้งเดิม vs ศูนย์ติดต่อแบบกระจาย vs SeaX.*
</center>

# SeaX แก้ปัญหาเหล่านี้ได้อย่างไร?

## การกำหนดเส้นทางสายไปยังสถานที่และตัวแทนแบบกระจาย
SeaX เป็นโซลูชันศูนย์ติดต่อแบบร่วมมือที่สร้างขึ้นบนคลาวด์และกระจายตัว สร้างขึ้นบน [Twilio Flex](https://www.twilio.com/flex) ซึ่งใช้แพลตฟอร์มการสื่อสารบนคลาวด์ของ Twilio Twilio ให้บล็อกการสร้างพื้นฐานสำหรับ SeaX เช่น โครงสร้างพื้นฐานโทรคมนาคม การกำหนดเส้นทางข้อความและงาน และอินเทอร์เฟซผู้ใช้ศูนย์ติดต่อพื้นฐาน ภายใน SeaX คุณสามารถกำหนดค่าหมายเลขโทรศัพท์หลายหมายเลขสำหรับสถานที่ต่างๆ ของคุณ ทำให้คุณสามารถมีรหัสประเทศและรหัสพื้นที่ที่เหมาะสมสำหรับแต่ละพื้นที่ที่ศูนย์ติดต่อของคุณดำเนินการได้ ดังนั้น คุณสามารถกำหนดค่าการตั้งค่าของคุณตามสถานที่ ทำให้มั่นใจได้ว่าแต่ละสถานที่ทำงานได้อย่างถูกต้องและรับสายที่ถูกต้อง ในขณะที่ตัวแทนของคุณทั้งหมดได้รับการบริการบนแพลตฟอร์มเดียวกัน

[Twilio TaskRouter](https://www.twilio.com/taskrouter) กำหนดสายและข้อความให้กับตัวแทนตามคุณสมบัติของสายและตัวแทน

<center>
<img src="/images/blog/20-seax-distributed-contact-center/2-taskrouter.png" alt="แผนภาพสถาปัตยกรรม TaskRouter."/>

*แผนภาพสถาปัตยกรรม TaskRouter. [ที่มา](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

นอกจากนี้ยังช่วยให้คุณใช้การกำหนดเส้นทางตามทักษะ ทำให้คุณสามารถควบคุมได้อย่างละเอียดว่าตัวแทนและสถานที่ใดได้รับสายใด คุณไม่เพียงแต่สามารถติดป้ายกำกับว่าตัวแทนของคุณมีทักษะอะไร เช่น ระดับการฝึกอบรมการขาย แต่ยังสามารถระบุสิ่งต่างๆ เช่น ภาษาที่พวกเขาพูดได้ ทำให้มั่นใจได้ว่าพวกเขาจะได้รับเฉพาะสายที่พวกเขาสามารถจัดการได้ นอกจากนี้ คุณสามารถใช้การกำหนดเส้นทางนี้เพื่อกำหนดหมายเลขโทรศัพท์เฉพาะให้กับตัวแทน โดยเชื่อมโยงตัวแทนแต่ละคนกับสถานที่เฉพาะของศูนย์ติดต่อของคุณ แม้ว่าพวกเขาจะไม่ได้อยู่ที่นั่นจริงก็ตาม ตัวแทนจะได้รับเฉพาะสายที่กำหนดเส้นทางไปยังสถานที่ที่ได้รับมอบหมาย ทำให้มั่นใจได้ว่าสายของลูกค้าของคุณจะถูกกำหนดเส้นทางไปยังบุคคลที่ถูกต้องเสมอ

<center>
<img src="/images/blog/20-seax-distributed-contact-center/3-skills.png" alt="ทักษะที่กำหนดใน TaskRouter สำหรับการกำหนดเส้นทางสายเรียกเข้าและข้อความ."/>

*ทักษะที่กำหนดใน TaskRouter สำหรับการกำหนดเส้นทางสายเรียกเข้าและข้อความ.*
</center>

## การกำหนดค่าความพร้อมใช้งานของสถานที่แบบกระจาย
ใน SeaX คุณยังสามารถกำหนดค่าเวลาทำการและวันหยุดตามหมายเลขโทรศัพท์ได้อีกด้วย ด้วยเครื่องมือนี้ คุณสามารถควบคุมได้อย่างอิสระว่าแต่ละสถานที่ของคุณเปิดทำการเมื่อใด ทำให้คุณมีความยืดหยุ่นอย่างเต็มที่ในการติดต่อแต่ละสถานที่ของคุณ โดยพื้นฐานแล้ว แต่ละสถานที่ของคุณสามารถทำงานเหมือนศูนย์บริการลูกค้าแบบดั้งเดิม โดยมีเวลาทำการที่กำหนดและปิดทำการในวันหยุดท้องถิ่น ในขณะที่ยังคงได้รับการกำหนดค่าและเชื่อมต่อจากแพลตฟอร์มทั่วไปเพื่อให้ตัวแทนของคุณดำเนินการได้

<center>
<img src="/images/blog/20-seax-distributed-contact-center/4-open-hours.png" alt="เวลาทำการสำหรับหมายเลขโทรศัพท์สองหมายเลขที่แตกต่างกันในสองเขตเวลาที่แตกต่างกันบนอินสแตนซ์ SeaX เดียวกัน."/>
</center>

<center>
<img src="/images/blog/20-seax-distributed-contact-center/5-open-hours.png" alt="เวลาทำการสำหรับหมายเลขโทรศัพท์สองหมายเลขที่แตกต่างกันในสองเขตเวลาที่แตกต่างกันบนอินสแตนซ์ SeaX เดียวกัน."/>

*เวลาทำการสำหรับหมายเลขโทรศัพท์สองหมายเลขที่แตกต่างกันในสองเขตเวลาที่แตกต่างกันบนอินสแตนซ์ SeaX เดียวกัน.*
</center>

## การปรับแต่งข้อความสถานที่แบบกระจาย
SeaX ยังอนุญาตให้มีข้อความแจ้งลูกค้าว่าไม่ว่างตามหมายเลขโทรศัพท์ ข้อความแจ้งว่าไม่ว่างจะเล่นโดยอัตโนมัติให้กับลูกค้าเมื่อไม่มีใครรับสาย ด้วยความสามารถในการปรับแต่งข้อความนี้ตามหมายเลขโทรศัพท์ คุณสามารถมีข้อความในภาษาต่างๆ หรือมีข้อมูลที่แตกต่างกัน ขึ้นอยู่กับว่าสิ่งใดสำคัญที่สุดที่จะสื่อสารกับลูกค้าที่โทรเข้าสถานที่นั้นๆ

<center>
<img src="/images/blog/20-seax-distributed-contact-center/6-unavailable-message.png" alt="ข้อความแจ้งว่าไม่ว่างสำหรับหมายเลขโทรศัพท์เฉพาะบนแพลตฟอร์ม SeaX."/>

*ข้อความแจ้งว่าไม่ว่างสำหรับหมายเลขโทรศัพท์เฉพาะบนแพลตฟอร์ม SeaX.*
</center>

ศูนย์ติดต่อแบบดั้งเดิมที่มีสถานที่เดียวสามารถให้บริการพื้นที่โดยรอบได้อย่างมีประสิทธิภาพเท่านั้น แม้ว่าโดยธรรมชาติแล้วจะอยู่บนแพลตฟอร์มเดียวก็ตาม ศูนย์ติดต่อแบบกระจายช่วยขยายฐานลูกค้าที่สามารถให้บริการได้อย่างมากด้วยตัวแทนในหลายสถานที่ แต่ก็มีความท้าทายบางประการในการรวมบริการทั้งหมดที่ตัวแทนต้องการ ไม่ว่าจะอยู่ที่ใด ด้วย SeaX คุณสามารถเข้าถึงทุกส่วนของฐานลูกค้าของคุณ ในขณะที่ตัวแทนของคุณทั้งหมดได้รับการบริการบนแพลตฟอร์มเดียวที่ใช้งานง่าย

ขอขอบคุณที่สละเวลาอ่านเกี่ยวกับวิธีที่ศูนย์ติดต่อบนคลาวด์ของ SeaX สนับสนุนศูนย์ติดต่อแบบกระจายของคุณบนแพลตฟอร์มเดียว โปรดติดตามบล็อกโพสต์ถัดไปของเรา ซึ่งจะเจาะลึกโซลูชัน Text-to-Speech และ Speech-to-Text ภายในของเรา และวิธีที่พวกเขาสามารถปรับปรุงศูนย์ติดต่อของคุณได้ หากคุณสนใจที่จะเรียนรู้เพิ่มเติมทันที โปรดกรอกแบบฟอร์ม "[จองการสาธิต](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" ของเราเพื่อดูแพลตฟอร์ม SeaX ด้วยตัวคุณเอง`;export{n as default};
