const n=`---
title: "وسع نطاق مركز الاتصال الخاص بك باستخدام مركز اتصال موزع"
metatitle: "وسع نطاقك باستخدام مركز اتصال موزع"
date: 2022-07-27 21:46:45+00:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Sarah Reid
description: "في هذه المدونة، سنلقي نظرة على مراكز الاتصال 'الموزعة': ما هي، وكيف يمكن أن تفيدك، وكيف يستخدم SeaX هذا لخدمة عملائنا بشكل أفضل."
weight: 1
tags:
  - SeaX
image: images/blog/20-seax-distributed-contact-center/0-main.png
canonicalURL: /blog/seax-distributed-contact-center/
url: /blog/seax-distributed-contact-center/
---

*في منشور المدونة السابق، [اجلب العملاء من أي قناة إلى مكان واحد باستخدام SeaX Omnichannel Communication](https://seasalt.ai/blog/19-seax-omnichannel-communication/)، أظهرنا قوة الاتصال متعدد القنوات على منصة SeaX، والذي يسمح بظهور رسائل المستخدم من أي قناة تقريبًا على منصة SeaX. في هذا المنشور، سنلقي نظرة على مراكز الاتصال "الموزعة": ما هي، وكيف يمكن أن تفيدك، وكيف يستفيد SeaX من منصة موزعة لخدمة عملائنا بشكل أفضل.*

# جدول المحتويات
- [ما هو مركز الاتصال "الموزع"؟](#ما-هو-مركز-الاتصال-الموزع؟)
- [ما هي فوائد مركز الاتصال "الموزع"؟](#ما-هي-فوائد-مركز-الاتصال-الموزع؟)
- [ما هي التحديات التي يواجهها مركز الاتصال "الموزع"؟](#ما-هي-التحديات-التي-يواجهها-مركز-الاتصال-الموزع؟)
- [كيف يحل SeaX هذه المشكلات؟](#كيف-يحل-seax-هذه-المشكلات؟)
    - [توجيه المكالمات إلى المواقع والوكلاء الموزعين](#توجيه-المكالمات-إلى-المواقع-والوكلاء-الموزعين)
    - [تكوين توفر الموقع الموزع](#تكوين-توفر-الموقع-الموزع)
    - [تخصيص رسائل الموقع الموزع](#تخصيص-رسائل-الموقع-الموزع)

# ما هو مركز الاتصال "الموزع"؟
على أبسط مستوى، مركز الاتصال الموزع هو مركز اتصال موجود في أكثر من موقع واحد، على عكس مركز الاتصال التقليدي ذي الموقع الواحد. يمكن أن يكون هذا مركز اتصال يضم مكاتب متعددة، أو مواقع متعددة في بلدان مختلفة، أو حتى مركز اتصال بدون موقع مادي حيث يعمل جميع الوكلاء عن بعد. ومع ذلك، لا تزال مراكز الاتصال الموزعة بحاجة إلى العمل مثل مراكز الاتصال التقليدية ذات الموقع الواحد، مما يوفر تجربة سلسة لجميع المعنيين. بالنسبة للوكلاء، هذا يعني الحصول على الدعم على منصة واحدة بغض النظر عن مكان وجودهم. بالنسبة للعميل، هذا يعني الاتصال الصحيح بالموقع والوكيل المناسب بناءً على احتياجاتهم.

# ما هي فوائد مركز الاتصال "الموزع"؟
تتمتع مراكز الاتصال الموزعة بعدد من المزايا مقارنة بمراكز الاتصال التقليدية، خاصة فيما يتعلق بنطاقها وتغطيتها. يضمن وجود وكلاء في مناطق زمنية متعددة أن يتمكن العملاء من الوصول إليك متى احتاجوا إلى المساعدة. مع مراكز الاتصال التقليدية، يقتصر العملاء على الاتصال خلال مجموعة واحدة من ساعات العمل، مما يجعل من الصعب عليهم التواصل مع عملك. يمنح وجود وكلاء موزعون عملك أيضًا المزيد من الفرص لتوظيف أشخاص ذوي مهارات وتخصصات متنوعة، مثل وجود وكلاء يغطون نطاقًا أوسع من اللغات. تقتصر مراكز الاتصال التقليدية في موقع واحد على توظيف وكلاء في ذلك الموقع، مما يعرضها لخطر عدم القدرة على العثور على وكيل بالمهارات التي تحتاجها. أخيرًا، يتيح وجود وكلاء منتشرين بالقرب من المزيد من عملائك للوكلاء فهمًا أعمق لأي قواعد ولوائح متخصصة في تلك المنطقة. في مركز اتصال تقليدي ذي موقع واحد، قد لا يعرف الوكلاء تفاصيل محددة حول شيء مثل الشحن في بلد آخر من العالم، مما يجعل من الصعب مساعدة العملاء.


# ما هي التحديات التي يواجهها مركز الاتصال "الموزع"؟
بينما تتمتع الطبيعة الموزعة لمراكز الاتصال هذه بالعديد من الفوائد لعملك، إلا أن هناك بعض التحديات التي تواجه مراكز الاتصال الموزعة أيضًا. يتيح وجود وكلاء في مناطق زمنية متعددة سهولة التواصل مع العملاء في جميع الأوقات، ولكنه يعني أيضًا أنه من الضروري توجيه المكالمات بشكل صحيح حتى لا يتم توجيه العميل إلى موقع مغلق حاليًا أو وكيل خارج الخدمة. من المهم أيضًا إرسال العملاء إلى الوكلاء الذين يتحدثون اللغة المطلوبة للعميل ولديهم التدريب الصحيح للتعامل مع مشكلتهم. مع وجود مجموعة واسعة من الوكلاء في مواقع مختلفة بمهارات مختلفة، يمكن أن تصبح مهمة التوجيه هذه معقدة بسرعة.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/1-feature-comparison.png" alt="مقارنة الميزات: مركز الاتصال التقليدي مقابل مركز الاتصال الموزع مقابل SeaX."/>

*مقارنة الميزات: مركز الاتصال التقليدي مقابل مركز الاتصال الموزع مقابل SeaX.*
</center>

# كيف يحل SeaX هذه المشكلات؟

## توجيه المكالمات إلى المواقع والوكلاء الموزعين
SeaX هو حل مركز اتصال تعاوني ولد سحابيًا وموزعًا. إنه مبني على [Twilio Flex](https://www.twilio.com/flex) الذي يستخدم منصة اتصالات Twilio السحابية. يوفر Twilio اللبنات الأساسية لـ SeaX، مثل البنية التحتية للاتصالات السلكية واللاسلكية، وتوجيه الرسائل والمهام، وواجهة مستخدم أساسية لمركز الاتصال. ضمن SeaX، يمكنك تكوين أرقام هواتف متعددة لمواقعك المختلفة، مما يتيح لك الحصول على رموز البلد والمنطقة المناسبة لكل منطقة يعمل فيها مركز الاتصال الخاص بك. وبالتالي يمكنك تكوين إعداداتك حسب الموقع، مما يضمن أن كل موقع يعمل بشكل صحيح ويتلقى المكالمات الصحيحة، مع الاستمرار في خدمة جميع وكلائك على نفس المنصة.

يقوم [Twilio TaskRouter](https://www.twilio.com/taskrouter) بتعيين المكالمات والرسائل للوكلاء بناءً على سمات المكالمة والوكيل.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/2-taskrouter.png" alt="مخطط بنية TaskRouter."/>

*مخطط بنية TaskRouter. [المصدر](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

كما أنه يمكّنك من استخدام التوجيه القائم على المهارات، مما يمنحك تحكمًا دقيقًا في الوكلاء والمواقع التي تتلقى أي مكالمات. لا يمكنك فقط تسمية المهارات التي يمتلكها وكلاؤك، مثل مستوى تدريبهم على المبيعات، بل يمكنك أيضًا سرد أشياء مثل اللغات التي يتحدثونها، مما يضمن حصولهم فقط على المكالمات التي يمكنهم التعامل معها. بالإضافة إلى ذلك، يمكنك استخدام هذا التوجيه لتعيين أرقام هواتف محددة للوكلاء، وربط كل وكيل بموقع معين في مركز الاتصال الخاص بك، حتى لو لم يكونوا موجودين فعليًا هناك. سيتلقى الوكلاء فقط المكالمات الموجهة إلى موقعهم المعين، مما يضمن توجيه مكالمات عملائك دائمًا إلى الشخص الصحيح.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/3-skills.png" alt="المهارات المحددة في TaskRouter لتوجيه المكالمات والرسائل الواردة."/>

*المهارات المحددة في TaskRouter لتوجيه المكالمات والرسائل الواردة.*
</center>

## تكوين توفر الموقع الموزع
في SeaX، يمكنك أيضًا تكوين ساعات العمل والعطلات حسب رقم الهاتف. باستخدام هذه الأداة، يمكنك التحكم بشكل مستقل في وقت فتح كل موقع من مواقعك، مما يمنحك مرونة كاملة فيما يتعلق بوقت الاتصال بكل موقع من مواقعك. في الأساس، يمكن لكل موقع من مواقعك أن يعمل كمركز اتصال تقليدي، مع ساعات عمل محددة ومغلق في العطلات المحلية، مع الاستمرار في تكوينه وربطه من منصة واحدة مشتركة ليعمل عليها وكلاؤك.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/4-open-hours.png" alt="ساعات العمل لرقمي هاتف مختلفين في منطقتين زمنيتين مختلفتين على نفس مثيل SeaX."/>
</center>

<center>
<img src="/images/blog/20-seax-distributed-contact-center/5-open-hours.png" alt="ساعات العمل لرقمي هاتف مختلفين في منطقتين زمنيتين مختلفتين على نفس مثيل SeaX."/>

*ساعات العمل لرقمي هاتف مختلفين في منطقتين زمنيتين مختلفتين على نفس مثيل SeaX.*
</center>

## تخصيص رسائل الموقع الموزع
يتيح SeaX رسائل عدم توفر العملاء حسب رقم الهاتف أيضًا. يتم تشغيل رسائل عدم التوفر تلقائيًا للعملاء عندما لا يكون هناك أحد متاحًا لتلقي مكالماتهم. مع القدرة على تخصيص هذه الرسالة حسب رقم الهاتف، يمكنك الحصول على رسائل بلغات مختلفة أو تحتوي على معلومات مختلفة اعتمادًا على ما هو الأكثر أهمية لإيصاله إلى العملاء الذين يتصلون بهذا الموقع.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/6-unavailable-message.png" alt="رسالة عدم توفر لرقم هاتف معين على منصة SeaX."/>

*رسالة عدم توفر لرقم هاتف معين على منصة SeaX.*
</center>

يمكن لمركز الاتصال التقليدي ذي الموقع الواحد أن يخدم المنطقة المحيطة به بشكل فعال فقط، على الرغم من أنه بطبيعته على منصة واحدة. يوسع مركز الاتصال الموزع قاعدة العملاء التي يمكنه خدمتها بشكل كبير مع وكلاء في مواقع متعددة، ولكنه يواجه بعض التحديات في دمج جميع الخدمات التي يحتاجها وكلاؤه بغض النظر عن مكان وجودهم. مع SeaX، يمكنك الوصول إلى كل جزء من قاعدة عملائك، مع الاستمرار في خدمة جميع وكلائك على منصة واحدة سهلة.

شكرًا لك على تخصيص وقت لقراءة كيف يدعم مركز اتصال SeaX السحابي مركز الاتصال الموزع الخاص بك على منصة واحدة. يرجى متابعة منشور مدونتنا التالي، والذي سيتعمق في تقنيات تحويل النص إلى كلام والكلام إلى نص الداخلية لدينا، وكيف يمكنها تحسين مركز الاتصال الخاص بك. إذا كنت مهتمًا بمعرفة المزيد على الفور، فاملأ نموذج "[احجز عرضًا توضيحيًا](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" للحصول على نظرة أولى على منصة SeaX.
`;export{n as default};
