const n=`---
title: "விநியோகிக்கப்பட்ட தொடர்பு மையத்துடன் உங்கள் தொடர்பு மையத்தின் தடயத்தை விரிவாக்குங்கள்"
metatitle: "விநியோகிக்கப்பட்ட தொடர்பு மையத்துடன் உங்கள் தடயத்தை விரிவாக்குங்கள்"
date: 2022-07-27 21:46:45+00:00
draft: false
author: Sarah Reid
description: "இந்த வலைப்பதிவில், நாங்கள் 'விநியோகிக்கப்பட்ட' தொடர்பு மையங்களைப் பார்ப்போம்: அவை என்ன, அவை உங்களுக்கு எவ்வாறு பயனளிக்கும், மேலும் எங்கள் வாடிக்கையாளர்களுக்கு சிறந்த சேவை வழங்க SeaX இதை எவ்வாறு பயன்படுத்துகிறது."
weight: 1
tags:
  - SeaX
image: images/blog/20-seax-distributed-contact-center/0-main.png
canonicalURL: /blog/seax-distributed-contact-center/
url: /blog/seax-distributed-contact-center/
---

*எங்கள் முந்தைய வலைப்பதிவு இடுகையில், [SeaX ஆம்னிசேனல் தகவல்தொடர்புடன் எந்த சேனலிலிருந்தும் வாடிக்கையாளர்களை ஒரே இடத்திற்குக் கொண்டு வாருங்கள்](https://seasalt.ai/blog/19-seax-omnichannel-communication/), SeaX இல் ஆம்னிசேனல் தகவல்தொடர்பின் சக்தியை நாங்கள் காட்டினோம், இது கிட்டத்தட்ட எந்த சேனலிலிருந்தும் பயனர் செய்திகளை SeaX தளத்தில் காண்பிக்க அனுமதிக்கிறது. இந்த இடுகையில், நாங்கள் 'விநியோகிக்கப்பட்ட' தொடர்பு மையங்களைப் பார்ப்போம்: அவை என்ன, அவை உங்களுக்கு எவ்வாறு பயனளிக்கும், மேலும் எங்கள் வாடிக்கையாளர்களுக்கு சிறந்த சேவை வழங்க SeaX ஒரு விநியோகிக்கப்பட்ட தளத்தை எவ்வாறு பயன்படுத்துகிறது.*

# பொருளடக்கம்
- [ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையம் என்றால் என்ன?](#ஒரு-விநியோகிக்கப்பட்ட-தொடர்பு-மையம்-என்றால்-என்ன)
- [ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையத்தின் நன்மைகள் என்ன?](#ஒரு-விநியோகிக்கப்பட்ட-தொடர்பு-மையத்தின்-நன்மைகள்-என்ன)
- [ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையத்தின் சவால்கள் என்ன?](#ஒரு-விநியோகிக்கப்பட்ட-தொடர்பு-மையத்தின்-சவால்கள்-என்ன)
- [SeaX இந்த சிக்கல்களை எவ்வாறு தீர்க்கிறது?](#seax-இந்த-சிக்கல்களை-எவ்வாறு-தீர்க்கிறது)
    - [விநியோகிக்கப்பட்ட இருப்பிடங்கள் மற்றும் முகவர்களுக்கு அழைப்புகளை வழிநடத்துதல்](#விநியோகிக்கப்பட்ட-இருப்பிடங்கள்-மற்றும்-முகவர்களுக்கு-அழைப்புகளை-வழிநடத்துதல்)
    - [விநியோகிக்கப்பட்ட இருப்பிட கிடைக்கும் தன்மையை உள்ளமைத்தல்](#விநியோகிக்கப்பட்ட-இருப்பிட-கிடைக்கும்-தன்மையை-உள்ளமைத்தல்)
    - [விநியோகிக்கப்பட்ட இருப்பிட செய்திகளைத் தனிப்பயனாக்குதல்](#விநியோகிக்கப்பட்ட-இருப்பிட-செய்திகளைத்-தனிப்பயனாக்குதல்)

# ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையம் என்றால் என்ன?
மிகவும் எளிமையான மட்டத்தில், ஒரு விநியோகிக்கப்பட்ட தொடர்பு மையம் என்பது பல இடங்களில் இருக்கும் ஒரு தொடர்பு மையமாகும், இது ஒரு பாரம்பரிய ஒற்றை இருப்பிட தொடர்பு மையத்திற்கு மாறாக. இது பல அலுவலகங்களைக் கொண்ட ஒரு தொடர்பு மையமாக இருக்கலாம், அல்லது வெவ்வேறு நாடுகளில் பல இருப்பிடங்களைக் கொண்டதாக இருக்கலாம், அல்லது அனைத்து முகவர்களும் தொலைதூரத்தில் பணிபுரியும் ஒரு உடல் இருப்பிடம் இல்லாத தொடர்பு மையமாக இருக்கலாம். இருப்பினும், விநியோகிக்கப்பட்ட தொடர்பு மையங்கள் இன்னும் பாரம்பரிய ஒற்றை இருப்பிட தொடர்பு மையங்களைப் போலவே செயல்பட வேண்டும், இதில் சம்பந்தப்பட்ட அனைவருக்கும் தடையற்ற அனுபவத்தை வழங்க வேண்டும். முகவர்களுக்கு, இது அவர்களின் இருப்பிடத்தைப் பொருட்படுத்தாமல், ஒரு தளத்தில் ஆதரிக்கப்படுவதைக் குறிக்கிறது. வாடிக்கையாளருக்கு, இது அவர்களின் தேவைகளைப் பொறுத்து, சரியான இருப்பிடம் மற்றும் முகவருடன் சரியாக இணைக்கப்படுவதைக் குறிக்கிறது.

# ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையத்தின் நன்மைகள் என்ன?
விநியோகிக்கப்பட்ட தொடர்பு மையங்கள் பாரம்பரிய தொடர்பு மையங்களை விட பல நன்மைகளைக் கொண்டுள்ளன, குறிப்பாக கவரேஜ் மற்றும் விரிவாக்கம் தொடர்பாக. பல நேர மண்டலங்களில் முகவர்களைக் கொண்டிருப்பது, வாடிக்கையாளர்களுக்கு எப்போது உதவி தேவைப்பட்டாலும் உங்களைத் தொடர்பு கொள்ள முடியும் என்பதை உறுதி செய்கிறது. பாரம்பரிய தொடர்பு மையங்களுடன், வாடிக்கையாளர்கள் ஒரு குறிப்பிட்ட வேலை நேரத்திற்குள் மட்டுமே அழைக்க முடியும், இது உங்கள் வணிகத்துடன் தொடர்பு கொள்வதை அவர்களுக்கு கடினமாக்குகிறது. விநியோகிக்கப்பட்ட முகவர்களைக் கொண்டிருப்பது உங்கள் வணிகத்திற்கு பல்வேறு திறன்கள் மற்றும் சிறப்புத் திறன்களைக் கொண்டவர்களை பணியமர்த்துவதற்கான அதிக வாய்ப்புகளை வழங்குகிறது, அதாவது பரந்த அளவிலான மொழிகளை உள்ளடக்கிய முகவர்கள். பாரம்பரிய ஒற்றை இருப்பிட தொடர்பு மையங்கள் அந்த இருப்பிடத்தில் முகவர்களை பணியமர்த்துவதற்கு மட்டுமே கட்டுப்படுத்தப்படுகின்றன, உங்களுக்குத் தேவையான திறன்களைக் கொண்ட ஒரு முகவரைக் கண்டுபிடிக்க முடியாமல் போகும் அபாயம் உள்ளது. இறுதியாக, பல வாடிக்கையாளர்களுக்கு நெருக்கமாக முகவர்களைப் பரப்பி வைப்பதன் மூலம், முகவர்கள் அந்தப் பகுதியில் உள்ள எந்தவொரு சிறப்பு விதிகள் மற்றும் ஒழுங்குமுறைகள் பற்றிய ஆழமான புரிதலைக் கொண்டிருக்க முடியும். ஒரு பாரம்பரிய ஒற்றை இருப்பிட தொடர்பு மையத்தில், முகவர்களுக்கு உலகின் மறுபக்கத்தில் உள்ள ஒரு நாட்டில் கப்பல் போக்குவரத்து போன்ற ஒரு குறிப்பிட்ட விவரம் பற்றி தெரியாமல் போகலாம், இது வாடிக்கையாளர்களுக்கு உதவுவதை கடினமாக்குகிறது.


# ஒரு "விநியோகிக்கப்பட்ட" தொடர்பு மையத்தின் சவால்கள் என்ன?
இந்த தொடர்பு மையங்களின் விநியோகிக்கப்பட்ட தன்மை உங்கள் வணிகத்திற்கு பல நன்மைகளை அளித்தாலும், விநியோகிக்கப்பட்ட தொடர்பு மையங்களுக்கு சில சவால்களும் உள்ளன. பல நேர மண்டலங்களில் முகவர்களைக் கொண்டிருப்பது எந்த நேரத்திலும் வாடிக்கையாளர்களுடன் எளிதாக தொடர்பு கொள்ள அனுமதிக்கிறது, ஆனால் அழைப்புகள் சரியாக வழிநடத்தப்படுவது மிகவும் முக்கியம், இதனால் ஒரு வாடிக்கையாளர் தற்போது மூடப்பட்டிருக்கும் ஒரு இருப்பிடத்திற்கு அல்லது பணிக்கு வெளியே இருக்கும் ஒரு முகவருக்கு வழிநடத்தப்பட மாட்டார். வாடிக்கையாளர் கோரும் மொழியைப் பேசும் மற்றும் அவர்களின் சிக்கலைத் தீர்க்க சரியான பயிற்சி பெற்ற முகவர்களுக்கு வாடிக்கையாளர்களை அனுப்புவதும் முக்கியம். வெவ்வேறு திறன்களைக் கொண்ட வெவ்வேறு இடங்களில் அதிக எண்ணிக்கையிலான முகவர்களுடன், இந்த வழிநடத்தும் பணி விரைவாக சிக்கலாகிவிடும்.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/1-feature-comparison.png" alt="அம்ச ஒப்பீடு: பாரம்பரிய அழைப்பு மையம் vs விநியோகிக்கப்பட்ட தொடர்பு மையம் vs SeaX."/>

*அம்ச ஒப்பீடு: பாரம்பரிய அழைப்பு மையம் vs விநியோகிக்கப்பட்ட தொடர்பு மையம் vs SeaX.*
</center>

# SeaX இந்த சிக்கல்களை எவ்வாறு தீர்க்கிறது?

## விநியோகிக்கப்பட்ட இருப்பிடங்கள் மற்றும் முகவர்களுக்கு அழைப்புகளை வழிநடத்துதல்
SeaX ஒரு கூட்டு தொடர்பு மைய தீர்வாகும், இது கிளவுட்-நேட்டிவ் மற்றும் விநியோகிக்கப்பட்டது. இது [Twilio Flex](https://www.twilio.com/flex) இல் கட்டமைக்கப்பட்டுள்ளது, இது Twilio கிளவுட் தகவல்தொடர்பு தளத்தைப் பயன்படுத்துகிறது. Twilio ஆனது SeaX க்கான அடிப்படை கட்டுமானத் தொகுதிகளை வழங்குகிறது, அதாவது தொலைத்தொடர்பு உள்கட்டமைப்பு, செய்தி மற்றும் பணி வழிநடத்துதல் மற்றும் ஒரு அடிப்படை தொடர்பு மைய பயனர் இடைமுகம். SeaX இல், உங்கள் வெவ்வேறு இருப்பிடங்களுக்கு பல தொலைபேசி எண்களை உள்ளமைக்கலாம், இது உங்கள் தொடர்பு மையம் செயல்படும் ஒவ்வொரு பகுதிக்கும் பொருத்தமான நாடு மற்றும் பகுதி குறியீடுகளைக் கொண்டிருக்க உங்களை அனுமதிக்கிறது. எனவே, நீங்கள் இருப்பிடத்தின் அடிப்படையில் உங்கள் அமைப்புகளை உள்ளமைக்கலாம், ஒவ்வொரு இருப்பிடமும் சரியாக செயல்படுவதையும் சரியான அழைப்புகளைப் பெறுவதையும் உறுதிசெய்து, உங்கள் முகவர்கள் அனைவரும் ஒரே தளத்தில் சேவை செய்யப்படுகிறார்கள்.

[Twilio TaskRouter](https://www.twilio.com/taskrouter) அழைப்பு மற்றும் முகவர் பண்புகளின் அடிப்படையில் முகவர்களுக்கு அழைப்புகள் மற்றும் செய்திகளை ஒதுக்குகிறது.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/2-taskrouter.png" alt="TaskRouter கட்டிடக்கலை வரைபடம்."/>

*TaskRouter கட்டிடக்கலை வரைபடம். [ஆதாரம்](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

இது திறன் அடிப்படையிலான வழிநடத்துதலையும் பயன்படுத்த உங்களை அனுமதிக்கிறது, எந்த முகவர்கள் மற்றும் இருப்பிடங்கள் எந்த அழைப்புகளைப் பெறுகின்றன என்பதில் உங்களுக்கு சிறந்த கட்டுப்பாட்டை வழங்குகிறது. உங்கள் முகவர்களுக்கு என்ன திறன்கள் உள்ளன என்பதை நீங்கள் குறிக்கலாம், அதாவது விற்பனை பயிற்சி நிலை, ஆனால் அவர்கள் பேசும் மொழிகள் போன்ற விஷயங்களையும் பட்டியலிடலாம், அவர்கள் கையாளக்கூடிய அழைப்புகளை மட்டுமே அவர்கள் பெறுவதை உறுதிசெய்கிறது. கூடுதலாக, இந்த வழிநடத்துதலைப் பயன்படுத்தி முகவர்களுக்கு குறிப்பிட்ட தொலைபேசி எண்களை ஒதுக்கலாம், ஒவ்வொரு முகவரையும் உங்கள் தொடர்பு மையத்தின் ஒரு குறிப்பிட்ட இருப்பிடத்துடன் இணைக்கலாம், அவர்கள் உடல் ரீதியாக அங்கு இல்லாவிட்டாலும் கூட. முகவர்கள் தங்கள் ஒதுக்கப்பட்ட இருப்பிடத்திற்கு வழிநடத்தப்படும் அழைப்புகளை மட்டுமே பெறுவார்கள், உங்கள் வாடிக்கையாளர்களின் அழைப்புகள் எப்போதும் சரியான நபருக்கு வழிநடத்தப்படுவதை உறுதிசெய்கிறது.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/3-skills.png" alt="உள்வரும் அழைப்புகள் மற்றும் செய்திகளை வழிநடத்துவதற்கான TaskRouter இல் வரையறுக்கப்பட்ட திறன்கள்."/>

*உள்வரும் அழைப்புகள் மற்றும் செய்திகளை வழிநடத்துவதற்கான TaskRouter இல் வரையறுக்கப்பட்ட திறன்கள்.*
</center>

## விநியோகிக்கப்பட்ட இருப்பிட கிடைக்கும் தன்மையை உள்ளமைத்தல்
SeaX இல், நீங்கள் தொலைபேசி எண்ணின் அடிப்படையில் திறக்கும் நேரம் மற்றும் விடுமுறை நாட்களையும் உள்ளமைக்கலாம். இந்த கருவி மூலம், உங்கள் ஒவ்வொரு இருப்பிடமும் எப்போது திறந்திருக்கும் என்பதை நீங்கள் சுயாதீனமாக கட்டுப்படுத்தலாம், உங்கள் ஒவ்வொரு இருப்பிடத்தையும் எப்போது தொடர்பு கொள்ளலாம் என்பதில் உங்களுக்கு முழுமையான நெகிழ்வுத்தன்மையை வழங்குகிறது. அடிப்படையில், உங்கள் ஒவ்வொரு இருப்பிடமும் ஒரு பாரம்பரிய அழைப்பு மையமாக செயல்பட முடியும், இது ஒரு குறிப்பிட்ட வேலை நேரத்துடன் மற்றும் உள்ளூர் விடுமுறை நாட்களில் மூடப்படும், அதே நேரத்தில் உங்கள் முகவர்கள் செயல்பட ஒரு பொதுவான தளத்திலிருந்து உள்ளமைக்கப்பட்டு இணைக்கப்படும்.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/4-open-hours.png" alt="ஒரே SeaX இன்ஸ்டன்ஸில் இரண்டு வெவ்வேறு நேர மண்டலங்களில் இரண்டு வெவ்வேறு தொலைபேசி எண்களுக்கான வேலை நேரம்."/>
</center>

<center>
<img src="/images/blog/20-seax-distributed-contact-center/5-open-hours.png" alt="ஒரே SeaX இன்ஸ்டன்ஸில் இரண்டு வெவ்வேறு நேர மண்டலங்களில் இரண்டு வெவ்வேறு தொலைபேசி எண்களுக்கான வேலை நேரம்."/>

*ஒரே SeaX இன்ஸ்டன்ஸில் இரண்டு வெவ்வேறு நேர மண்டலங்களில் இரண்டு வெவ்வேறு தொலைபேசி எண்களுக்கான வேலை நேரம்.*
</center>

## விநியோகிக்கப்பட்ட இருப்பிட செய்திகளைத் தனிப்பயனாக்குதல்
SeaX தொலைபேசி எண்ணின் அடிப்படையில் வாடிக்கையாளர் கிடைக்காத செய்திகளையும் அனுமதிக்கிறது. அழைப்பை எடுக்க யாரும் இல்லாதபோது கிடைக்காத செய்திகள் வாடிக்கையாளர்களுக்கு தானாகவே இயக்கப்படும். தொலைபேசி எண்ணின் அடிப்படையில் இந்த செய்தியைத் தனிப்பயனாக்கும் திறனுடன், நீங்கள் வெவ்வேறு மொழிகளில் அல்லது வெவ்வேறு தகவல்களைக் கொண்ட செய்திகளைக் கொண்டிருக்கலாம், அந்த இருப்பிடத்திற்கு அழைக்கும் வாடிக்கையாளர்களுக்கு என்ன தெரிவிக்கப்பட வேண்டும் என்பது மிகவும் முக்கியம் என்பதைப் பொறுத்து.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/6-unavailable-message.png" alt="SeaX தளத்தில் ஒரு குறிப்பிட்ட தொலைபேசி எண்ணுக்கான கிடைக்காத செய்தி."/>

*SeaX தளத்தில் ஒரு குறிப்பிட்ட தொலைபேசி எண்ணுக்கான கிடைக்காத செய்தி.*
</center>

ஒரு பாரம்பரிய ஒற்றை இருப்பிட தொடர்பு மையம் அதன் நேரடி சுற்றியுள்ள பகுதியை மட்டுமே திறம்பட சேவை செய்ய முடியும், இருப்பினும் அது அதன் இயல்பிலேயே ஒரு தளத்தில் உள்ளது. ஒரு விநியோகிக்கப்பட்ட தொடர்பு மையம் பல இடங்களில் முகவர்களுடன் சேவை செய்யக்கூடிய வாடிக்கையாளர் தளத்தை கணிசமாக விரிவுபடுத்துகிறது, ஆனால் அதன் முகவர்களுக்கு அவர்களின் இருப்பிடத்தைப் பொருட்படுத்தாமல் தேவைப்படும் அனைத்து சேவைகளையும் ஒருங்கிணைப்பதில் சில சவால்கள் உள்ளன. SeaX உடன், உங்கள் வாடிக்கையாளர் தளத்தின் ஒவ்வொரு பகுதியையும் நீங்கள் அடையலாம், அதே நேரத்தில் உங்கள் முகவர்கள் அனைவரும் பயன்படுத்த எளிதான ஒரு தளத்தில் சேவை செய்யப்படுகிறார்கள்.

SeaX கிளவுட் தொடர்பு மையம் உங்கள் விநியோகிக்கப்பட்ட தொடர்பு மையத்தை ஒரு தளத்தில் எவ்வாறு ஆதரிக்கிறது என்பதைப் பற்றி படிக்க நேரம் ஒதுக்கியதற்கு நன்றி. எங்கள் அடுத்த வலைப்பதிவு இடுகைக்காக காத்திருங்கள், இது எங்கள் உள் உரை-க்கு-பேச்சு மற்றும் பேச்சு-க்கு-உரை தீர்வுகளையும் அவை உங்கள் தொடர்பு மையத்தை எவ்வாறு மேம்படுத்தலாம் என்பதையும் ஆழமாக ஆராயும். நீங்கள் உடனடியாக மேலும் அறிய ஆர்வமாக இருந்தால், SeaX தளத்தை நேரடியாகப் பார்க்க எங்கள் "[ஒரு டெமோவை முன்பதிவு செய்யுங்கள்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" படிவத்தை நிரப்பவும்.`;export{n as default};
