const n=`---
title: "گسترش ردپای مرکز تماس خود با یک مرکز تماس توزیع شده"
metatitle: "گسترش ردپای خود با یک مرکز تماس توزیع شده"
date: 2022-07-27 21:46:45+00:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Sarah Reid
description: "در این وبلاگ، به مراکز تماس 'توزیع شده' خواهیم پرداخت: آنها چه هستند، چگونه می توانند به شما سود برسانند، و چگونه SeaX از این برای ارائه خدمات بهتر به مشتریان خود استفاده می کند."
weight: 1
tags:
  - SeaX
image: images/blog/20-seax-distributed-contact-center/0-main.png
canonicalURL: /blog/seax-distributed-contact-center/
url: /blog/seax-distributed-contact-center/
---

*در پست وبلاگ قبلی ما، [مشتریان را از هر کانالی به یک مکان با ارتباطات همه‌کاناله SeaX بیاورید](https://seasalt.ai/blog/19-seax-omnichannel-communication/)، ما قدرت ارتباطات همه‌کاناله در پلتفرم SeaX را نشان دادیم که به پیام‌های کاربر از تقریباً هر کانالی اجازه می‌دهد تا در پلتفرم SeaX نمایش داده شوند. در این پست، به مراکز تماس "توزیع شده" خواهیم پرداخت: آنها چه هستند، چگونه می‌توانند به شما سود برسانند، و چگونه SeaX از یک پلتفرم توزیع شده برای ارائه خدمات بهتر به مشتریان خود استفاده می‌کند.*

# فهرست مطالب
- [مرکز تماس "توزیع شده" چیست؟](#مرکز-تماس-توزیع-شده-چیست؟)
- [مرکز تماس "توزیع شده" چه مزایایی دارد؟](#مرکز-تماس-توزیع-شده-چه-مزایایی-دارد؟)
- [مرکز تماس "توزیع شده" چه چالش‌هایی دارد؟](#مرکز-تماس-توزیع-شده-چه-چالش‌هایی-دارد؟)
- [SeaX چگونه این مشکلات را حل می‌کند؟](#seax-چگونه-این-مشکلات-را-حل-می‌کند؟)
    - [هدایت تماس‌ها به مکان‌ها و عوامل توزیع شده](#هدایت-تماس‌ها-به-مکان‌ها-و-عوامل-توزیع-شده)
    - [پیکربندی در دسترس بودن مکان توزیع شده](#پیکربندی-در-دسترس-بودن-مکان-توزیع-شده)
    - [سفارشی‌سازی پیام‌رسانی مکان توزیع شده](#سفارشی‌سازی-پیام‌رسانی-مکان-توزیع-شده)

# مرکز تماس "توزیع شده" چیست؟
در ساده‌ترین سطح، مرکز تماس توزیع شده، مرکز تماسی است که در بیش از یک مکان وجود دارد، برخلاف مرکز تماس سنتی تک‌مکان. این می‌تواند یک مرکز تماس با چندین دفتر، یا چندین مکان در کشورهای مختلف، یا حتی یک مرکز تماس بدون مکان فیزیکی باشد که در آن همه عوامل از راه دور کار می‌کنند. با این حال، مراکز تماس توزیع شده همچنان باید مانند مراکز تماس سنتی تک‌مکان عمل کنند و تجربه‌ای بی‌نقص را برای همه افراد درگیر فراهم کنند. برای عوامل، این به معنای پشتیبانی شدن در یک پلتفرم واحد است، صرف نظر از اینکه در کجا قرار دارند. برای مشتری، این به معنای اتصال صحیح به مکان و عامل مناسب بر اساس نیازهای آنها است.

# مرکز تماس "توزیع شده" چه مزایایی دارد؟
مراکز تماس توزیع شده دارای مزایای متعددی نسبت به مراکز تماس سنتی هستند، به ویژه از نظر دسترسی و پوشش. داشتن عوامل در چندین منطقه زمانی تضمین می کند که مشتریان هر زمان که به کمک نیاز داشته باشند، می توانند با شما تماس بگیرند. در مراکز تماس سنتی، مشتریان محدود به تماس در یک مجموعه ساعات کاری هستند، که باعث می شود تماس با کسب و کار شما دشوارتر شود. داشتن عوامل توزیع شده همچنین به کسب و کار شما فرصت بیشتری برای استخدام افراد با مهارت ها و تخصص های متنوع می دهد، مانند داشتن عواملی که طیف وسیع تری از زبان ها را پوشش می دهند. مراکز تماس سنتی در یک مکان محدود به استخدام عوامل در آن مکان هستند، که خطر عدم توانایی در یافتن عامل با مهارت های مورد نیاز شما را به همراه دارد. در نهایت، داشتن عوامل گسترده تر نزدیک به مشتریان بیشتر به عوامل امکان می دهد تا درک عمیق تری از هرگونه قوانین و مقررات تخصصی در آن منطقه داشته باشند. در یک مرکز تماس سنتی تک مکانی، عوامل ممکن است جزئیات خاصی در مورد چیزی مانند حمل و نقل در کشوری در آن سوی جهان را ندانند، که کمک به مشتریان را دشوارتر می کند.


# مرکز تماس "توزیع شده" چه چالش‌هایی دارد؟
در حالی که ماهیت توزیع شده این مراکز تماس مزایای زیادی برای کسب و کار شما دارد، اما چالش‌هایی نیز برای مراکز تماس توزیع شده وجود دارد. داشتن عوامل در چندین منطقه زمانی امکان برقراری ارتباط آسان با مشتریان را در هر زمان فراهم می‌کند، اما همچنین به این معنی است که هدایت صحیح تماس‌ها ضروری است تا مشتری به مکانی که در حال حاضر بسته است یا عاملی که خارج از وظیفه است، هدایت نشود. همچنین مهم است که مشتریان را به عواملی بفرستید که به زبان درخواستی مشتری صحبت می‌کنند و آموزش صحیح برای رسیدگی به مشکل آنها را دارند. با وجود تعداد زیادی از عوامل در مکان‌های مختلف با مهارت‌های متفاوت، این وظیفه هدایت می‌تواند به سرعت پیچیده شود.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/1-feature-comparison.png" alt="مقایسه ویژگی‌ها: مرکز تماس سنتی در مقابل مرکز تماس توزیع شده در مقابل SeaX."/>

*مقایسه ویژگی‌ها: مرکز تماس سنتی در مقابل مرکز تماس توزیع شده در مقابل SeaX.*
</center>

# SeaX چگونه این مشکلات را حل می‌کند؟

## هدایت تماس‌ها به مکان‌ها و عوامل توزیع شده
SeaX یک راه حل مرکز تماس مشارکتی است که به صورت ابری و توزیع شده متولد شده است. این بر روی [Twilio Flex](https://www.twilio.com/flex) ساخته شده است که از پلتفرم ارتباطات ابری Twilio استفاده می کند. Twilio بلوک های ساختمانی اساسی برای SeaX را فراهم می کند، مانند زیرساخت های مخابراتی، مسیریابی پیام و وظیفه، و یک رابط کاربری اساسی مرکز تماس. در SeaX، می توانید چندین شماره تلفن را برای مکان های مختلف خود پیکربندی کنید، که به شما امکان می دهد کدهای کشور و منطقه مناسب را برای هر منطقه ای که مرکز تماس شما در آن فعالیت می کند، داشته باشید. بنابراین می توانید تنظیمات خود را بر اساس مکان پیکربندی کنید، اطمینان حاصل کنید که هر مکان به درستی کار می کند و تماس های صحیح را دریافت می کند، در حالی که همچنان به همه عوامل خود در یک پلتفرم واحد خدمات می دهد.

[Twilio TaskRouter](https://www.twilio.com/taskrouter) تماس‌ها و پیام‌ها را بر اساس ویژگی‌های تماس و عامل به عوامل اختصاص می‌دهد.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/2-taskrouter.png" alt="نمودار معماری TaskRouter."/>

*نمودار معماری TaskRouter. [منبع](https://twilio-cms-prod.s3.amazonaws.com/images/taskrouter-diagram.width-800.png).*
</center>

همچنین به شما امکان می‌دهد از مسیریابی مبتنی بر مهارت استفاده کنید، که به شما کنترل دقیق بر اینکه کدام عوامل و مکان‌ها کدام تماس‌ها را دریافت می‌کنند، می‌دهد. نه تنها می‌توانید مهارت‌های عوامل خود را برچسب‌گذاری کنید، مانند سطح آموزش فروش آنها، بلکه می‌توانید مواردی مانند زبان‌هایی که صحبت می‌کنند را نیز فهرست کنید، و اطمینان حاصل کنید که آنها فقط تماس‌هایی را دریافت می‌کنند که می‌توانند مدیریت کنند. علاوه بر این، می‌توانید از این مسیریابی برای اختصاص شماره تلفن‌های خاص به عوامل استفاده کنید، و هر عامل را به یک مکان خاص در مرکز تماس خود مرتبط کنید، حتی اگر آنها به صورت فیزیکی در آنجا نباشند. عوامل فقط تماس‌هایی را دریافت می‌کنند که به مکان اختصاص داده شده آنها هدایت می‌شوند، و اطمینان حاصل می‌شود که تماس‌های مشتریان شما همیشه به شخص صحیح هدایت می‌شوند.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/3-skills.png" alt="مهارت‌های تعریف شده در TaskRouter برای هدایت تماس‌ها و پیام‌های ورودی."/>

*مهارت‌های تعریف شده در TaskRouter برای هدایت تماس‌ها و پیام‌های ورودی.*
</center>

## پیکربندی در دسترس بودن مکان توزیع شده
در SeaX، می‌توانید ساعات کاری و تعطیلات خود را بر اساس شماره تلفن نیز پیکربندی کنید. با این ابزار، می‌توانید به طور مستقل زمان باز بودن هر یک از مکان‌های خود را کنترل کنید، که به شما انعطاف‌پذیری کامل در مورد زمان تماس با هر یک از مکان‌های خود را می‌دهد. در اصل، هر یک از مکان‌های شما می‌تواند مانند یک مرکز تماس سنتی عمل کند، با ساعات کاری مشخص و تعطیل در تعطیلات محلی، در حالی که همچنان از یک پلتفرم مشترک برای فعالیت عوامل شما پیکربندی و متصل است.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/4-open-hours.png" alt="ساعات کاری برای دو شماره تلفن مختلف در دو منطقه زمانی مختلف در همان نمونه SeaX."/>
</center>

<center>
<img src="/images/blog/20-seax-distributed-contact-center/5-open-hours.png" alt="ساعات کاری برای دو شماره تلفن مختلف در دو منطقه زمانی مختلف در همان نمونه SeaX."/>

*ساعات کاری برای دو شماره تلفن مختلف در دو منطقه زمانی مختلف در همان نمونه SeaX.*
</center>

## سفارشی‌سازی پیام‌رسانی مکان توزیع شده
SeaX همچنین پیام‌های عدم دسترسی مشتری را بر اساس شماره تلفن فعال می‌کند. پیام‌های عدم دسترسی به طور خودکار برای مشتریان پخش می‌شوند، زمانی که هیچ کس برای پاسخگویی به تماس آنها در دسترس نیست. با قابلیت سفارشی‌سازی این پیام بر اساس شماره تلفن، می‌توانید پیام‌هایی به زبان‌های مختلف یا حاوی اطلاعات متفاوت داشته باشید، بسته به اینکه چه چیزی برای مشتریانی که با آن مکان تماس می‌گیرند، مهم‌تر است.

<center>
<img src="/images/blog/20-seax-distributed-contact-center/6-unavailable-message.png" alt="پیام عدم دسترسی برای یک شماره تلفن خاص در پلتفرم SeaX."/>

*پیام عدم دسترسی برای یک شماره تلفن خاص در پلتفرم SeaX.*
</center>

یک مرکز تماس سنتی تک‌مکان تنها می‌تواند به طور مؤثر به منطقه اطراف خود خدمات دهد، اگرچه ذاتاً بر روی یک پلتفرم واحد قرار دارد. یک مرکز تماس توزیع شده، پایگاه مشتریانی را که می‌تواند با عوامل در مکان‌های متعدد خدمات دهد، به شدت گسترش می‌دهد، اما با ادغام تمام خدماتی که عوامل آن نیاز دارند، صرف نظر از اینکه در کجا قرار دارند، چالش‌هایی دارد. با SeaX، می‌توانید به هر بخش از پایگاه مشتریان خود دسترسی پیدا کنید، در حالی که همچنان به همه عوامل خود در یک پلتفرم آسان خدمات می‌دهید.

از اینکه وقت گذاشتید و در مورد نحوه پشتیبانی مرکز تماس ابری SeaX از مرکز تماس توزیع شده شما در یک پلتفرم واحد مطالعه کردید، سپاسگزاریم. لطفاً منتظر پست وبلاگ بعدی ما باشید که به جزئیات فناوری‌های تبدیل متن به گفتار و گفتار به متن داخلی ما و نحوه بهبود مرکز تماس شما خواهد پرداخت. اگر علاقه‌مند به کسب اطلاعات بیشتر هستید، فرم "[رزرو دمو](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)" ما را پر کنید تا از نزدیک با پلتفرم SeaX آشنا شوید.
`;export{n as default};
