const e=`---
title: "มอบเสียงของศูนย์ติดต่อของคุณเองด้วย SeaX Voice Intelligence"
metatitle: "ให้ศูนย์ติดต่อของคุณพูดด้วย SeaX Voice Intelligence"
date: 2022-08-02 17:24:00-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Kim Dodds, Cody Kim, Xuchen Yao, Guoguo Chen
description: "ในบล็อกนี้ เราจะแสดงให้เห็นว่าเอนจินแปลงข้อความเป็นคำพูดและคำพูดเป็นข้อความภายในของ Seasalt.ai สามารถปรับปรุงแง่มุมต่างๆ ของแพลตฟอร์ม SeaX ได้อย่างไร"
weight: 1
tags:
  - SeaX
image: /images/blog/21-seax-voice-intelligence/thumbnail.png
canonicalURL: /blog/seax-voice-intelligence/
url: /blog/seax-voice-intelligence/
---

*จนถึงตอนนี้ใน [ชุดบล็อก SeaX](https://seasalt.ai/tags/seax/) ของเรา เราได้ให้ภาพรวมกว้างๆ ของผลิตภัณฑ์เรือธงของ Seasalt.ai: SeaX เรายังได้พูดคุยถึงสองคุณสมบัติหลักที่ทำให้ SeaX แตกต่างจากศูนย์บริการทางโทรศัพท์แบบดั้งเดิม: ประการแรก SeaX เป็นแบบ Omnichannel ซึ่งหมายความว่าคุณสามารถโต้ตอบกับลูกค้าบนช่องทางใดก็ได้ง่ายขึ้น และประการที่สอง แพลตฟอร์มนี้เป็นศูนย์ติดต่อแบบกระจาย ซึ่งช่วยให้คุณสามารถกำหนดเส้นทางข้อความและการโทรจากลูกค้าทั่วโลกไปยังตัวแทนที่กระจายอยู่ของคุณในสถานที่ต่างๆ ได้อย่างราบรื่น*

*ตอนนี้เราได้ครอบคลุมพื้นฐานของแพลตฟอร์ม SeaX แล้ว เราจะย้ายไปยังคุณสมบัติ AI และระบบอัตโนมัติขั้นสูงที่ทำให้ SeaX แตกต่างจากศูนย์ติดต่อ Omnichannel แบบกระจายอื่นๆ ในบล็อกนี้ เราจะแสดงให้เห็นว่าเอนจินแปลงข้อความเป็นคำพูดและคำพูดเป็นข้อความภายในของ Seasalt.ai สามารถปรับปรุงแง่มุมต่างๆ ของแพลตฟอร์ม SeaX ได้อย่างไร*

# สารบัญ
- [บทนำสู่ Voice Intelligence](#into-to-voice-intelligence)
- [สิ่งที่ทำให้ Seasalt.ai แตกต่าง](#what-sets-seasaltai-apart)
    - [คำพูดเป็นข้อความ](#speech-to-text)
    - [ข้อความเป็นคำพูด](#text-to-speech)
- [TTS และ STT ใน SeaX](#tts-and-stt-in-seax)
    - [Voice IVR](#voice-ivr)
    - [ข้อความไม่พร้อมใช้งาน](#unavailable-message)
    - [การถอดเสียงสด](#live-transcription)
    - [และอื่นๆ...](#and-more)

# บทนำสู่ Voice Intelligence

Voice Intelligence คือการใช้ปัญญาประดิษฐ์เพื่อวิเคราะห์และดึงข้อมูลเชิงลึกจากข้อมูลที่ใช้เสียง แม้ว่าทศวรรษที่ผ่านมาจะมีการพัฒนาเทคโนโลยีเสียงอย่างน่าทึ่ง แต่การใช้งานในองค์กรยังคงค่อนข้างจำกัด บริษัทต่างๆ ยังคงสะสมข้อมูลเสียงหลายเทราไบต์ แต่ในกรณีส่วนใหญ่ ข้อมูลเหล่านั้นยังไม่ถูกนำมาใช้ให้เกิดประโยชน์สูงสุด

เหตุผลหนึ่งคือข้อมูลเสียงประมวลผลยากกว่าข้อมูลรูปแบบอื่น เช่น สถิติพื้นฐาน หรือแม้แต่ข้อมูลข้อความธรรมดา ข้อมูลเสียงมีความพิเศษในหลายๆ ด้าน:
1. ขึ้นอยู่กับภาษา มีสำเนียงและภาษาถิ่น จึงยากที่จะเก็บข้อมูลได้ 100%
2. คุณภาพแตกต่างกันไปตามช่องทาง (โทรศัพท์เทียบกับ VoIP, โมโนเทียบกับสเตอริโอ), อัตราการสุ่มตัวอย่าง (8KHz เทียบกับ 16KHz), ความแม่นยำในการแสดงผล (8 บิต, 16 บิต, 32 บิต) และเสียงรบกวนจากสิ่งแวดล้อม เช่น เสียงรบกวนพื้นหลัง
3. ตีความยากกว่า: ตั้งแต่อารมณ์ของคำพูดไปจนถึงการระบุตัวผู้พูดไปจนถึงความหมายทางความหมาย

อย่างไรก็ตาม เมื่อจัดการอย่างเหมาะสมด้วยเครื่องมือที่ถูกต้อง ความฉลาดทางเสียงสามารถให้ประโยชน์มหาศาลแก่บริษัทที่ใช้งานได้ เหนือสิ่งอื่นใด ความสามารถในการจัดการข้อมูลเสียงอย่างเหมาะสมจะปลดล็อกความสามารถในการใช้การถอดเสียงพูดเป็นข้อความส่วนบุคคล ซึ่งสามารถทำให้การสนทนาสามารถค้นหา จัดทำดัชนี และให้ข้อมูลเชิงลึกได้ และช่วยให้สามารถประมวลผล NLP เพิ่มเติมได้ เมื่อมีการรวบรวมข้อมูลมากขึ้น การปรับปรุงบริการเหล่านี้ก็เป็นไปได้เช่นกัน เช่น การเพิ่มความแม่นยำในการถอดเสียง การเพิ่มความครอบคลุมของกรณีการใช้งาน และการจัดหารูปแบบเสียงและภาษาที่ปรับแต่งได้เพื่อปรับให้เข้ากับภาษาและภาษาถิ่นใหม่ๆ

# สิ่งที่ทำให้ Seasalt.ai แตกต่าง

Seasalt.ai ให้บริการเทคโนโลยีและผลิตภัณฑ์ Cloud Communication AI แก่ลูกค้าองค์กร
เราได้พัฒนาเทคโนโลยีเสียงและภาษาภายในองค์กรสำหรับข้อความ
และการโทรด้วยเสียงในศูนย์ติดต่อองค์กร เอ็นจิ้นภาษาธรรมชาติของเราสนับสนุนภาษา
ที่มีทรัพยากรสูงและทรัพยากรต่ำหลากหลาย: พม่า, จีน, อังกฤษ, ฟิลิปปินส์,
เยอรมัน, อินโดนีเซีย, เขมร, ลาว, มาเลย์, สเปน, ทมิฬ, ไทย, เวียดนาม ฯลฯ
Seasalt.ai ได้รับการสนับสนุนจากเงินทุนร่วมลงทุนและบริหารงานโดยกลุ่มผู้เชี่ยวชาญชั้นนำของโลกด้านการรู้จำเสียงพูดเชิงลึก,
การสังเคราะห์เสียงพูดด้วยโครงข่ายประสาทเทียม และบทสนทนาภาษาธรรมชาติ

ดูวิดีโอสาธิตการแปลงคำพูดเป็นข้อความของเรา:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/Log8usX8ViE" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## คำพูดเป็นข้อความ

<center>
<img src="/images/blog/21-seax-voice-intelligence/STT.png" alt="กราฟิกคำพูดเป็นข้อความ."/>
</center>

เอนจินแปลงคำพูดเป็นข้อความของเราจะรับเสียงพูดและสร้างการถอดเสียงแบบเรียลไทม์ เริ่มต้นจากเสียง เราจะดึงคุณสมบัติทางสัทวิทยา แปลงคุณสมบัติเหล่านี้เป็นหน่วยเสียง และจากนั้นจับคู่หน่วยเสียงเหล่านี้กับการสะกดคำของภาษาเป้าหมาย ระบบปัจจุบันของเราสามารถถอดเสียงได้หลายภาษา รวมถึงภาษาอังกฤษและภาษาจีน โดยมีการเพิ่มภาษาอื่นๆ อย่างต่อเนื่อง

ดูวิดีโอการปรับแต่ง Speech-to-Text ของเราเพื่อดูว่าเอนจิน STT ของ Seasalt สามารถปรับแต่งสำหรับโดเมนใดก็ได้อย่างไร:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/1YEU6mexzWQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## ข้อความเป็นคำพูด

<center>
<img src="/images/blog/21-seax-voice-intelligence/TTS.png" alt="กราฟิกข้อความเป็นคำพูด."/>
</center>

Text-to-Speech คือกระบวนการสังเคราะห์เสียงพูดของมนุษย์ที่สมจริงพร้อมด้วยน้ำเสียงและจังหวะที่เป็นธรรมชาติจากข้อความเท่านั้น โมเดลของเราจะรับข้อความปกติ แปลงข้อความนี้เป็นหน่วยเสียง จากนั้นแปลงหน่วยเสียงเป็นเสียงในขณะที่คาดการณ์ระดับเสียง ระยะเวลา และระดับเสียงที่เหมาะสมในแต่ละช่วงเวลาเพื่อให้ได้ประสบการณ์ TTS ที่สมจริงที่สุดเท่าที่จะเป็นไปได้ หากผลลัพธ์สุดท้ายไม่สมบูรณ์ เรามีฟังก์ชันการปรับแต่งเสียงที่สังเคราะห์ขึ้น รวมถึงการออกเสียงคำ การหยุดชั่วคราว และการเน้นเสียง

ดูวิดีโอสาธิตการปรับแต่ง Text-to-Speech ของเราเพื่อดูว่าเอาต์พุตเอนจิน TTS ของ Seasalt สามารถปรับแต่งเพื่อให้เสียงสังเคราะห์ที่สมจริงได้อย่างไร:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/GJCOhTtImp8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

คุณยังสามารถตรวจสอบ [หน้า TTS](https://suite.seasalt.ai/tts) บนเว็บไซต์ของเราเพื่อฟังตัวอย่างเสียงสังเคราะห์บางส่วนของเรา รวมถึง Tom Hanks, David Attenborough และ Reese Witherspoon

# TTS และ STT ใน SeaX

## Voice IVR

<center>
<img src="/images/blog/21-seax-voice-intelligence/flow.png" alt="โฟลว์ Voice IVR โดยใช้เอนจินแปลงคำพูดเป็นข้อความของ Seasalt.ai สำหรับการถอดเสียงแบบเรียลไทม์และการกำหนดเส้นทางการโทร."/>

*โฟลว์ Voice IVR โดยใช้เอนจินแปลงคำพูดเป็นข้อความของ Seasalt.ai สำหรับการถอดเสียงแบบเรียลไทม์และการกำหนดเส้นทางการโทร.*
</center>

ความฉลาดทางเสียงสามารถเริ่มช่วยเหลือได้ก่อนที่การโทรจะปรากฏบนแพลตฟอร์ม SeaX โดยการตรวจสอบให้แน่ใจว่าการโทรถูกกำหนดเส้นทางไปยังตำแหน่งที่ถูกต้องและรวบรวมข้อมูลสำคัญก่อนที่จะส่งต่อการโทรไปยังตัวแทน SeaX ใช้ Twilio Studio เพื่อปรับแต่งโฟลว์การกำหนดเส้นทางการโทรและข้อความ แต่เรายังสามารถรวมเอนจินแปลงคำพูดเป็นข้อความของเราเข้ากับโฟลว์ IVR เพื่อให้ลูกค้าสามารถใช้ภาษาธรรมชาติเพื่อกำหนดเส้นทางการโทรของพวกเขาได้ (แทนที่จะเป็นประสบการณ์แบบดั้งเดิม “กด 1 สำหรับ…” ) นอกจากนี้ หากบริษัทของคุณสนใจที่จะใช้แชทบอทเพื่อโต้ตอบกับลูกค้า เราสามารถก้าวไปอีกขั้นโดยให้แชทบอทของคุณมีเสียงเพื่อพูดคุยกับลูกค้าทางโทรศัพท์โดยใช้เอนจินแปลงข้อความเป็นคำพูดของเรา

## ข้อความไม่พร้อมใช้งาน

<center>
<img src="/images/blog/21-seax-voice-intelligence/unavailable-message.png" alt="การกำหนดค่าข้อความไม่พร้อมใช้งานของ SeaX โดยใช้ข้อความเป็นคำพูด."/>

*การกำหนดค่าข้อความไม่พร้อมใช้งานของ SeaX โดยใช้ข้อความเป็นคำพูด.*
</center>

เทคโนโลยีแปลงข้อความเป็นคำพูดของเรายังช่วยให้สามารถปรับแต่งข้อความเสียงได้อย่างมาก ตัวอย่างเช่น ข้อความเหล่านี้สามารถถูกเรียกใช้เมื่อลูกค้าโทรเข้ามาหลังเวลาทำการปกติ หรือหากลูกค้าจำเป็นต้องถูกพักสายขณะรอตัวแทนที่ว่าง

## การถอดเสียงสด

<center>
<img src="/images/blog/21-seax-voice-intelligence/live-transcription.jpg" alt="การถอดเสียงการโทรสดพร้อมการวิเคราะห์ที่แสดงให้ตัวแทนบน SeaX."/>

*การถอดเสียงการโทรสดพร้อมการวิเคราะห์ที่แสดงให้ตัวแทนบน SeaX.*
</center>

เมื่อลูกค้าอยู่ในสายกับตัวแทน เอนจินแปลงคำพูดเป็นข้อความของเราจะให้การถอดเสียงการสนทนาแบบเรียลไทม์ที่แม่นยำเพื่อการอ้างอิงของตัวแทน สิ่งนี้ช่วยให้ตัวแทนสามารถอ้างอิงจุดก่อนหน้าในการสนทนาและ/หรือตรวจสอบความเข้าใจของพวกเขาเกี่ยวกับสิ่งที่ลูกค้าพูด นอกจากนี้ การถอดเสียงเหล่านี้ยังมีประโยชน์อย่างยิ่งสำหรับการใช้งานปลายน้ำ เช่น การแยกหัวข้อ การแยกการกระทำ การสรุป การวิเคราะห์การประชุม ฯลฯ

## และอื่นๆ...

ข้างต้นเป็นเพียงไม่กี่วิธีที่ SeaX ผสานรวมความฉลาดทางเสียงขั้นสูงเพื่อลดเวลารอ ปรับปรุงประสิทธิภาพของตัวแทน และมอบประสบการณ์ที่ราบรื่นโดยรวมให้กับทั้งลูกค้าและตัวแทน หากต้องการเรียนรู้เพิ่มเติมเกี่ยวกับคุณสมบัติขั้นสูงที่มาพร้อมกับแพลตฟอร์ม SeaX โปรดติดตามบล็อกโพสต์ถัดไปของเรา ซึ่งรวมถึงฐานความรู้ AI การจัดการกรณี และ SMS จำนวนมาก หากต้องการรับการสาธิตส่วนตัวและหารือว่าแพลตฟอร์ม SeaX สามารถตอบสนองความต้องการทางธุรกิจเฉพาะของคุณได้อย่างไร โปรดกรอก [แบบฟอร์มจองการสาธิต](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) ของเรา
`;export{e as default};
