const e=`---
title: "SeaX குரல் நுண்ணறிவுடன் உங்கள் தொடர்பு மையத்திற்கு அதன் சொந்த குரலைக் கொடுங்கள்"
metatitle: "SeaX குரல் நுண்ணறிவுடன் உங்கள் தொடர்பு மையம் பேசட்டும்"
date: 2022-08-02 17:24:00-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Kim Dodds, Cody Kim, Xuchen Yao, Guoguo Chen
description: "இந்த வலைப்பதிவில், Seasalt.ai இன் உள்-உரை-க்கு-பேச்சு மற்றும் பேச்சு-க்கு-உரை இயந்திரங்கள் SeaX தளத்தின் பல்வேறு அம்சங்களை எவ்வாறு மேம்படுத்த முடியும் என்பதை நாங்கள் காண்பிப்போம்."
weight: 1
tags:
  - SeaX
image: /images/blog/21-seax-voice-intelligence/thumbnail.png
canonicalURL: /blog/seax-voice-intelligence/
url: /blog/seax-voice-intelligence/
---

*இதுவரை எங்கள் [SeaX வலைப்பதிவுத் தொடரில்](https://seasalt.ai/tags/seax/), Seasalt.ai இன் முதன்மை தயாரிப்பான SeaX இன் பரந்த கண்ணோட்டத்தை நாங்கள் உங்களுக்கு வழங்கியுள்ளோம். SeaX ஐ ஒரு பாரம்பரிய அழைப்பு மையத்திலிருந்து வேறுபடுத்தும் இரண்டு முக்கிய அம்சங்களையும் நாங்கள் விவாதித்தோம்: முதலாவதாக, SeaX பல சேனல்களைக் கொண்டது, அதாவது எந்தவொரு சேனலிலும் வாடிக்கையாளர்களுடன் எளிதாக தொடர்பு கொள்ள முடியும், இரண்டாவதாக, இந்த தளம் ஒரு விநியோகிக்கப்பட்ட தொடர்பு மையமாகும், இது உலகெங்கிலும் உள்ள வாடிக்கையாளர்களிடமிருந்து வரும் செய்திகள் மற்றும் அழைப்புகளை உங்கள் விநியோகிக்கப்பட்ட முகவர்களுக்கு பல்வேறு இடங்களில் தடையின்றி அனுப்ப அனுமதிக்கிறது.*

*இப்போது நாங்கள் SeaX தளத்தின் அடிப்படைகளை உள்ளடக்கியுள்ளோம், SeaX ஐ மற்ற விநியோகிக்கப்பட்ட பல சேனல் தொடர்பு மையங்களிலிருந்து வேறுபடுத்தும் மேம்பட்ட AI மற்றும் ஆட்டோமேஷன் அம்சங்களுக்குச் செல்வோம். இந்த வலைப்பதிவில், Seasalt.ai இன் உள்-உரை-க்கு-பேச்சு மற்றும் பேச்சு-க்கு-உரை இயந்திரங்கள் SeaX தளத்தின் பல்வேறு அம்சங்களை எவ்வாறு மேம்படுத்த முடியும் என்பதை நாங்கள் காண்பிப்போம்.*

# பொருளடக்கம்
- [குரல் நுண்ணறிவுக்கு அறிமுகம்](#into-to-voice-intelligence)
- [Seasalt.ai ஐ எது வேறுபடுத்துகிறது](#what-sets-seasaltai-apart)
    - [பேச்சு-க்கு-உரை](#speech-to-text)
    - [உரை-க்கு-பேச்சு](#text-to-speech)
- [SeaX இல் TTS மற்றும் STT](#tts-and-stt-in-seax)
    - [குரல் IVR](#voice-ivr)
    - [கிடைக்காத செய்தி](#unavailable-message)
    - [நேரடி டிரான்ஸ்கிரிப்ஷன்](#live-transcription)
    - [மேலும் பல...](#and-more)

# குரல் நுண்ணறிவுக்கு அறிமுகம்

குரல் நுண்ணறிவு என்பது குரல் அடிப்படையிலான தரவுகளிலிருந்து நுண்ணறிவுகளை பகுப்பாய்வு செய்வதற்கும் பெறுவதற்கும் செயற்கை நுண்ணறிவைப் பயன்படுத்துவதாகும். கடந்த தசாப்தத்தில் குரல் தொழில்நுட்பங்களில் குறிப்பிடத்தக்க வளர்ச்சி காணப்பட்டாலும், நிறுவன அமைப்புகளில் அவற்றின் பயன்பாடு இன்னும் ஓரளவு குறைவாகவே உள்ளது. நிறுவனங்கள் தொடர்ந்து டெராபைட் கணக்கான குரல் தரவுகளை குவித்து வருகின்றன, ஆனால் பெரும்பாலான சந்தர்ப்பங்களில், அவை அதன் முழு திறனுக்கும் பயன்படுத்தப்படுவதில்லை.

இதற்கு ஒரு காரணம், குரல் தரவு அடிப்படை புள்ளிவிவரங்கள் அல்லது எளிய உரைத் தரவு போன்ற பிற தரவு வடிவங்களை விட செயலாக்க கடினமாக உள்ளது. பேச்சுத் தரவு பல வழிகளில் தனித்துவமானது:
1. இது மொழி சார்ந்தது, பேச்சுவழக்குகள் மற்றும் உச்சரிப்புகளுடன், எனவே 100% தகவலைப் பிடிப்பது கடினம்
2. அதன் தரம் சேனல்களால் (தொலைபேசி vs. VoIP, மோனோ vs. ஸ்டீரியோ), மாதிரி விகிதம் (8KHz vs. 16KHz), பிரதிநிதித்துவ துல்லியம் (8bit, 16 bit, 32bit) மற்றும் பின்னணி இரைச்சல் போன்ற சுற்றுச்சூழல் ஒலிகளால் மாறுபடும்
3. இதை விளக்குவது கடினம்: பேச்சின் உணர்ச்சிகளிலிருந்து பேச்சாளர் அடையாளம் வரை அர்த்தத்தின் சொற்பொருள் வரை

இருப்பினும், சரியான கருவிகளுடன் சரியாகக் கையாளப்படும்போது, குரல் நுண்ணறிவு அதைப் பயன்படுத்தும் நிறுவனங்களுக்கு மிகப்பெரிய நன்மைகளை வழங்க முடியும். மற்றவற்றுடன், குரல் தரவை சரியாக நிர்வகிக்கும் திறன் தனிப்பயனாக்கப்பட்ட பேச்சு-க்கு-உரை டிரான்ஸ்கிரிப்ஷனைப் பயன்படுத்தும் திறனைத் திறக்கிறது, இது உரையாடல்களை தேடக்கூடிய, குறியிடக்கூடிய மற்றும் நுண்ணறிவுள்ளதாக்க முடியும், மேலும் மேலும் NLP செயலாக்கத்தை அனுமதிக்கிறது. மேலும் தரவு சேகரிக்கப்படுவதால், இந்த சேவைகளில் மேம்பாடுகளும் சாத்தியமாகும், அவை: டிரான்ஸ்கிரிப்ஷன் துல்லியத்தை அதிகரிப்பது, பயன்பாட்டு நிகழ்வுகளின் கவரேஜை அதிகரிப்பது மற்றும் புதிய மொழிகள் மற்றும் பேச்சுவழக்குகளுக்கு ஏற்ப தனிப்பயனாக்கக்கூடிய பேச்சு மற்றும் மொழி மாதிரிகளை வழங்குவது.

# Seasalt.ai ஐ எது வேறுபடுத்துகிறது

Seasalt.ai நிறுவன வாடிக்கையாளர்களுக்கு கிளவுட் கம்யூனிகேஷன் AI தொழில்நுட்பங்கள் மற்றும் தயாரிப்புகளை வழங்குகிறது.
நிறுவன தொடர்பு மையங்களில் உரைச் செய்திகள் மற்றும் குரல் அழைப்புகளுக்கான உள் பேச்சு மற்றும் மொழி தொழில்நுட்பங்களை நாங்கள் உருவாக்கியுள்ளோம்.
எங்கள் இயற்கை மொழி இயந்திரம் பரந்த அளவிலான உயர்-வள மற்றும் குறைந்த-வள மொழிகளை ஆதரிக்கிறது: பர்மியன், சீனம், ஆங்கிலம், பிலிப்பினோ,
ஜெர்மன், இந்தோனேசியன், கெமர், லாவோ, மலாய், ஸ்பானிஷ், தமிழ், தாய், வியட்நாமியன், முதலியன.
Seasalt.ai துணிகர நிதியுதவி பெற்று, ஆழமான பேச்சு அங்கீகாரம்,
நரம்பியல் பேச்சு தொகுப்பு மற்றும் இயற்கை மொழி உரையாடல்களில் உலகின் முன்னணி நிபுணர்கள் குழுவால் நடத்தப்படுகிறது.

எங்கள் பேச்சு-க்கு-உரை டெமோ வீடியோவைப் பாருங்கள்:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/Log8usX8ViE" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## பேச்சு-க்கு-உரை

<center>
<img src="/images/blog/21-seax-voice-intelligence/STT.png" alt="பேச்சு-க்கு-உரை கிராஃபிக்."/>
</center>

எங்கள் பேச்சு-க்கு-உரை இயந்திரம் பேச்சு ஆடியோவை எடுத்துக்கொண்டு நிகழ்நேரத்தில் டிரான்ஸ்கிரிப்ஷன்களை உருவாக்குகிறது. ஆடியோவிலிருந்து தொடங்கி, நாங்கள் ஒலிப்பு அம்சங்களைப் பிரித்தெடுக்கிறோம், இந்த அம்சங்களை ஒலிப்புகளாக மாற்றுகிறோம், பின்னர் இந்த ஒலிப்புகளை இலக்கு மொழியின் எழுத்துக்களுக்கு வரைபடமாக்குகிறோம். எங்கள் தற்போதைய அமைப்பு ஆங்கிலம் மற்றும் சீனம் உட்பட பல மொழிகளை டிரான்ஸ்கிரிப்ஷன் செய்ய முடியும், மேலும் பல மொழிகள் தொடர்ந்து சேர்க்கப்படுகின்றன.

Seasalt இன் STT இயந்திரத்தை எந்த டொமைனுக்கும் எவ்வாறு தனிப்பயனாக்கலாம் என்பதைப் பார்க்க எங்கள் பேச்சு-க்கு-உரை தனிப்பயனாக்குதல் வீடியோவைப் பாருங்கள்:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/1YEU6mexzWQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## உரை-க்கு-பேச்சு

<center>
<img src="/images/blog/21-seax-voice-intelligence/TTS.png" alt="உரை-க்கு-பேச்சு கிராஃபிக்."/>
</center>

உரை-க்கு-பேச்சு என்பது இயற்கையான உச்சரிப்பு மற்றும் தாளத்துடன் கூடிய யதார்த்தமான மனித பேச்சை உரையிலிருந்து மட்டுமே தொகுக்கும் செயல்முறையாகும். எங்கள் மாதிரி வழக்கமான உரையை எடுத்துக்கொள்கிறது, இந்த உரையை ஒலிப்புகளாக மொழிபெயர்க்கிறது, பின்னர் ஒலிப்புகளை ஆடியோவாக மாற்றுகிறது, அதே நேரத்தில் ஒவ்வொரு நேரப்படியிலும் சரியான சுருதி, கால அளவு மற்றும் ஒலியளவை முன்னறிவிக்கிறது, இது மிகவும் யதார்த்தமான TTS அனுபவத்தை சாத்தியமாக்குகிறது. இறுதி முடிவு சரியாக இல்லாவிட்டால், சொல் உச்சரிப்பு, இடைநிறுத்தங்கள் மற்றும் வலியுறுத்தல் உள்ளிட்ட தொகுக்கப்பட்ட ஆடியோவை சரிசெய்யும் திறனை நாங்கள் வழங்குகிறோம்.

Panoorin ang aming Text-to-Speech customization demo video upang makita kung paano maaaring i-customize ang output ng TTS engine ng Seasalt upang magbigay ng makatotohanang synthesized speech:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/GJCOhTtImp8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

டாம் ஹாங்க்ஸ், டேவிட் அட்டன்பரோ மற்றும் ரீஸ் விதர்ஸ்பூன் உள்ளிட்ட எங்கள் தொகுக்கப்பட்ட குரல்களின் சில எடுத்துக்காட்டுகளைக் கேட்க எங்கள் இணையதளத்தில் உள்ள [TTS பக்கத்தையும்](https://suite.seasalt.ai/tts) நீங்கள் பார்க்கலாம்.

# SeaX இல் TTS மற்றும் STT

## குரல் IVR

<center>
<img src="/images/blog/21-seax-voice-intelligence/flow.png" alt="நிகழ்நேர டிரான்ஸ்கிரிப்ஷன் மற்றும் அழைப்பு ரூட்டிங்கிற்காக Seasalt.ai இன் பேச்சு-க்கு-உரை இயந்திரத்தைப் பயன்படுத்தி குரல் IVR ஓட்டம்."/>

*நிகழ்நேர டிரான்ஸ்கிரிப்ஷன் மற்றும் அழைப்பு ரூட்டிங்கிற்காக Seasalt.ai இன் பேச்சு-க்கு-உரை இயந்திரத்தைப் பயன்படுத்தி குரல் IVR ஓட்டம்.*
</center>

அழைப்புகள் SeaX தளத்திற்கு வருவதற்கு முன்பே குரல் நுண்ணறிவு உதவத் தொடங்கலாம், அழைப்புகள் சரியான இடத்திற்கு அனுப்பப்படுவதை உறுதிசெய்து, அழைப்பை ஒரு முகவரிடம் ஒப்படைக்கும் முன் முக்கியமான தகவல்களை சேகரிக்கலாம். அழைப்பு மற்றும் செய்தி ரூட்டிங் ஓட்டங்களை தனிப்பயனாக்க SeaX Twilio Studio ஐப் பயன்படுத்துகிறது. ஆனால் வாடிக்கையாளர் தங்கள் அழைப்பை ரூட் செய்ய இயற்கை மொழியைப் பயன்படுத்த அனுமதிக்க எங்கள் பேச்சு-க்கு-உரை இயந்திரத்தை IVR ஓட்டத்தில் ஒருங்கிணைக்கலாம் (பாரம்பரிய “1 ஐ அழுத்தவும்…” அனுபவத்திற்கு பதிலாக). கூடுதலாக, உங்கள் நிறுவனம் வாடிக்கையாளர்களுடன் தொடர்பு கொள்ள ஒரு சாட்போட்டைப் பயன்படுத்த ஆர்வமாக இருந்தால், எங்கள் உரை-க்கு-பேச்சு இயந்திரத்தைப் பயன்படுத்தி தொலைபேசியில் வாடிக்கையாளர்களுடன் பேச உங்கள் சாட்போட்டிற்கு ஒரு குரலைக் கொடுப்பதன் மூலம் ஒரு படி மேலே செல்லலாம்.

## கிடைக்காத செய்தி

<center>
<img src="/images/blog/21-seax-voice-intelligence/unavailable-message.png" alt="உரை-க்கு-பேச்சு பயன்படுத்தி SeaX கிடைக்காத செய்தி உள்ளமைவு."/>

*உரை-க்கு-பேச்சு பயன்படுத்தி SeaX கிடைக்காத செய்தி உள்ளமைவு.*
</center>

எங்கள் உரை-க்கு-பேச்சு தொழில்நுட்பம் மிகவும் தனிப்பயனாக்கக்கூடிய குரல் செய்திகளையும் அனுமதிக்கிறது. உதாரணமாக, வாடிக்கையாளர் சாதாரண வணிக நேரத்திற்குப் பிறகு அழைக்கும்போது, அல்லது வாடிக்கையாளர் ஒரு முகவர் கிடைக்கும் வரை காத்திருக்கும்போது, இவை தூண்டப்படலாம்.

## நேரடி டிரான்ஸ்கிரிப்ஷன்

<center>
<img src="/images/blog/21-seax-voice-intelligence/live-transcription.jpg" alt="SeaX இல் முகவருக்குக் காட்டப்படும் பகுப்பாய்வுகளுடன் நேரடி அழைப்பு டிரான்ஸ்கிரிப்ஷன்."/>

*SeaX இல் முகவருக்குக் காட்டப்படும் பகுப்பாய்வுகளுடன் நேரடி அழைப்பு டிரான்ஸ்கிரிப்ஷன்.*
</center>

ஒரு வாடிக்கையாளர் ஒரு முகவருடன் அழைப்பில் இருக்கும்போது, எங்கள் பேச்சு-க்கு-உரை இயந்திரம் முகவரின் குறிப்புக்காக உரையாடலின் துல்லியமான நிகழ்நேர டிரான்ஸ்கிரிப்ஷன்களை வழங்குகிறது. இது முகவர் உரையாடலின் முந்தைய புள்ளிகளைக் குறிப்பிடவும் மற்றும்/அல்லது வாடிக்கையாளர் சொன்னதை அவர்கள் புரிந்துகொண்டதை இருமுறை சரிபார்க்கவும் அனுமதிக்கிறது. கூடுதலாக, இந்த டிரான்ஸ்கிரிப்ஷன்கள் தலைப்பு பிரித்தெடுத்தல், செயல் பிரித்தெடுத்தல், சுருக்கம், சந்திப்பு பகுப்பாய்வு போன்ற கீழ்நிலை பயன்பாடுகளுக்கு நம்பமுடியாத அளவிற்கு பயனுள்ளதாக இருக்கும்.

## மேலும் பல...

மேலே உள்ளவை, காத்திருப்பு நேரங்களைக் குறைப்பதற்கும், முகவர் செயல்திறனை மேம்படுத்துவதற்கும், வாடிக்கையாளர்களுக்கும் முகவர்களுக்கும் ஒட்டுமொத்தமாக தடையற்ற அனுபவத்தை வழங்குவதற்கும் SeaX மேம்பட்ட குரல் நுண்ணறிவை எவ்வாறு ஒருங்கிணைக்கிறது என்பதற்கான சில வழிகள் மட்டுமே. SeaX தளத்துடன் வரும் மேலும் மேம்பட்ட அம்சங்களைப் பற்றி அறிய, AI அறிவுத் தளம், வழக்கு மேலாண்மை மற்றும் மொத்த SMS உள்ளிட்ட எங்கள் அடுத்த வலைப்பதிவு இடுகைகளுக்காக காத்திருங்கள். தனிப்பட்ட டெமோவைப் பெறவும், உங்கள் குறிப்பிட்ட வணிகத் தேவைகளை SeaX தளம் எவ்வாறு பூர்த்தி செய்ய முடியும் என்பதைப் பற்றி விவாதிக்கவும், எங்கள் [டெமோ படிவத்தை முன்பதிவு செய்யவும்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting).
`;export{e as default};
