const e=`---
title: "SeaX वॉयस इंटेलिजेंस के साथ अपने संपर्क केंद्र को अपनी आवाज दें"
metatitle: "SeaX वॉयस इंटेलिजेंस के साथ अपने संपर्क केंद्र को बोलने दें"
date: 2022-08-02 17:24:00-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Kim Dodds, Cody Kim, Xuchen Yao, Guoguo Chen
description: "इस ब्लॉग में, हम दिखाएंगे कि Seasalt.ai के इन-हाउस टेक्स्ट-टू-स्पीच और स्पीच-टू-टेक्स्ट इंजन SeaX प्लेटफॉर्म के विभिन्न पहलुओं को कैसे बढ़ा सकते हैं।"
weight: 1
tags:
  - SeaX
image: /images/blog/21-seax-voice-intelligence/thumbnail.png
canonicalURL: /blog/seax-voice-intelligence/
url: /blog/seax-voice-intelligence/
---

*अब तक हमारी [SeaX ब्लॉग श्रृंखला](https://seasalt.ai/tags/seax/) में, हमने आपको Seasalt.ai के प्रमुख उत्पाद: SeaX का एक व्यापक अवलोकन दिया है। हमने दो प्रमुख विशेषताओं पर भी चर्चा की जो SeaX को पारंपरिक कॉल सेंटर से अलग करती हैं: पहला, कि SeaX ओमनीचैनल है, जिसका अर्थ है कि आप किसी भी चैनल पर ग्राहकों के साथ अधिक आसानी से बातचीत कर सकते हैं, और दूसरा, कि प्लेटफॉर्म एक वितरित संपर्क केंद्र है, जो आपको दुनिया भर के ग्राहकों से संदेशों और कॉलों को विभिन्न स्थानों पर अपने वितरित एजेंटों तक सहजता से रूट करने की अनुमति देता है।*

*अब जब हमने SeaX प्लेटफॉर्म की मूल बातें कवर कर ली हैं, तो हम उन्नत AI और स्वचालन सुविधाओं पर आगे बढ़ेंगे जो SeaX को अन्य वितरित ओमनीचैनल संपर्क केंद्रों से अलग करती हैं। इस ब्लॉग में, हम दिखाएंगे कि Seasalt.ai के इन-हाउस टेक्स्ट-टू-स्पीच और स्पीच-टू-टेक्स्ट इंजन SeaX प्लेटफॉर्म के विभिन्न पहलुओं को कैसे बढ़ा सकते हैं।*

# विषय-सूची
- [वॉयस इंटेलिजेंस का परिचय](#into-to-voice-intelligence)
- [क्या Seasalt.ai को अलग करता है](#what-sets-seasaltai-apart)
    - [स्पीच-टू-टेक्स्ट](#speech-to-text)
    - [टेक्स्ट-टू-स्पीच](#text-to-speech)
- [SeaX में TTS और STT](#tts-and-stt-in-seax)
    - [वॉयस IVR](#voice-ivr)
    - [अनुपलब्ध संदेश](#unavailable-message)
    - [लाइव ट्रांसक्रिप्शन](#live-transcription)
    - [और भी बहुत कुछ...](#and-more)

# वॉयस इंटेलिजेंस का परिचय

वॉयस इंटेलिजेंस आर्टिफिशियल इंटेलिजेंस का उपयोग करके आवाज-आधारित डेटा से अंतर्दृष्टि का विश्लेषण और प्राप्त करना है। जबकि पिछले दशक में आवाज प्रौद्योगिकियों में उल्लेखनीय विकास देखा गया है, उद्यम सेटिंग्स में उनका उपयोग अभी भी कुछ हद तक सीमित है। कंपनियां टेराबाइट्स वॉयस डेटा जमा करना जारी रखती हैं, लेकिन अधिकांश मामलों में, इसका पूरी क्षमता से उपयोग नहीं किया जा रहा है।

इसका एक कारण यह है कि वॉयस डेटा को अन्य प्रकार के डेटा, जैसे कि बुनियादी आंकड़े या यहां तक कि सादे टेक्स्ट डेटा की तुलना में संसाधित करना अधिक कठिन है। स्पीच डेटा कई अलग-अलग तरीकों से अद्वितीय है:
1. यह भाषा पर निर्भर है, जिसमें बोलियाँ और उच्चारण शामिल हैं, इसलिए 100% जानकारी कैप्चर करना मुश्किल है
2. इसकी गुणवत्ता चैनलों (टेलीफोनी बनाम वीओआईपी, मोनो बनाम स्टीरियो), सैंपलिंग दर (8KHz बनाम 16KHz), प्रतिनिधित्व सटीकता (8bit, 16 bit, 32bit) और पृष्ठभूमि शोर जैसे पर्यावरणीय ध्वनियों के अनुसार भिन्न होती है
3. इसकी व्याख्या करना अधिक कठिन है: भाषण की भावनाओं से लेकर स्पीकर पहचान तक अर्थ के अर्थशास्त्र तक

हालांकि, जब सही उपकरणों के साथ ठीक से निपटा जाता है, तो वॉयस इंटेलिजेंस उन कंपनियों को बड़े पैमाने पर लाभ प्रदान कर सकता है जो इसका उपयोग करती हैं। अन्य बातों के अलावा, वॉयस डेटा को ठीक से प्रबंधित करने में सक्षम होने से व्यक्तिगत स्पीच-टू-टेक्स्ट ट्रांसक्रिप्शन का उपयोग करने की क्षमता अनलॉक हो जाती है, जो बातचीत को खोजने योग्य, अनुक्रमित और अंतर्दृष्टिपूर्ण बना सकती है, और आगे एनएलपी प्रसंस्करण की अनुमति देती है। जैसे-जैसे अधिक डेटा एकत्र किया जाता है, इन सेवाओं में सुधार भी संभव है, जैसे: ट्रांसक्रिप्शन सटीकता बढ़ाना, उपयोग के मामलों की कवरेज बढ़ाना, और नई भाषाओं और बोलियों के अनुकूल होने के लिए अनुकूलन योग्य भाषण और भाषा मॉडल प्रदान करना।

# क्या Seasalt.ai को अलग करता है

Seasalt.ai उद्यम ग्राहकों को क्लाउड कम्युनिकेशन AI प्रौद्योगिकियां और उत्पाद प्रदान करता है।
हमने टेक्स्ट संदेशों और वॉयस कॉल के लिए इन-हाउस स्पीच और भाषा प्रौद्योगिकियां विकसित की हैं
उद्यम संपर्क केंद्रों में। हमारा प्राकृतिक भाषा इंजन उच्च-संसाधन और निम्न-संसाधन दोनों भाषाओं की एक विस्तृत श्रृंखला का समर्थन करता है: बर्मी, चीनी, अंग्रेजी, फिलिपिनो,
जर्मन, इंडोनेशियाई, खमेर, लाओ, मलय, स्पेनिश, तमिल, थाई, वियतनामी, आदि।
Seasalt.ai उद्यम पूंजी द्वारा वित्त पोषित है और गहरे भाषण पहचान,
न्यूरल स्पीच सिंथेसिस और प्राकृतिक भाषा संवादों में दुनिया के अग्रणी विशेषज्ञों के एक समूह द्वारा चलाया जाता है।

हमारा स्पीच-टू-टेक्स्ट डेमो वीडियो देखें:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/Log8usX8ViE" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## स्पीच-टू-टेक्स्ट

<center>
<img src="/images/blog/21-seax-voice-intelligence/STT.png" alt="स्पीच-टू-टेक्स्ट ग्राफिक।"/>
</center>

हमारा स्पीच-टू-टेक्स्ट इंजन स्पीच ऑडियो लेता है और वास्तविक समय में ट्रांसक्रिप्शन उत्पन्न करता है। ऑडियो से शुरू होकर, हम ध्वन्यात्मक विशेषताओं को निकालते हैं, इन विशेषताओं को फोनेम में परिवर्तित करते हैं, और फिर इन फोनेम को लक्ष्य भाषा की वर्तनी में मैप करते हैं। हमारी वर्तमान प्रणाली अंग्रेजी और चीनी सहित कई भाषाओं को ट्रांसक्राइब करने में सक्षम है, जिसमें लगातार और भाषाएं जोड़ी जा रही हैं।

यह देखने के लिए हमारा स्पीच-टू-टेक्स्ट अनुकूलन वीडियो देखें कि Seasalt के STT इंजन को किसी भी डोमेन के लिए कैसे अनुकूलित किया जा सकता है:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/1YEU6mexzWQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## टेक्स्ट-टू-स्पीच

<center>
<img src="/images/blog/21-seax-voice-intelligence/TTS.png" alt="टेक्स्ट-टू-स्पीच ग्राफिक।"/>
</center>

टेक्स्ट-टू-स्पीच केवल टेक्स्ट से प्राकृतिक स्वर और ताल के साथ यथार्थवादी मानव भाषण को संश्लेषित करने की प्रक्रिया है। हमारा मॉडल नियमित टेक्स्ट लेता है, इस टेक्स्ट को फोनेम में अनुवाद करता है और फिर फोनेम को ऑडियो में परिवर्तित करता है, जबकि सबसे यथार्थवादी टीटीएस अनुभव के लिए प्रत्येक टाइमस्टेप पर सही पिच, अवधि और वॉल्यूम का अनुमान लगाता है। यदि अंतिम परिणाम सही नहीं है, तो हम शब्द उच्चारण, विराम और जोर सहित संश्लेषित ऑडियो को ट्यून करने की क्षमता प्रदान करते हैं।

यह देखने के लिए हमारा टेक्स्ट-टू-स्पीच अनुकूलन डेमो वीडियो देखें कि Seasalt के TTS इंजन आउटपुट को यथार्थवादी संश्लेषित भाषण प्रदान करने के लिए कैसे अनुकूलित किया जा सकता है:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/GJCOhTtImp8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

आप हमारी वेबसाइट पर [TTS पेज](https://suite.seasalt.ai/tts) भी देख सकते हैं ताकि हमारे कुछ संश्लेषित आवाजों के उदाहरण सुन सकें, जिनमें टॉम हैंक्स, डेविड एटनबरो और रीज़ विदरस्पून शामिल हैं।

# SeaX में TTS और STT

## वॉयस IVR

<center>
<img src="/images/blog/21-seax-voice-intelligence/flow.png" alt="वास्तविक समय ट्रांसक्रिप्शन और कॉल रूटिंग के लिए Seasalt.ai के स्पीच-टू-टेक्स्ट इंजन का उपयोग करके वॉयस IVR प्रवाह।"/>

*वास्तविक समय ट्रांसक्रिप्शन और कॉल रूटिंग के लिए Seasalt.ai के स्पीच-टू-टेक्स्ट इंजन का उपयोग करके वॉयस IVR प्रवाह।*
</center>

वॉयस इंटेलिजेंस SeaX प्लेटफॉर्म पर कॉल आने से पहले ही मदद करना शुरू कर सकता है, यह सुनिश्चित करके कि कॉल सही जगह पर रूट किए गए हैं और कॉल को एजेंट को सौंपने से पहले महत्वपूर्ण जानकारी एकत्र कर रहे हैं। SeaX कॉल और संदेश रूटिंग प्रवाह को अनुकूलित करने के लिए ट्विलियो स्टूडियो का उपयोग करता है। लेकिन हम अपने स्पीच-टू-टेक्स्ट इंजन को IVR प्रवाह में भी एकीकृत कर सकते हैं ताकि ग्राहक को अपनी कॉल को रूट करने के लिए प्राकृतिक भाषा का उपयोग करने की अनुमति मिल सके (पारंपरिक “1 दबाएं…” अनुभव के बजाय)। इसके अतिरिक्त, यदि आपकी कंपनी ग्राहकों के साथ बातचीत करने के लिए चैटबॉट का उपयोग करने में रुचि रखती है, तो हम अपने टेक्स्ट-टू-स्पीच इंजन का उपयोग करके आपके चैटबॉट को फोन पर ग्राहकों से बात करने के लिए एक आवाज देकर एक कदम आगे बढ़ सकते हैं।

## अनुपलब्ध संदेश

<center>
<img src="/images/blog/21-seax-voice-intelligence/unavailable-message.png" alt="टेक्स्ट-टू-स्पीच का उपयोग करके SeaX अनुपलब्ध संदेश कॉन्फ़िगरेशन।"/>

*टेक्स्ट-टू-स्पीच का उपयोग करके SeaX अनुपलब्ध संदेश कॉन्फ़िगरेशन।*
</center>

हमारी टेक्स्ट-टू-स्पीच तकनीक अत्यधिक अनुकूलन योग्य वॉयस संदेशों की भी अनुमति देती है। उदाहरण के लिए, इन्हें तब ट्रिगर किया जा सकता है जब कोई ग्राहक सामान्य व्यावसायिक घंटों के बाद कॉल करता है, या यदि ग्राहक को उपलब्ध एजेंट की प्रतीक्षा करते समय होल्ड पर रखना पड़ता है।

## लाइव ट्रांसक्रिप्शन

<center>
<img src="/images/blog/21-seax-voice-intelligence/live-transcription.jpg" alt="SeaX पर एजेंट को प्रदर्शित किए जा रहे विश्लेषण के साथ लाइव कॉल ट्रांसक्रिप्शन।"/>

*SeaX पर एजेंट को प्रदर्शित किए जा रहे विश्लेषण के साथ लाइव कॉल ट्रांसक्रिप्शन।*
</center>

एक बार जब कोई ग्राहक किसी एजेंट के साथ कॉल पर होता है, तो हमारा स्पीच-टू-टेक्स्ट इंजन एजेंट के संदर्भ के लिए बातचीत के सटीक वास्तविक समय ट्रांसक्रिप्शन प्रदान करता है। यह एजेंट को बातचीत में पिछले बिंदुओं का संदर्भ लेने और/या ग्राहक ने क्या कहा, इसकी अपनी समझ को दोबारा जांचने की अनुमति देता है। इसके अतिरिक्त, ये ट्रांसक्रिप्शन डाउनस्ट्रीम अनुप्रयोगों जैसे विषय निष्कर्षण, कार्रवाई निष्कर्षण, सारांश, मीटिंग विश्लेषण आदि के लिए अविश्वसनीय रूप से उपयोगी हैं।

## और भी बहुत कुछ...

उपरोक्त कुछ ही तरीके हैं जिनसे SeaX प्रतीक्षा समय को कम करने, एजेंट के प्रदर्शन में सुधार करने और ग्राहकों और एजेंटों दोनों को समग्र रूप से सहज अनुभव प्रदान करने के लिए उन्नत वॉयस इंटेलिजेंस को एकीकृत करता है। SeaX प्लेटफॉर्म के साथ आने वाली अधिक उन्नत सुविधाओं के बारे में जानने के लिए, हमारे अगले ब्लॉग पोस्ट के लिए बने रहें, जिसमें AI ज्ञान आधार, केस प्रबंधन और बल्क एसएमएस शामिल हैं। व्यक्तिगत डेमो प्राप्त करने और यह चर्चा करने के लिए कि SeaX प्लेटफॉर्म आपकी विशिष्ट व्यावसायिक आवश्यकताओं को कैसे पूरा कर सकता है, हमारा [डेमो बुक करें फॉर्म](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) भरें।
`;export{e as default};
