const e=`---
title: "به مرکز تماس خود با SeaX Voice Intelligence صدای خود را بدهید"
metatitle: "اجازه دهید مرکز تماس شما با SeaX Voice Intelligence صحبت کند"
date: 2022-08-02 17:24:00-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Kim Dodds, Cody Kim, Xuchen Yao, Guoguo Chen
description: "در این وبلاگ، ما نشان خواهیم داد که چگونه موتورهای داخلی تبدیل متن به گفتار و گفتار به متن Seasalt.ai می‌توانند جنبه‌های مختلف پلتفرم SeaX را بهبود بخشند."
weight: 1
tags:
  - SeaX
image: /images/blog/21-seax-voice-intelligence/thumbnail.png
canonicalURL: /blog/seax-voice-intelligence/
url: /blog/seax-voice-intelligence/
---

*تاکنون در [سری وبلاگ‌های SeaX](https://seasalt.ai/tags/seax/)، ما یک نمای کلی گسترده از محصول شاخص Seasalt.ai: SeaX را به شما ارائه داده‌ایم. ما همچنین دو ویژگی کلیدی را مورد بحث قرار دادیم که SeaX را از یک مرکز تماس سنتی متمایز می‌کند: اول، SeaX چند کاناله است، به این معنی که شما می‌توانید به راحتی با مشتریان در هر کانالی تعامل داشته باشید، و دوم، این پلتفرم یک مرکز تماس توزیع شده است، که به شما امکان می‌دهد پیام‌ها و تماس‌ها را از مشتریان در سراسر جهان به طور یکپارچه به عوامل توزیع شده خود در مکان‌های مختلف هدایت کنید.*

*اکنون که اصول اولیه پلتفرم SeaX را پوشش دادیم، به ویژگی‌های پیشرفته هوش مصنوعی و اتوماسیون می‌پردازیم که SeaX را از سایر مراکز تماس چند کاناله توزیع شده متمایز می‌کند. در این وبلاگ، ما نشان خواهیم داد که چگونه موتورهای داخلی تبدیل متن به گفتار و گفتار به متن Seasalt.ai می‌توانند جنبه‌های مختلف پلتفرم SeaX را بهبود بخشند.*

# فهرست مطالب
- [مقدمه‌ای بر هوش صوتی](#into-to-voice-intelligence)
- [چه چیزی Seasalt.ai را متمایز می‌کند](#what-sets-seasaltai-apart)
    - [گفتار به متن](#speech-to-text)
    - [متن به گفتار](#text-to-speech)
- [TTS و STT در SeaX](#tts-and-stt-in-seax)
    - [IVR صوتی](#voice-ivr)
    - [پیام عدم دسترسی](#unavailable-message)
    - [رونویسی زنده](#live-transcription)
    - [و بیشتر...](#and-more)

# مقدمه‌ای بر هوش صوتی

هوش صوتی استفاده از هوش مصنوعی برای تجزیه و تحلیل و استخراج بینش از داده‌های مبتنی بر صدا است. در حالی که دهه گذشته شاهد پیشرفت چشمگیری در فناوری‌های صوتی بوده است، استفاده از آنها در محیط‌های سازمانی هنوز تا حدودی محدود است. شرکت‌ها همچنان ترابایت‌ها داده صوتی را جمع‌آوری می‌کنند، اما در بیشتر موارد، از آنها به طور کامل استفاده نمی‌شود.

یکی از دلایل این امر این است که پردازش داده‌های صوتی دشوارتر از سایر اشکال داده‌ها، مانند آمار پایه یا حتی داده‌های متنی ساده است. داده‌های گفتار از بسیاری جهات منحصر به فرد هستند:
1. به زبان وابسته است، با لهجه‌ها و گویش‌ها، بنابراین گرفتن 100٪ اطلاعات دشوار است
2. کیفیت آن بر اساس کانال‌ها (تلفن در مقابل VoIP، مونو در مقابل استریو)، نرخ نمونه‌برداری (8 کیلوهرتز در مقابل 16 کیلوهرتز)، دقت نمایش (8 بیت، 16 بیت، 32 بیت) و صداهای محیطی مانند نویز پس‌زمینه متفاوت است
3. تفسیر آن دشوارتر است: از احساسات گفتار تا شناسایی گوینده تا معنای معنایی

با این حال، هنگامی که با ابزارهای مناسب به درستی مورد استفاده قرار گیرد، هوش صوتی می تواند مزایای زیادی را برای شرکت هایی که از آن استفاده می کنند به ارمغان بیاورد. از جمله، توانایی مدیریت صحیح داده های صوتی، امکان استفاده از رونویسی گفتار به متن شخصی سازی شده را فراهم می کند، که می تواند مکالمات را قابل جستجو، قابل فهرست بندی و روشنگر کند، و امکان پردازش NLP بیشتر را فراهم می کند. با جمع آوری داده های بیشتر، بهبود این خدمات نیز امکان پذیر است، مانند: افزایش دقت رونویسی، افزایش پوشش موارد استفاده، و ارائه مدل های گفتار و زبان قابل تنظیم برای انطباق با زبان ها و گویش های جدید.

# چه چیزی Seasalt.ai را متمایز می‌کند

Seasalt.ai فناوری‌ها و محصولات هوش مصنوعی ارتباطات ابری را به مشتریان سازمانی ارائه می‌دهد.
ما فناوری‌های گفتار و زبان داخلی را برای پیام‌های متنی
و تماس‌های صوتی در مراکز تماس سازمانی توسعه داده‌ایم. موتور زبان طبیعی ما از طیف گسترده‌ای
از زبان‌های پرمنابع و کم‌منابع پشتیبانی می‌کند: برمه‌ای، چینی، انگلیسی، فیلیپینی،
آلمانی، اندونزیایی، خمر، لائوسی، مالایی، اسپانیایی، تامیلی، تایلندی، ویتنامی و غیره.
Seasalt.ai توسط سرمایه‌گذاران خطرپذیر تأمین مالی می‌شود و توسط گروهی از متخصصان برجسته جهان در زمینه تشخیص گفتار عمیق،
سنتز گفتار عصبی و گفتگوهای زبان طبیعی اداره می‌شود.

ویدیوی دمو تبدیل گفتار به متن ما را تماشا کنید:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/Log8usX8ViE" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## گفتار به متن

<center>
<img src="/images/blog/21-seax-voice-intelligence/STT.png" alt="گرافیک گفتار به متن."/>
</center>

موتور گفتار به متن ما صدای گفتار را دریافت کرده و رونویسی‌ها را در زمان واقعی تولید می‌کند. با شروع از صدا، ویژگی‌های آوایی را استخراج می‌کنیم، این ویژگی‌ها را به واج‌ها تبدیل می‌کنیم و سپس این واج‌ها را به املای زبان هدف نگاشت می‌کنیم. سیستم فعلی ما قادر به رونویسی چندین زبان از جمله انگلیسی و چینی است و زبان‌های بیشتری به طور مداوم اضافه می‌شوند.

ویدیوی سفارشی‌سازی گفتار به متن ما را تماشا کنید تا ببینید چگونه موتور STT Seasalt را می‌توان برای هر دامنه‌ای سفارشی کرد:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/1YEU6mexzWQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## متن به گفتار

<center>
<img src="/images/blog/21-seax-voice-intelligence/TTS.png" alt="گرافیک متن به گفتار."/>
</center>

تبدیل متن به گفتار فرآیند سنتز گفتار واقعی انسان با لحن و آهنگ طبیعی تنها از متن است. مدل ما متن معمولی را می‌گیرد، این متن را به واج‌ها ترجمه می‌کند و سپس واج‌ها را به صدا تبدیل می‌کند، در حالی که گام، مدت زمان و حجم مناسب را در هر مرحله زمانی برای واقعی‌ترین تجربه TTS ممکن پیش‌بینی می‌کند. اگر نتیجه نهایی کامل نباشد، ما امکان تنظیم صدای سنتز شده از جمله تلفظ کلمات، مکث‌ها و تأکید را فراهم می‌کنیم.

ویدیوی دمو سفارشی‌سازی تبدیل متن به گفتار ما را تماشا کنید تا ببینید چگونه خروجی موتور TTS Seasalt را می‌توان برای ارائه گفتار سنتز شده واقعی سفارشی کرد:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/GJCOhTtImp8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

همچنین می‌توانید [صفحه TTS](https://suite.seasalt.ai/tts) را در وب‌سایت ما بررسی کنید تا به نمونه‌هایی از برخی از صداهای سنتز شده ما، از جمله تام هنکس، دیوید اتنبرو و ریس ویترسپون گوش دهید.

# TTS و STT در SeaX

## IVR صوتی

<center>
<img src="/images/blog/21-seax-voice-intelligence/flow.png" alt="جریان IVR صوتی با استفاده از موتور گفتار به متن Seasalt.ai برای رونویسی در زمان واقعی و مسیریابی تماس."/>

*جریان IVR صوتی با استفاده از موتور گفتار به متن Seasalt.ai برای رونویسی در زمان واقعی و مسیریابی تماس.*
</center>

هوش صوتی می‌تواند قبل از اینکه تماس‌ها حتی به پلتفرم SeaX برسند، با اطمینان از اینکه تماس‌ها به مکان صحیح هدایت می‌شوند و جمع‌آوری اطلاعات مهم قبل از تحویل تماس به یک عامل، کمک کند. SeaX از Twilio Studio برای سفارشی‌سازی جریان‌های مسیریابی تماس و پیام استفاده می‌کند. اما ما همچنین می‌توانیم موتور گفتار به متن خود را در جریان IVR ادغام کنیم تا به مشتری اجازه دهیم از زبان طبیعی برای مسیریابی تماس خود استفاده کند (به جای تجربه سنتی «برای… 1 را فشار دهید»). علاوه بر این، اگر شرکت شما علاقه‌مند به استفاده از چت‌بات برای تعامل با مشتریان است، می‌توانیم با دادن صدا به چت‌بات شما برای صحبت با مشتریان از طریق تلفن با استفاده از موتور تبدیل متن به گفتار خود، یک قدم فراتر برویم.

## پیام عدم دسترسی

<center>
<img src="/images/blog/21-seax-voice-intelligence/unavailable-message.png" alt="پیکربندی پیام عدم دسترسی SeaX با استفاده از تبدیل متن به گفتار."/>

*پیکربندی پیام عدم دسترسی SeaX با استفاده از تبدیل متن به گفتار.*
</center>

فناوری تبدیل متن به گفتار ما همچنین امکان پیام‌های صوتی بسیار قابل تنظیم را فراهم می‌کند. به عنوان مثال، این پیام‌ها می‌توانند زمانی فعال شوند که مشتری پس از ساعات کاری عادی تماس می‌گیرد، یا اگر مشتری نیاز به انتظار در صف داشته باشد تا یک عامل در دسترس قرار گیرد.

## رونویسی زنده

<center>
<img src="/images/blog/21-seax-voice-intelligence/live-transcription.jpg" alt="رونویسی تماس زنده با تجزیه و تحلیل نمایش داده شده به عامل در SeaX."/>

*رونویسی تماس زنده با تجزیه و تحلیل نمایش داده شده به عامل در SeaX.*
</center>

هنگامی که مشتری با یک عامل در تماس است، موتور گفتار به متن ما رونویسی‌های دقیق و بلادرنگ مکالمه را برای مرجع عامل ارائه می‌دهد. این به عامل اجازه می‌دهد تا به نقاط قبلی در مکالمه مراجعه کند و/یا درک خود را از آنچه مشتری گفته است دوباره بررسی کند. علاوه بر این، این رونویسی‌ها برای برنامه‌های پایین‌دستی مانند استخراج موضوع، استخراج عمل، خلاصه‌سازی، تجزیه و تحلیل جلسه و غیره بسیار مفید هستند.

## و بیشتر...

موارد فوق تنها چند روشی است که SeaX هوش صوتی پیشرفته را برای کاهش زمان انتظار، بهبود عملکرد عامل و ارائه تجربه کلی یکپارچه به مشتریان و عاملان ادغام می‌کند. برای کسب اطلاعات بیشتر در مورد ویژگی‌های پیشرفته‌ای که با پلتفرم SeaX ارائه می‌شوند، منتظر پست‌های وبلاگ بعدی ما باشید که شامل پایگاه دانش هوش مصنوعی، مدیریت پرونده و پیامک انبوه است. برای دریافت یک دمو شخصی و بحث در مورد اینکه چگونه پلتفرم SeaX می‌تواند نیازهای تجاری خاص شما را برطرف کند، [فرم رزرو دمو](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) ما را پر کنید.
`;export{e as default};
