const e=`---
title: "امنح مركز الاتصال الخاص بك صوته الخاص مع SeaX Voice Intelligence"
metatitle: "دع مركز الاتصال الخاص بك يتحدث مع SeaX Voice Intelligence"
date: 2022-08-02 17:24:00-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Kim Dodds, Cody Kim, Xuchen Yao, Guoguo Chen
description: "في هذه المدونة، سنوضح كيف يمكن لمحركات Seasalt.ai الداخلية لتحويل النص إلى كلام والكلام إلى نص أن تعزز جوانب مختلفة من منصة SeaX."
weight: 1
tags:
  - SeaX
image: /images/blog/21-seax-voice-intelligence/thumbnail.png
canonicalURL: /blog/seax-voice-intelligence/
url: /blog/seax-voice-intelligence/
---

*حتى الآن في [سلسلة مدونات SeaX](https://seasalt.ai/tags/seax/)، قدمنا لك نظرة عامة واسعة على المنتج الرائد لـ Seasalt.ai: SeaX. ناقشنا أيضًا ميزتين رئيسيتين تميزان SeaX عن مركز الاتصال التقليدي: أولاً، أن SeaX متعدد القنوات، مما يعني أنه يمكنك التفاعل بسهولة أكبر مع العملاء على أي قناة، وثانيًا، أن المنصة هي مركز اتصال موزع، مما يسمح لك بتوجيه الرسائل والمكالمات من العملاء حول العالم بسلاسة إلى وكلائك الموزعين في مواقع مختلفة.*

*الآن بعد أن غطينا أساسيات منصة SeaX، سننتقل إلى ميزات الذكاء الاصطناعي والأتمتة المتقدمة التي تميز SeaX عن مراكز الاتصال متعددة القنوات الموزعة الأخرى. في هذه المدونة، سنوضح كيف يمكن لمحركات Seasalt.ai الداخلية لتحويل النص إلى كلام والكلام إلى نص أن تعزز جوانب مختلفة من منصة SeaX.*

# جدول المحتويات
- [مقدمة إلى الذكاء الصوتي](#into-to-voice-intelligence)
- [ما يميز Seasalt.ai](#what-sets-seasaltai-apart)
    - [الكلام إلى نص](#speech-to-text)
    - [النص إلى كلام](#text-to-speech)
- [TTS و STT في SeaX](#tts-and-stt-in-seax)
    - [IVR الصوتي](#voice-ivr)
    - [رسالة عدم التوفر](#unavailable-message)
    - [النسخ المباشر](#live-transcription)
    - [والمزيد...](#and-more)

# مقدمة إلى الذكاء الصوتي

الذكاء الصوتي هو استخدام الذكاء الاصطناعي لتحليل واستخلاص الرؤى من البيانات الصوتية. بينما شهد العقد الماضي تطورًا ملحوظًا في تقنيات الصوت، لا يزال استخدامها في بيئات الشركات محدودًا إلى حد ما. تستمر الشركات في تجميع تيرابايت من البيانات الصوتية، ولكن في معظم الحالات، لا يتم استخدامها بكامل إمكاناتها.

أحد أسباب ذلك هو أن البيانات الصوتية أصعب في المعالجة من أشكال البيانات الأخرى، مثل الإحصائيات الأساسية أو حتى بيانات النص العادي. بيانات الكلام فريدة من نوعها بطرق مختلفة:
1. إنها تعتمد على اللغة، مع لهجات ولهجات، لذلك من الصعب التقاط 100٪ من المعلومات
2. تختلف جودتها حسب القنوات (الهاتف مقابل VoIP، أحادي مقابل ستريو)، ومعدل أخذ العينات (8 كيلو هرتز مقابل 16 كيلو هرتز)، ودقة التمثيل (8 بت، 16 بت، 32 بت) والأصوات البيئية مثل ضوضاء الخلفية
3. يصعب تفسيرها: من عواطف الكلام إلى تحديد المتحدث إلى دلالات المعنى

ومع ذلك، عند التعامل معها بشكل صحيح باستخدام الأدوات المناسبة، يمكن أن يوفر الذكاء الصوتي فوائد هائلة للشركات التي تستخدمه. من بين أمور أخرى، تتيح القدرة على إدارة البيانات الصوتية بشكل صحيح إمكانية استخدام نسخ الكلام إلى نص المخصص، مما يجعل المحادثات قابلة للبحث والفهرسة وذات رؤى، ويسمح بمعالجة NLP إضافية. مع جمع المزيد من البيانات، يمكن أيضًا إجراء تحسينات على هذه الخدمات، مثل: زيادة دقة النسخ، وزيادة تغطية حالات الاستخدام، وتوفير نماذج كلام ولغة قابلة للتخصيص للتكيف مع اللغات واللهجات الجديدة.

# ما يميز Seasalt.ai

توفر Seasalt.ai تقنيات ومنتجات الذكاء الاصطناعي للاتصالات السحابية لعملاء الشركات.
لقد قمنا بتطوير تقنيات الكلام واللغة الداخلية للرسائل النصية
والمكالمات الصوتية في مراكز الاتصال الخاصة بالشركات. يدعم محركنا للغة الطبيعية مجموعة واسعة
من اللغات عالية الموارد ومنخفضة الموارد: البورمية، الصينية، الإنجليزية، الفلبينية،
الألمانية، الإندونيسية، الخميرية، اللاوية، الماليزية، الإسبانية، التاميلية، التايلاندية، الفيتنامية، إلخ.
تمول Seasalt.ai من قبل رؤوس الأموال وتديرها مجموعة من الخبراء الرائدين عالميًا في التعرف العميق على الكلام،
توليف الكلام العصبي، وحوارات اللغة الطبيعية.

شاهد فيديو عرض الكلام إلى نص الخاص بنا:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/Log8usX8ViE" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## الكلام إلى نص

<center>
<img src="/images/blog/21-seax-voice-intelligence/STT.png" alt="رسم بياني للكلام إلى نص."/>
</center>

يأخذ محركنا لتحويل الكلام إلى نص الصوت الكلامي وينتج نصوصًا في الوقت الفعلي. بدءًا من الصوت، نستخرج الميزات الصوتية، ونحول هذه الميزات إلى فونيمات، ثم نربط هذه الفونيمات بالتهجئة للغة الهدف. نظامنا الحالي قادر على نسخ عدة لغات، بما في ذلك الإنجليزية والصينية، مع إضافة المزيد من اللغات باستمرار.

شاهد فيديو تخصيص الكلام إلى نص الخاص بنا لترى كيف يمكن تخصيص محرك STT الخاص بـ Seasalt لأي مجال:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/1YEU6mexzWQ" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## النص إلى كلام

<center>
<img src="/images/blog/21-seax-voice-intelligence/TTS.png" alt="رسم بياني للنص إلى كلام."/>
</center>

تحويل النص إلى كلام هو عملية توليف كلام بشري واقعي مع نبرة طبيعية وإيقاع من النص فقط. يأخذ نموذجنا النص العادي، ويترجم هذا النص إلى فونيمات ثم يحول الفونيمات إلى صوت مع التنبؤ بالدرجة الصحيحة والمدة والحجم في كل خطوة زمنية للحصول على تجربة TTS الأكثر واقعية ممكنة. إذا لم تكن النتيجة النهائية مثالية، فإننا نوفر القدرة على ضبط الصوت المركب بما في ذلك نطق الكلمات والتوقفات والتركيز.

شاهد فيديو عرض تخصيص تحويل النص إلى كلام الخاص بنا لترى كيف يمكن تخصيص إخراج محرك TTS الخاص بـ Seasalt لتوفير كلام مركب نابض بالحياة:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/GJCOhTtImp8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

يمكنك أيضًا التحقق من [صفحة TTS](https://suite.seasalt.ai/tts) على موقعنا للاستماع إلى أمثلة لبعض أصواتنا المركبة، بما في ذلك توم هانكس وديفيد أتينبورو وريس ويذرسبون.

# TTS و STT في SeaX

## IVR الصوتي

<center>
<img src="/images/blog/21-seax-voice-intelligence/flow.png" alt="تدفق IVR الصوتي باستخدام محرك تحويل الكلام إلى نص من Seasalt.ai للنسخ في الوقت الفعلي وتوجيه المكالمات."/>

*تدفق IVR الصوتي باستخدام محرك تحويل الكلام إلى نص من Seasalt.ai للنسخ في الوقت الفعلي وتوجيه المكالمات.*
</center>

يمكن أن يبدأ الذكاء الصوتي في المساعدة قبل أن تظهر المكالمات على منصة SeaX من خلال التأكد من توجيه المكالمات إلى المكان الصحيح وجمع المعلومات المهمة قبل تسليم المكالمة إلى وكيل. يستخدم SeaX Twilio Studio لتخصيص تدفقات توجيه المكالمات والرسائل. ولكن يمكننا أيضًا دمج محرك تحويل الكلام إلى نص الخاص بنا في تدفق IVR للسماح للعميل باستخدام اللغة الطبيعية لتوجيه مكالمته (بدلاً من التجربة التقليدية "اضغط 1 لـ..."). بالإضافة إلى ذلك، إذا كانت شركتك مهتمة باستخدام روبوت محادثة للتفاعل مع العملاء، فيمكننا المضي قدمًا خطوة أخرى من خلال منح روبوت المحادثة الخاص بك صوتًا للتحدث مع العملاء عبر الهاتف باستخدام محرك تحويل النص إلى كلام الخاص بنا.

## رسالة عدم التوفر

<center>
<img src="/images/blog/21-seax-voice-intelligence/unavailable-message.png" alt="تكوين رسالة عدم توفر SeaX باستخدام تحويل النص إلى كلام."/>

*تكوين رسالة عدم توفر SeaX باستخدام تحويل النص إلى كلام.*
</center>

تتيح تقنية تحويل النص إلى كلام لدينا أيضًا رسائل صوتية قابلة للتخصيص بدرجة كبيرة. على سبيل المثال، يمكن تشغيلها عندما يتصل عميل بعد ساعات العمل العادية، أو إذا كان العميل بحاجة إلى الانتظار أثناء انتظار وكيل متاح.

## النسخ المباشر

<center>
<img src="/images/blog/21-seax-voice-intelligence/live-transcription.jpg" alt="نسخ المكالمات المباشرة مع عرض التحليلات للوكيل على SeaX."/>

*نسخ المكالمات المباشرة مع عرض التحليلات للوكيل على SeaX.*
</center>

بمجرد أن يكون العميل في مكالمة مع وكيل، يوفر محركنا لتحويل الكلام إلى نص نسخًا دقيقة في الوقت الفعلي للمحادثة لمرجع الوكيل. يتيح ذلك للوكيل الرجوع إلى النقاط السابقة في المحادثة و/أو التحقق مرة أخرى من فهمه لما قاله العميل. بالإضافة إلى ذلك، فإن هذه النسخ مفيدة بشكل لا يصدق للتطبيقات النهائية مثل استخراج الموضوع، واستخراج الإجراءات، والتلخيص، وتحليلات الاجتماعات، وما إلى ذلك.

## والمزيد...

ما ورد أعلاه هو مجرد عدد قليل من الطرق التي يدمج بها SeaX الذكاء الصوتي المتقدم لتقليل أوقات الانتظار، وتحسين أداء الوكيل، ومنح العملاء والوكلاء على حد سواء تجربة سلسة بشكل عام. لمعرفة المزيد حول الميزات المتقدمة التي تأتي مع منصة SeaX، ترقبوا منشورات مدونتنا التالية، والتي تتضمن قاعدة معارف الذكاء الاصطناعي، وإدارة الحالات، والرسائل النصية القصيرة المجمعة. للحصول على عرض توضيحي شخصي ومناقشة كيف يمكن لمنصة SeaX تلبية احتياجات عملك المحددة، املأ [نموذج حجز عرض توضيحي](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) الخاص بنا.
`;export{e as default};
