const e=`---
title: "SeaX KB: قاعدة معرفة تجيب على أسئلتك قبل أن تطرحها"
metatitle: "SeaX KB: قاعدة معرفة تجيب على أسئلتك قبل أن تطرحها"
date: 2022-08-15 22:01:32-07:00
modified_date: 2025-07-30 17:01:01.555000+00:00
draft: false
author: Kim Dodds
description: "في هذا المقال، سنواصل موضوع تكامل الذكاء الاصطناعي من خلال تقديم قاعدة المعرفة المدعومة بالذكاء الاصطناعي في SeaX، والتي تقدم ردودًا مقترحة في الوقت الفعلي."
weight: 1
tags:
  - SeaX
canonicalURL: /blog/seax-kb-a-knowledge-base/
url: /blog/seax-kb-a-knowledge-base/
---

*في منشور مدونتنا السابق [امنح مركز الاتصال الخاص بك صوته الخاص مع ذكاء الصوت SeaX](https://seasalt.ai/blog/21-seax-voice-intelligence/)، عرضنا كيف تعزز محركات تحويل النص إلى كلام والكلام إلى نص الداخلية في Seasalt.ai جوانب مختلفة من منصة SeaX. في هذا المقال، سنواصل موضوع تكامل الذكاء الاصطناعي من خلال تقديم قاعدة المعرفة المدعومة بالذكاء الاصطناعي في SeaX، والتي تستمع إلى المحادثات في الوقت الفعلي لتقديم ردود مقترحة.*

# جدول المحتويات
- [قاعدة المعرفة التقليدية](#the-traditional-knowledge-base)
- [قاعدة المعرفة SeaX](#seax-knowledge-base)
    - [واجهة مستخدم مضمنة للوكلاء المباشرين](#embedded-user-interface-for-live-agents)
    - [بحث سريع ودقيق](#fast-and-accurate-search)
    - [اقتراحات آلية في الوقت الفعلي](#real-time-automated-suggestions)
    - [قوالب الردود](#response-templates)
    - [إدارة قاعدة المعرفة](#kb-management)
    - [ندوة عبر الإنترنت](#webinar)

# قاعدة المعرفة التقليدية

في جوهرها، قاعدة المعرفة (KB) هي مجرد مجموعة من المعلومات (من الناحية المثالية) منظمة جيدًا ويمكن الوصول إليها بسهولة للاستخدام الذاتي عبر الإنترنت. سيحتوي نظام قاعدة المعرفة الجيد على ميزات مثل تنظيم المحتوى الهرمي والبحث ووضع العلامات لمساعدة المستخدمين في العثور على المعلومات الصحيحة بسهولة أكبر.

يعد الحفاظ على قاعدة معرفة مفصلة ممارسة قياسية لمعظم الشركات في الوقت الحاضر. سواء كان الغرض هو مساعدة الموظفين على مشاركة المعلومات الداخلية حول منتجاتهم، أو الإجابة على أسئلة العملاء المحتملين، أو مساعدة العملاء في استكشاف المشكلات وإصلاحها، أو كل ما سبق - فإن إتاحة المعلومات الهامة للموظفين والعملاء على حد سواء يعني عملاً أكثر كفاءة ورضا عملاء أعلى.

عادةً ما يتم تنفيذ وصيانة قواعد المعرفة من خلال نظام إدارة المحتوى أو نظام إدارة المعرفة. يمكن أن تختلف هذه الأنظمة في الحجم حسب احتياجات المؤسسة، من مديري المستندات البسيطين إلى الخدمات الغنية بالميزات التي تشمل مهام سير عمل النشر واستهداف الجمهور وأدوات التعاون والمزيد. في حين أن هذه الأنظمة متعددة الاستخدامات في جوانب مختلفة، إلا أنها مصممة دائمًا تقريبًا للوصول إليها من خلال التفاعل مع صفحة ويب أو تطبيق. بالنسبة لحالة الاستخدام المحددة لوكلاء خدمة العملاء (الذين غالبًا ما يستخدمون قواعد المعرفة كأحد مواردهم الأساسية لمساعدة العملاء)، يلزم تكامل وثيق مع برنامج مركز الاتصال لتمكين الوكلاء من التعامل مع استفسارات المستخدمين بسلاسة قدر الإمكان.

# قاعدة المعرفة SeaX

تم تصميم قاعدة المعرفة الخاصة بنا منذ اليوم الأول مع وضع حالة استخدام محددة للغاية في الاعتبار: خدمة العملاء الصوتية. في حين أن معظم أنظمة قواعد المعرفة الحالية، إن لم يكن كلها، تعتمد على التنقل عبر صفحات الويب الهرمية أو كتابة استعلامات البحث، كان يجب أن تكون قاعدة المعرفة الخاصة بنا أسرع وأكثر استقلالية حتى يتمكن ممثلو خدمة العملاء من تركيز انتباههم الكامل على العميل مع الاستمرار في الإجابة على الأسئلة بسرعة.

إذا كنت ترغب في الانتقال مباشرة إلى العرض التوضيحي، يمكنك مشاهدة عرضنا التوضيحي القصير لـ SeaX KB:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/C_e_gaZHSFA" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>


## واجهة مستخدم مضمنة للوكلاء المباشرين

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-intro.png" alt="نظرة أولى على واجهة قاعدة المعرفة SeaX."/>

*نظرة أولى على واجهة قاعدة المعرفة SeaX.*
</center>

بطبيعة الحال، نظرًا لأن محرك قاعدة المعرفة الخاص بنا مصمم خصيصًا لتطبيقات مركز الاتصال، فهو مدمج أصلاً في منصة SeaX بحيث يمكن للوكلاء الوصول بسلاسة إلى قاعدة المعرفة أثناء التعامل مع المكالمات والرسائل. لا حاجة لتبديل النوافذ، ولا حاجة للتنقل بين علامات التبويب، ولا حاجة للتنقل في صفحات الويب المتداخلة.

## بحث سريع ودقيق

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-manual-search.png" alt="نتائج البحث اليدوي في قاعدة المعرفة SeaX."/>

*نتائج البحث اليدوي في قاعدة المعرفة SeaX.*
</center>

على المستوى الأساسي، يتم تشغيل قاعدة المعرفة الخاصة بنا بواسطة محرك بحث سريع ودقيق للغاية. نحن نستخدم أحدث تقنيات معالجة اللغة الطبيعية واستخراج المعلومات لجمع المعنى من النصوص العادية واستعلامات الأمثلة وعناوين URL الداعمة ومطابقة أقوال العملاء مع إدخالات قاعدة المعرفة الأكثر صلة. محرك قاعدة المعرفة قابل للتطوير بدرجة كبيرة ويمكنه دعم مليارات المستندات دون أي تغيير ملحوظ في وقت الاستجابة.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-detail.png" alt="مقالة قاعدة المعرفة في عرض موسع بعد النقر على نتيجة البحث."/>

*مقالة قاعدة المعرفة في عرض موسع بعد النقر على نتيجة البحث.*
</center>

بالإضافة إلى العثور على المستندات الأكثر صلة، يوفر محرك البحث الخاص بنا أيضًا نتائج أكثر دقة عن طريق استخراج الكلمات الرئيسية البارزة من استعلام المستخدم وتمييز الكلمات الرئيسية والمقاطع الأكثر صلة في كل إدخال مقترح في قاعدة المعرفة.

## اقتراحات آلية في الوقت الفعلي

ولكن ما عرضناه حتى الآن لا يزال بحثًا يدويًا. ينشغل الوكلاء المباشرون بالتفاعل مع العملاء، وكتابة عمليات البحث يدويًا في قاعدة المعرفة في كل مرة يحتاجون فيها إلى معلومات يهدر وقتًا ثمينًا. لذلك، فإن أكبر قيمة مضافة تأتي مع قاعدة المعرفة SeaX هي البحث الآلي في الوقت الفعلي لكل من التفاعلات النصية والصوتية.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-automatic-search.png" alt="تعرض قاعدة المعرفة SeaX اقتراحات تلقائية للمقالات لرسالة مستخدم واردة."/>

*تعرض قاعدة المعرفة SeaX اقتراحات تلقائية للمقالات لرسالة مستخدم واردة.*
</center>

في كل مرة تصل رسالة مستخدم جديدة، تستعلم قاعدة المعرفة تلقائيًا باستخدام رسالة العميل الدقيقة. في الوقت الفعلي، بينما يتحدث العميل، سيتم تزويد الوكلاء باقتراحات محدثة لمقالات قاعدة المعرفة للرجوع إليها.

وهذا يعمل أيضًا مع المكالمات الصوتية! عرض منشور مدونتنا السابق [امنح مركز الاتصال الخاص بك صوته الخاص مع ذكاء الصوت SeaX](https://seasalt.ai/blog/21-seax-voice-intelligence/) محرك تحويل الكلام إلى نص المتطور من Seasalt.ai. تستفيد منصة SeaX من هذا المحرك لنسخ جميع المكالمات الصوتية في الوقت الفعلي. ونتيجة لذلك، يمكننا استخدام هذه النصوص لمجموعة متنوعة من التطبيقات النهائية، بما في ذلك البحث التلقائي في قاعدة المعرفة.

## قوالب الردود

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-response-template.png" alt="وكيل يرد على عميل بنقرة واحدة باستخدام قالب رد تم إنشاؤه بواسطة قاعدة المعرفة SeaX."/>

*وكيل يرد على عميل بنقرة واحدة باستخدام قالب رد تم إنشاؤه بواسطة قاعدة المعرفة SeaX.*
</center>

تأتي نتائج بحث قاعدة المعرفة مع ميزة إضافية للمساعدة في تسريع استجابات الوكلاء للتفاعلات النصية. عندما يجد الوكيل مقالة قاعدة معرفة ذات صلة، يمكنه ببساطة النقر على أيقونة "+" على يسار العنوان لإدراج قالب رد في نافذة الدردشة الخاصة به. في الخلفية، في كل مرة يتم فيها البحث في قاعدة المعرفة، تقوم بإنشاء رد مكتوب على سؤال المستخدم بناءً على المعلومات الأكثر صلة من مقالات قاعدة المعرفة المقترحة وتتضمن أي روابط داعمة. يمكن أن يؤدي ذلك إلى تحسين أوقات استجابة الوكلاء بشكل كبير حيث لم يعد الوكلاء يبدأون من الصفر. بدلاً من ذلك، لديهم بالفعل المعلومات الهامة من مقالة قاعدة المعرفة معروضة في نافذة الدردشة الخاصة بهم، لذلك كل ما عليهم فعله هو التعديل والإرسال.


## إدارة قاعدة المعرفة

الآن بعد أن رأينا ما يمكن لمحرك قاعدة المعرفة القيام به، هناك سؤال واحد معلق حول الواجهة الخلفية: كيف تتم إدارة المعلومات في قاعدة المعرفة؟ توفر منصة SeaX واجهة مستخدم لإدارة قاعدة المعرفة متكاملة تمامًا يمكن للمسؤولين الوصول إليها من صفحة الإعدادات.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-management.png" alt="واجهة إدارة قاعدة المعرفة SeaX."/>

*واجهة إدارة قاعدة المعرفة SeaX.*
</center>

في هذه الصفحة، يمكنك إضافة إدخالات قاعدة معرفة جديدة فردية، أو يمكنك استيراد/تصدير قاعدة المعرفة بأكملها باستخدام ملف جدول بيانات. تدعم الواجهة أيضًا تحرير وحذف إدخالات قاعدة المعرفة حتى تتمكن من الحفاظ على تحديث قاعدة المعرفة الخاصة بك باستمرار.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-edit.png" alt="تحرير مقالة قاعدة معرفة فردية من خلال واجهة إدارة قاعدة المعرفة SeaX."/>

*تحرير مقالة قاعدة معرفة فردية من خلال واجهة إدارة قاعدة المعرفة SeaX.*
</center>

## ندوة عبر الإنترنت

إذا كنت ترغب في إلقاء نظرة أكثر تعمقًا على نظام قاعدة المعرفة وكيفية تكامله مع منصة SeaX، فشاهد ندوتنا عبر الإنترنت حول هذا الموضوع:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/FOqQ01fpKQ4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

للحصول على عرض توضيحي فردي، أو لمعرفة كيف يمكن لـ Seasalt.ai تخصيص حل لاحتياجات عملك، يرجى ملء [نموذج جدولة العرض التوضيحي](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting).`;export{e as default};
