const e=`---
title: "SeaX KB: एक नॉलेज बेस जो पूछने से पहले जवाब देता है"
metatitle: "SeaX KB: एक नॉलेज बेस जो पूछने से पहले जवाब देता है"
date: 2022-08-15 22:01:32-07:00
modified_date: 2025-07-30 17:01:18.700000+00:00
draft: false
author: Kim Dodds
description: "इस लेख में, हम SeaX के AI-संचालित नॉलेज बेस को पेश करके AI एकीकरण के विषय को जारी रखते हैं, जो वास्तविक समय में सुझाए गए उत्तर प्रदान करता है।"
weight: 1
tags:
  - SeaX
canonicalURL: /blog/seax-kb-a-knowledge-base/
url: /blog/seax-kb-a-knowledge-base/
---

*हमारे पिछले ब्लॉग पोस्ट में [Give Your Contact Center Its Own Voice with SeaX Voice Intelligence](https://seasalt.ai/blog/21-seax-voice-intelligence/), हमने दिखाया कि कैसे Seasalt.ai के इन-हाउस टेक्स्ट-टू-स्पीच और स्पीच-टू-टेक्स्ट इंजन SeaX प्लेटफॉर्म के विभिन्न पहलुओं को बढ़ाते हैं। इस लेख में, हम SeaX के AI-संचालित नॉलेज बेस को पेश करके AI एकीकरण के विषय को जारी रखेंगे, जो सुझाए गए उत्तर प्रदान करने के लिए वास्तविक समय में बातचीत सुनता है।*

# विषय-सूची
- [पारंपरिक नॉलेज बेस](#the-traditional-knowledge-base)
- [SeaX नॉलेज बेस](#seax-knowledge-base)
    - [लाइव एजेंटों के लिए एंबेडेड यूजर इंटरफेस](#embedded-user-interface-for-live-agents)
    - [तेज और सटीक खोज](#fast-and-accurate-search)
    - [वास्तविक समय स्वचालित सुझाव](#real-time-automated-suggestions)
    - [प्रतिक्रिया टेम्पलेट्स](#response-templates)
    - [KB प्रबंधन](#kb-management)
    - [वेबिनार](#webinar)

# पारंपरिक नॉलेज बेस

इसके मूल में, एक नॉलेज बेस (KB) ऑनलाइन स्वयं-सेवा के लिए जानकारी का एक (आदर्श रूप से) सुव्यवस्थित और आसानी से सुलभ संग्रह है। एक अच्छे KB सिस्टम में पदानुक्रमित सामग्री संगठन, खोज और टैगिंग जैसी सुविधाएँ होंगी ताकि उपयोगकर्ताओं को सही जानकारी आसानी से मिल सके।

आजकल अधिकांश कंपनियों के लिए एक विस्तृत नॉलेज बेस बनाए रखना मानक अभ्यास है। चाहे इसका उद्देश्य कर्मचारियों को उनके उत्पादों के बारे में आंतरिक जानकारी साझा करने में मदद करना हो, भावी ग्राहकों के सवालों का जवाब देना हो, ग्राहकों को समस्या निवारण में सहायता करना हो, या उपरोक्त सभी - कर्मचारियों और ग्राहकों के लिए समान रूप से महत्वपूर्ण जानकारी सुलभ बनाने का अर्थ है अधिक कुशल कार्य और उच्च ग्राहक संतुष्टि।

आमतौर पर, नॉलेज बेस को एक सामग्री प्रबंधन प्रणाली या ज्ञान प्रबंधन प्रणाली के माध्यम से कार्यान्वित और बनाए रखा जाता है। ये सिस्टम किसी संगठन की जरूरतों के आधार पर पैमाने में भिन्न हो सकते हैं, साधारण दस्तावेज़ प्रबंधकों से लेकर प्रकाशन वर्कफ़्लो, ऑडियंस टारगेटिंग, सहयोग उपकरण और बहुत कुछ शामिल करने वाली सुविधा संपन्न सेवाओं तक। जबकि ये सिस्टम विभिन्न पहलुओं में बहुमुखी हैं, वे लगभग हमेशा एक वेबपेज या एप्लिकेशन के साथ बातचीत के माध्यम से एक्सेस किए जाने के लिए डिज़ाइन किए गए हैं। ग्राहक सेवा एजेंटों के विशिष्ट उपयोग के मामले के लिए (जो अक्सर ग्राहकों की सहायता के लिए अपने प्राथमिक संसाधनों में से एक के रूप में नॉलेज बेस का उपयोग करते हैं), संपर्क केंद्र सॉफ्टवेयर के साथ तंग एकीकरण की आवश्यकता होती है ताकि एजेंट उपयोगकर्ता प्रश्नों को यथासंभव सहज रूप से संभाल सकें।

# SeaX नॉलेज बेस

हमारा नॉलेज बेस पहले दिन से ही एक बहुत ही विशिष्ट उपयोग के मामले को ध्यान में रखकर बनाया गया था: आवाज-आधारित ग्राहक सेवा। जबकि अधिकांश, यदि सभी नहीं, तो मौजूदा नॉलेज बेस सिस्टम पदानुक्रमित वेबपेजों के माध्यम से नेविगेट करने या खोज प्रश्नों में टाइप करने पर भरोसा करते हैं, हमारे नॉलेज बेस को तेज और अधिक स्वायत्त होने की आवश्यकता थी ताकि ग्राहक सेवा प्रतिनिधि ग्राहक पर अपना पूरा ध्यान दे सकें और फिर भी सवालों का जल्दी से जवाब दे सकें।

यदि आप सीधे डेमो पर जाना चाहते हैं, तो आप हमारा छोटा SeaX KB डेमो देख सकते हैं:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/C_e_gaZHSFA" title="YouTube वीडियो प्लेयर" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>


## लाइव एजेंटों के लिए एंबेडेड यूजर इंटरफेस

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-intro.png" alt="SeaX नॉलेज बेस इंटरफ़ेस पर पहली नज़र।"/>

*SeaX नॉलेज बेस इंटरफ़ेस पर पहली नज़र।*
</center>

स्वाभाविक रूप से, चूंकि हमारा नॉलेज बेस इंजन विशेष रूप से संपर्क केंद्र अनुप्रयोगों के लिए डिज़ाइन किया गया था, इसलिए यह SeaX प्लेटफॉर्म में मूल रूप से एकीकृत है ताकि एजेंट कॉल और संदेशों को संभालते समय नॉलेज बेस तक निर्बाध रूप से पहुंच सकें। कोई विंडो स्विचिंग नहीं, कोई टैब के माध्यम से गड़बड़ी नहीं, कोई नेस्टेड वेबपेज नेविगेट नहीं करना।

## तेज और सटीक खोज

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-manual-search.png" alt="SeaX नॉलेज बेस में मैन्युअल खोज के परिणाम।"/>

*SeaX नॉलेज बेस में मैन्युअल खोज के परिणाम।*
</center>

सबसे बुनियादी स्तर पर, हमारा नॉलेज बेस एक अत्यंत तेज और सटीक खोज इंजन द्वारा संचालित है। हम कच्चे पाठ, उदाहरण प्रश्नों और सहायक URL से अर्थ निकालने और ग्राहकों के कथनों को सबसे प्रासंगिक नॉलेज बेस प्रविष्टियों से मिलाने के लिए अत्याधुनिक प्राकृतिक भाषा प्रसंस्करण और सूचना निष्कर्षण तकनीकों का उपयोग करते हैं। नॉलेज बेस इंजन अत्यधिक स्केलेबल है और प्रतिक्रिया समय में किसी भी बोधगम्य परिवर्तन के बिना अरबों दस्तावेजों का समर्थन कर सकता है।

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-detail.png" alt="खोज परिणाम पर क्लिक करने के बाद एक विस्तारित दृश्य में एक नॉलेज बेस लेख।"/>

*खोज परिणाम पर क्लिक करने के बाद एक विस्तारित दृश्य में एक नॉलेज बेस लेख।*
</center>

सबसे प्रासंगिक दस्तावेजों को खोजने के अलावा, हमारा खोज इंजन उपयोगकर्ता के प्रश्न से मुख्य खोजशब्दों को निकालकर और प्रत्येक सुझाए गए नॉलेज बेस प्रविष्टि में सबसे प्रासंगिक खोजशब्दों और अंशों को हाइलाइट करके अधिक बारीक परिणाम भी प्रदान करता है।

## वास्तविक समय स्वचालित सुझाव

लेकिन जो हमने अब तक दिखाया है वह अभी भी एक मैन्युअल खोज है। लाइव एजेंट ग्राहकों के साथ बातचीत करने में व्यस्त हैं, और हर बार जब उन्हें जानकारी की आवश्यकता होती है तो नॉलेज बेस में मैन्युअल रूप से खोज टाइप करने से कीमती समय बर्बाद होता है। इसलिए, SeaX नॉलेज बेस के साथ आने वाला सबसे बड़ा मूल्य-वर्धन पाठ और आवाज-आधारित दोनों इंटरैक्शन के लिए वास्तविक समय की स्वचालित खोज है।

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-automatic-search.png" alt="SeaX नॉलेज बेस एक आने वाले उपयोगकर्ता संदेश के लिए स्वचालित लेख सुझाव दिखा रहा है।"/>

*SeaX नॉलेज बेस एक आने वाले उपयोगकर्ता संदेश के लिए स्वचालित लेख सुझाव दिखा रहा है।*
</center>

हर बार जब कोई नया उपयोगकर्ता संदेश आता है, तो नॉलेज बेस स्वचालित रूप से ग्राहक के सटीक संदेश के साथ क्वेरी करता है। वास्तविक समय में, जैसे ही ग्राहक बोल रहा होता है, एजेंटों को उनके संदर्भ के लिए अद्यतित नॉलेज बेस लेख सुझाव प्रदान किए जाएंगे।

यह वॉयस कॉल के लिए भी काम करता है! हमारे पिछले ब्लॉग पोस्ट [Give Your Contact Center Its Own Voice with SeaX Voice Intelligence](https://seasalt.ai/blog/21-seax-voice-intelligence/) ने Seasalt.ai के अत्याधुनिक स्पीच-टू-टेक्स्ट इंजन का प्रदर्शन किया। SeaX प्लेटफॉर्म वास्तविक समय में सभी वॉयस कॉल को ट्रांसक्राइब करने के लिए इस इंजन का लाभ उठाता है। नतीजतन, हम इन ट्रांसक्रिप्शन का उपयोग स्वचालित नॉलेज बेस खोज सहित विभिन्न प्रकार के डाउनस्ट्रीम अनुप्रयोगों के लिए कर सकते हैं।

## प्रतिक्रिया टेम्पलेट्स

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-response-template.png" alt="एक एजेंट SeaX नॉलेज बेस द्वारा उत्पन्न प्रतिक्रिया टेम्पलेट के साथ एक क्लिक में ग्राहक को जवाब दे रहा है।"/>

*एक एजेंट SeaX नॉलेज बेस द्वारा उत्पन्न प्रतिक्रिया टेम्पलेट के साथ एक क्लिक में ग्राहक को जवाब दे रहा है।*
</center>

नॉलेज बेस खोज परिणाम पाठ-आधारित इंटरैक्शन के लिए एजेंटों की जवाबदेही को तेज करने में मदद करने के लिए एक अतिरिक्त सुविधा के साथ आते हैं। जब किसी एजेंट को कोई प्रासंगिक नॉलेज बेस लेख मिलता है, तो वे अपनी चैट विंडो में प्रतिक्रिया टेम्पलेट डालने के लिए शीर्षक के बाईं ओर "+" आइकन पर क्लिक कर सकते हैं। बैकएंड पर, हर बार जब नॉलेज बेस खोजा जाता है, तो यह सुझाए गए नॉलेज बेस लेखों से सबसे प्रासंगिक जानकारी के आधार पर उपयोगकर्ता के प्रश्न का लिखित उत्तर उत्पन्न करता है और इसमें कोई भी सहायक लिंक शामिल होता है। यह एजेंटों के प्रतिक्रिया समय में नाटकीय रूप से सुधार कर सकता है क्योंकि एजेंट अब खरोंच से शुरू नहीं कर रहे हैं। इसके बजाय, उनके पास पहले से ही नॉलेज बेस लेख से महत्वपूर्ण जानकारी उनकी चैट विंडो में प्रदर्शित होती है, इसलिए उन्हें बस इतना करना है कि संपादित करें और भेजें।


## KB प्रबंधन

अब जब हमने देख लिया है कि नॉलेज बेस इंजन क्या कर सकता है, तो बैकएंड के बारे में एक सवाल बना रहता है: नॉलेज बेस में जानकारी का प्रबंधन कैसे किया जाता है? SeaX प्लेटफॉर्म एक पूरी तरह से एकीकृत नॉलेज बेस प्रबंधन UI प्रदान करता है जिसे प्रशासक सेटिंग्स पृष्ठ से एक्सेस कर सकते हैं।

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-management.png" alt="SeaX नॉलेज बेस प्रबंधन इंटरफ़ेस।"/>

*SeaX नॉलेज बेस प्रबंधन इंटरफ़ेस।*
</center>

इस पृष्ठ पर, आप अलग-अलग नई नॉलेज बेस प्रविष्टियाँ जोड़ सकते हैं, या आप स्प्रेडशीट फ़ाइल का उपयोग करके संपूर्ण नॉलेज बेस को आयात/निर्यात कर सकते हैं। इंटरफ़ेस नॉलेज बेस प्रविष्टियों को संपादित करने और हटाने का भी समर्थन करता है ताकि आप अपने नॉलेज बेस को लगातार अद्यतित रख सकें।

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-edit.png" alt="SeaX नॉलेज बेस प्रबंधन इंटरफ़ेस के माध्यम से एक एकल नॉलेज बेस लेख का संपादन।"/>

*SeaX नॉलेज बेस प्रबंधन इंटरफ़ेस के माध्यम से एक एकल नॉलेज बेस लेख का संपादन।*
</center>

## वेबिनार

यदि आप नॉलेज बेस सिस्टम और यह SeaX प्लेटफॉर्म के साथ कैसे एकीकृत होता है, इस पर अधिक गहराई से विचार करना चाहते हैं, तो इस विषय पर हमारा वेबिनार देखें:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/FOqQ01fpKQ4" title="YouTube वीडियो प्लेयर" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

एक-एक डेमो के लिए, या यह पता लगाने के लिए कि Seasalt.ai आपकी व्यावसायिक आवश्यकताओं के लिए समाधान को कैसे अनुकूलित कर सकता है, कृपया हमारा [डेमो शेड्यूल करें फ़ॉर्म](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) भरें।
`;export{e as default};
