const e=`---
title: "SeaX KB: நீங்கள் கேட்பதற்கு முன்பே பதிலளிக்கும் ஒரு அறிவுத் தளம்"
metatitle: "SeaX KB: நீங்கள் கேட்பதற்கு முன்பே பதிலளிக்கும் ஒரு அறிவுத் தளம்"
date: 2022-08-15 22:01:32-07:00
modified_date: 2025-07-30 17:05:21.933000+00:00
draft: false
author: Kim Dodds
description: "இந்தக் கட்டுரையில், AI ஒருங்கிணைப்புகளின் தலைப்பைத் தொடர்வோம், SeaX இன் AI-இயங்கும் அறிவுத் தளத்தை அறிமுகப்படுத்துகிறோம், இது நிகழ்நேரத்தில் பரிந்துரைக்கப்பட்ட பதில்களை வழங்குகிறது."
weight: 1
tags:
  - SeaX
canonicalURL: /blog/seax-kb-a-knowledge-base/
url: /blog/seax-kb-a-knowledge-base/
---

*எங்கள் முந்தைய வலைப்பதிவு இடுகையில், [SeaX குரல் நுண்ணறிவு மூலம் உங்கள் தொடர்பு மையத்திற்கு அதன் சொந்தக் குரலைக் கொடுங்கள்](https://seasalt.ai/blog/21-seax-voice-intelligence/), Seasalt.ai இன் உள்ளக உரையிலிருந்து பேச்சு மற்றும் பேச்சிலிருந்து உரை இயந்திரங்கள் SeaX தளத்தின் ஒவ்வொரு அம்சத்தையும் எவ்வாறு மேம்படுத்துகின்றன என்பதைக் காட்டினோம். இந்தக் கட்டுரையில், AI ஒருங்கிணைப்புகளின் தலைப்பைத் தொடர்வோம், SeaX இன் AI-இயங்கும் அறிவுத் தளத்தை அறிமுகப்படுத்துகிறோம், இது உரையாடல்களைக் கேட்டு நிகழ்நேரத்தில் பரிந்துரைக்கப்பட்ட பதில்களை வழங்குகிறது.*

# பொருளடக்கம்
- [பாரம்பரிய அறிவுத் தளம்](#the-traditional-knowledge-base)
- [SeaX அறிவுத் தளம்](#seax-knowledge-base)
    - [நேரடி முகவர்களுக்கான உட்பொதிக்கப்பட்ட பயனர் இடைமுகம்](#embedded-user-interface-for-live-agents)
    - [வேகமான மற்றும் துல்லியமான தேடல்](#fast-and-accurate-search)
    - [நிகழ்நேர தானியங்கு பரிந்துரைகள்](#real-time-automated-suggestions)
    - [பதில் வார்ப்புருக்கள்](#response-templates)
    - [KB மேலாண்மை](#kb-management)
    - [வலைவாசல்](#webinar)

# பாரம்பரிய அறிவுத் தளம்

அதன் மையத்தில், ஒரு அறிவுத் தளம் (KB) என்பது ஆன்லைன் சுய சேவைக்காக (சிறப்பாக) நன்கு ஒழுங்கமைக்கப்பட்ட மற்றும் எளிதில் அணுகக்கூடிய தகவல்களின் களஞ்சியமாகும். ஒரு நல்ல KB அமைப்பு, பயனர்கள் சரியான தகவலை எளிதாகக் கண்டறிய உதவும் வகையில், படிநிலை உள்ளடக்க அமைப்பு, தேடல் மற்றும் குறியிடுதல் போன்ற அம்சங்களைக் கொண்டிருக்கும்.

ஒரு விரிவான அறிவுத் தளத்தை பராமரிப்பது இப்போதெல்லாம் பெரும்பாலான நிறுவனங்களுக்கு ஒரு நிலையான நடைமுறையாகும். ஊழியர்கள் தங்கள் தயாரிப்புகள் பற்றிய உள் தகவல்களைப் பகிர்ந்து கொள்ள உதவுவது, வருங்கால வாடிக்கையாளர்களின் கேள்விகளுக்கு பதிலளிப்பது, வாடிக்கையாளர்களுக்கு சிக்கல்களைத் தீர்க்க உதவுவது அல்லது இவை அனைத்தும் - ஊழியர்கள் மற்றும் வாடிக்கையாளர்கள் இருவருக்கும் முக்கியமான தகவல்களை அணுகுவது என்பது திறமையான வேலை மற்றும் அதிக வாடிக்கையாளர் திருப்தியைக் குறிக்கிறது.

பொதுவாக, ஒரு அறிவுத் தளம் ஒரு உள்ளடக்க மேலாண்மை அமைப்பு அல்லது அறிவு மேலாண்மை அமைப்பு மூலம் செயல்படுத்தப்பட்டு பராமரிக்கப்படுகிறது. இந்த அமைப்புகள், ஒரு எளிய ஆவண மேலாளரிலிருந்து வெளியீட்டு பணிப்பாய்வுகள், பார்வையாளர்களை இலக்கு வைத்தல், ஒத்துழைப்புக் கருவிகள் மற்றும் பலவற்றைக் கொண்ட அம்சம் நிறைந்த சேவை வரை, நிறுவனத்தின் தேவைகளைப் பொறுத்து அளவில் மாறுபடும். இந்த அமைப்புகள் வெவ்வேறு அம்சங்களில் பல்துறை திறன் கொண்டவை என்றாலும், அவை கிட்டத்தட்ட எப்போதும் ஒரு வலைப்பக்கம் அல்லது செயலியுடன் தொடர்புகொள்வதன் மூலம் அணுக வடிவமைக்கப்பட்டுள்ளன. ஒரு வாடிக்கையாளர் சேவை முகவரின் குறிப்பிட்ட பயன்பாட்டு வழக்கிற்கு (வாடிக்கையாளர்களுக்கு உதவ அவர்களின் முதன்மை ஆதாரங்களில் ஒன்றாக அறிவுத் தளத்தை அடிக்கடி பயன்படுத்துபவர்), முகவர் பயனர் வினவல்களை முடிந்தவரை தடையின்றி கையாள அனுமதிக்கும் வகையில் தொடர்பு மைய மென்பொருளுடன் நெருக்கமான ஒருங்கிணைப்பு தேவைப்படுகிறது.

# SeaX அறிவுத் தளம்

எங்கள் அறிவுத் தளம் முதல் நாளிலிருந்தே ஒரு குறிப்பிட்ட பயன்பாட்டு வழக்கைக் கொண்டு வடிவமைக்கப்பட்டுள்ளது: குரல் வாடிக்கையாளர் சேவை. தற்போதுள்ள பெரும்பாலான அறிவுத் தள அமைப்புகள் படிநிலை வலைப்பக்கங்களில் வழிசெலுத்துவதையோ அல்லது தேடல் வினவலைத் தட்டச்சு செய்வதையோ நம்பியிருந்தாலும், எங்கள் அறிவுத் தளம் வேகமாகவும் அதிக சுதந்திரமாகவும் இருக்க வேண்டும், இதனால் வாடிக்கையாளர் சேவை பிரதிநிதிகள் வாடிக்கையாளர் மீது தங்கள் முழு கவனத்தையும் செலுத்த முடியும், அதே நேரத்தில் கேள்விகளுக்கு விரைவாக பதிலளிக்க முடியும்.

நீங்கள் நேரடியாக டெமோவிற்குச் செல்ல விரும்பினால், எங்கள் குறுகிய SeaX KB டெமோ வீடியோவைப் பார்க்கலாம்:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/C_e_gaZHSFA" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>


## நேரடி முகவர்களுக்கான உட்பொதிக்கப்பட்ட பயனர் இடைமுகம்

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-intro.png" alt="SeaX அறிவுத் தள இடைமுகத்தின் முதல் பார்வை."/>

*SeaX அறிவுத் தள இடைமுகத்தின் முதல் பார்வை.*
</center>

இயற்கையாகவே, எங்கள் அறிவுத் தள இயந்திரம் குறிப்பாக தொடர்பு மைய பயன்பாடுகளுக்காக வடிவமைக்கப்பட்டதால், இது SeaX தளத்துடன் இயல்பாகவே ஒருங்கிணைக்கப்படுகிறது, இதனால் முகவர்கள் அழைப்புகள் மற்றும் செய்திகளைக் கையாளும் போது அறிவுத் தளத்தை தடையின்றி அணுக முடியும். ஜன்னல்களை மாற்றுவது, தாவல்களைத் துடைப்பது, உள்ளமைக்கப்பட்ட வலைப்பக்கங்களில் வழிசெலுத்துவது இல்லை.

## வேகமான மற்றும் துல்லியமான தேடல்

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-manual-search.png" alt="SeaX அறிவுத் தளத்தில் ஒரு கையேடு தேடலின் முடிவுகள்."/>

*SeaX அறிவுத் தளத்தில் ஒரு கையேடு தேடலின் முடிவுகள்.*
</center>

அதன் மிக அடிப்படையான மட்டத்தில், எங்கள் அறிவுத் தளம் மிக வேகமான மற்றும் துல்லியமான தேடுபொறியால் இயக்கப்படுகிறது. நாங்கள் அதிநவீன இயற்கை மொழி செயலாக்கம் மற்றும் தகவல் பிரித்தெடுத்தல் நுட்பங்களைப் பயன்படுத்தி எளிய உரை, மாதிரி வினவல்கள் மற்றும் ஆதரவு URL களில் இருந்து அர்த்தத்தை சேகரித்து, வாடிக்கையாளரின் பேச்சை மிகவும் பொருத்தமான அறிவுத் தள உள்ளீடுகளுடன் பொருத்துகிறோம். அறிவுத் தள இயந்திரம் மிகவும் அளவிடக்கூடியது மற்றும் பில்லியன் கணக்கான ஆவணங்களை ஆதரிக்க முடியும், பதில் நேரங்களில் எந்தவிதமான மாற்றமும் இல்லை.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-detail.png" alt="ஒரு தேடல் முடிவைக் கிளிக் செய்த பிறகு விரிவாக்கப்பட்ட பார்வையில் ஒரு அறிவுத் தளக் கட்டுரை."/>

*ஒரு தேடல் முடிவைக் கிளிக் செய்த பிறகு விரிவாக்கப்பட்ட பார்வையில் ஒரு அறிவுத் தளக் கட்டுரை.*
</center>

மிகவும் பொருத்தமான ஆவணங்களைக் கண்டுபிடிப்பதோடு மட்டுமல்லாமல், எங்கள் தேடுபொறி பயனர் வினவலிலிருந்து முக்கிய வார்த்தைகளை பிரித்தெடுத்து, ஒவ்வொரு பரிந்துரைக்கப்பட்ட அறிவுத் தள உள்ளீட்டிலும் மிகவும் பொருத்தமான முக்கிய வார்த்தைகள் மற்றும் பத்திகளை முன்னிலைப்படுத்துவதன் மூலம் மேலும் செம்மைப்படுத்தப்பட்ட முடிவுகளை வழங்குகிறது.

## நிகழ்நேர தானியங்கு பரிந்துரைகள்

ஆனால் நாங்கள் இதுவரை காட்டியிருப்பது இன்னும் ஒரு கையேடு தேடல். நேரடி முகவர்கள் வாடிக்கையாளர்களுடன் தொடர்புகொள்வதில் மும்முரமாக உள்ளனர், மேலும் ஒவ்வொரு முறையும் அவர்களுக்கு தகவல் தேவைப்படும்போது அறிவுத் தளத்தில் ஒரு தேடலை கைமுறையாக தட்டச்சு செய்வது மதிப்புமிக்க நேரத்தை வீணடிக்கிறது. எனவே, SeaX அறிவுத் தளம் மேசைக்குக் கொண்டுவரும் மிகப்பெரிய கூடுதல் மதிப்பு, உரை மற்றும் குரல் தொடர்புகளுக்கு நிகழ்நேர தானியங்கி தேடல் ஆகும்.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-automatic-search.png" alt="SeaX அறிவுத் தளம் உள்வரும் பயனர் செய்திக்கு தானியங்கி கட்டுரை பரிந்துரைகளைக் காட்டுகிறது."/>

*SeaX அறிவுத் தளம் உள்வரும் பயனர் செய்திக்கு தானியங்கி கட்டுரை பரிந்துரைகளைக் காட்டுகிறது.*
</center>

ஒவ்வொரு முறையும் ஒரு புதிய பயனர் செய்தி வரும்போது, வாடிக்கையாளரின் சரியான செய்தியைப் பயன்படுத்தி அறிவுத் தளம் தானாகவே வினவப்படுகிறது. நிகழ்நேரத்தில், வாடிக்கையாளர் பேசும்போது, முகவருக்கு அவர்களின் குறிப்புக்காக புதுப்பிக்கப்பட்ட அறிவுத் தளக் கட்டுரை பரிந்துரைகள் வழங்கப்படும்.

இது குரல் அழைப்புகளுக்கும் வேலை செய்கிறது! எங்கள் முந்தைய வலைப்பதிவு இடுகை, [SeaX குரல் நுண்ணறிவு மூலம் உங்கள் தொடர்பு மையத்திற்கு அதன் சொந்தக் குரலைக் கொடுங்கள்](https.seasalt.ai/blog/21-seax-voice-intelligence/), Seasalt.ai இன் அதிநவீன பேச்சிலிருந்து உரை இயந்திரத்தை அறிமுகப்படுத்தியது. SeaX தளம் இந்த இயந்திரத்தைப் பயன்படுத்தி அனைத்து குரல் அழைப்புகளையும் நிகழ்நேரத்தில் படியெடுக்கிறது. இதன் விளைவாக, தானியங்கி அறிவுத் தளத் தேடல் உட்பட பல்வேறு கீழ்நிலை பயன்பாடுகளுக்கு இந்த படியெடுத்தல்களைப் பயன்படுத்தலாம்.

## பதில் வார்ப்புருக்கள்

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-response-template.png" alt="ஒரு முகவர் SeaX அறிவுத் தளத்தால் உருவாக்கப்பட்ட பதில் வார்ப்புருவைப் பயன்படுத்தி ஒரே கிளிக்கில் வாடிக்கையாளருக்கு பதிலளிக்கிறார்."/>

*ஒரு முகவர் SeaX அறிவுத் தளத்தால் உருவாக்கப்பட்ட பதில் வார்ப்புருவைப் பயன்படுத்தி ஒரே கிளிக்கில் வாடிக்கையாளருக்கு பதிலளிக்கிறார்.*
</center>

அறிவுத் தளத்தின் தேடல் முடிவுகள் உரை அடிப்படையிலான தொடர்புகளுக்கான முகவர் பதில்களை விரைவுபடுத்த உதவும் கூடுதல் அம்சத்துடன் வருகின்றன. ஒரு முகவர் தொடர்புடைய அறிவுத் தளக் கட்டுரையைக் கண்டால், அவர்கள் தலைப்பின் இடதுபுறத்தில் உள்ள "+" ஐகானைக் கிளிக் செய்வதன் மூலம் தங்கள் அரட்டை சாளரத்தில் ஒரு பதில் வார்ப்புருவைச் செருகலாம். பின்னணியில், ஒவ்வொரு முறையும் அறிவுத் தளம் தேடப்படும்போது, அது பரிந்துரைக்கப்பட்ட அறிவுத் தளக் கட்டுரையிலிருந்து மிகவும் பொருத்தமான தகவல்களின் அடிப்படையில் பயனரின் கேள்விக்கு ஒரு எழுதப்பட்ட பதிலை உருவாக்குகிறது மற்றும் எந்த ஆதரவு இணைப்புகளையும் உள்ளடக்கியது. இது முகவரின் பதில் நேரத்தை வியத்தகு முறையில் மேம்படுத்தும், ஏனெனில் முகவர் இனி புதிதாகத் தொடங்கவில்லை. அதற்கு பதிலாக, அவர்கள் ஏற்கனவே தங்கள் அரட்டை சாளரத்தில் அறிவுத் தளக் கட்டுரையிலிருந்து முக்கியமான தகவல்களைக் காண்பிக்கிறார்கள், எனவே அவர்கள் செய்ய வேண்டியது எல்லாம் திருத்தி அனுப்ப வேண்டும்.


## KB மேலாண்மை

இப்போது அறிவுத் தள இயந்திரம் என்ன திறன் கொண்டது என்பதைப் பார்த்தோம், பின்தளத்தைப் பற்றி ஒரு கேள்வி உள்ளது: அறிவுத் தளத்தில் உள்ள தகவல்கள் எவ்வாறு நிர்வகிக்கப்படுகின்றன? SeaX தளம் ஒரு முழுமையாக ஒருங்கிணைக்கப்பட்ட அறிவுத் தள மேலாண்மை பயனர் இடைமுகத்தை வழங்குகிறது, அதை நிர்வாகிகள் அமைப்புகள் பக்கத்திலிருந்து அணுகலாம்.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-management.png" alt="SeaX அறிவுத் தள மேலாண்மை இடைமுகம்."/>

*SeaX அறிவுத் தள மேலாண்மை இடைமுகம்.*
</center>

இந்தப் பக்கத்தில், நீங்கள் புதிய தனிப்பட்ட அறிவுத் தள உள்ளீடுகளைச் சேர்க்கலாம் அல்லது விரிதாள் கோப்பைப் பயன்படுத்தி உங்கள் முழு அறிவுத் தளத்தையும் இறக்குமதி/ஏற்றுமதி செய்யலாம். இந்த இடைமுகம் அறிவுத் தள உள்ளீடுகளைத் திருத்துவதையும் நீக்குவதையும் ஆதரிக்கிறது, இதன் மூலம் உங்கள் அறிவுத் தளத்தை தொடர்ந்து புதுப்பித்துக் கொள்ளலாம்.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-edit.png" alt="SeaX அறிவுத் தள மேலாண்மை இடைமுகம் வழியாக ஒரு அறிவுத் தளக் கட்டுரையைத் திருத்துதல்."/>

*SeaX அறிவுத் தள மேலாண்மை இடைமுகம் வழியாக ஒரு அறிவுத் தளக் கட்டுரையைத் திருத்துதல்.*
</center>

## Webinar

அறிவுத் தள அமைப்பு மற்றும் அது SeaX தளத்துடன் எவ்வாறு ஒருங்கிணைக்கப்படுகிறது என்பதைப் பற்றி ஆழமாக ஆராய விரும்பினால், இந்தத் தலைப்பில் எங்கள் வலைநாரைப் பாருங்கள்:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/FOqQ01fpKQ4" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

ஒருவருக்கு ஒருவர் டெமோவிற்கு அல்லது உங்கள் வணிகத் தேவைகளுக்கு Seasalt.ai எவ்வாறு ஒரு தீர்வைத் தனிப்பயனாக்கலாம் என்பதை அறிய, எங்கள் [டெமோ திட்டமிடல் படிவத்தை](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) நிரப்பவும்.`;export{e as default};
