const e=`---
title: "پایگاه دانش SeaX: پایگاه دانشی که قبل از پرسیدن پاسخ می دهد"
metatitle: "پایگاه دانش SeaX: پایگاه دانشی که قبل از پرسیدن پاسخ می دهد"
date: 2022-08-15 22:01:32-07:00
modified_date: 2025-07-30 17:01:11.612000+00:00
draft: false
author: Kim Dodds
description: "در این مقاله، موضوع یکپارچه سازی هوش مصنوعی را با معرفی پایگاه دانش مجهز به هوش مصنوعی SeaX که پاسخ های پیشنهادی را در زمان واقعی ارائه می دهد، ادامه می دهیم."
weight: 1
tags:
  - SeaX
canonicalURL: /blog/seax-kb-a-knowledge-base/
url: /blog/seax-kb-a-knowledge-base/
---

*در پست وبلاگ قبلی ما [به مرکز تماس خود با هوش صوتی SeaX صدایی بدهید](https://seasalt.ai/blog/21-seax-voice-intelligence/)، نشان دادیم که چگونه موتورهای تبدیل متن به گفتار و گفتار به متن داخلی Seasalt.ai جنبه های مختلف پلتفرم SeaX را بهبود می بخشند. در این مقاله، موضوع یکپارچه سازی هوش مصنوعی را با معرفی پایگاه دانش مجهز به هوش مصنوعی SeaX که به مکالمات در زمان واقعی گوش می دهد تا پاسخ های پیشنهادی را ارائه دهد، ادامه خواهیم داد.*

# فهرست مطالب
- [پایگاه دانش سنتی](#the-traditional-knowledge-base)
- [پایگاه دانش SeaX](#seax-knowledge-base)
    - [رابط کاربری تعبیه شده برای نمایندگان زنده](#embedded-user-interface-for-live-agents)
    - [جستجوی سریع و دقیق](#fast-and-accurate-search)
    - [پیشنهادات خودکار در زمان واقعی](#real-time-automated-suggestions)
    - [قالب های پاسخ](#response-templates)
    - [مدیریت پایگاه دانش](#kb-management)
    - [وبینار](#webinar)

# پایگاه دانش سنتی

در هسته خود، یک پایگاه دانش (KB) فقط مجموعه ای (در حالت ایده آل) به خوبی سازماندهی شده و به راحتی قابل دسترسی از اطلاعات برای خود سرویسی آنلاین است. یک سیستم KB خوب دارای ویژگی هایی مانند سازماندهی محتوای سلسله مراتبی، جستجو و برچسب گذاری برای کمک به کاربران در یافتن آسان تر اطلاعات صحیح است.

حفظ یک پایگاه دانش دقیق امروزه برای اکثر شرکت ها یک روش استاندارد است. خواه هدف کمک به کارمندان برای به اشتراک گذاشتن اطلاعات داخلی در مورد محصولاتشان، پاسخ به سؤالات مشتریان بالقوه، کمک به مشتریان در عیب یابی یا همه موارد فوق باشد - در دسترس قرار دادن اطلاعات کلیدی برای کارمندان و مشتریان به معنای کارآمدتر و رضایت بیشتر مشتری است.

به طور معمول، پایگاه های دانش از طریق یک سیستم مدیریت محتوا یا یک سیستم مدیریت دانش پیاده سازی و نگهداری می شوند. این سیستم ها بسته به نیازهای یک سازمان می توانند از نظر مقیاس متفاوت باشند، از مدیران اسناد ساده گرفته تا خدمات غنی از ویژگی که شامل گردش کار انتشار، هدف گذاری مخاطبان، ابزارهای همکاری و موارد دیگر می شود. در حالی که این سیستم ها از جنبه های مختلف همه کاره هستند، تقریباً همیشه برای دسترسی از طریق تعامل با یک صفحه وب یا یک برنامه طراحی شده اند. برای مورد استفاده خاص نمایندگان خدمات مشتری (که اغلب از پایگاه های دانش به عنوان یکی از منابع اصلی خود برای کمک به مشتریان استفاده می کنند)، ادغام محکم با نرم افزار مرکز تماس برای اینکه نمایندگان بتوانند درخواست های کاربر را تا حد امکان یکپارچه مدیریت کنند، مورد نیاز است.

# پایگاه دانش SeaX

پایگاه دانش ما از روز اول با یک مورد استفاده بسیار خاص در ذهن طراحی شد: خدمات مشتری مبتنی بر صدا. در حالی که اکثر، اگر نه همه، سیستم های پایگاه دانش موجود به پیمایش در صفحات وب سلسله مراتبی یا تایپ کردن درخواست های جستجو متکی هستند، پایگاه دانش ما باید سریعتر و مستقل تر باشد تا نمایندگان خدمات مشتری بتوانند توجه کامل خود را به مشتری معطوف کنند و در عین حال به سرعت به سؤالات پاسخ دهند.

اگر می خواهید مستقیماً به نسخه ی نمایشی بروید، می توانید نسخه ی نمایشی کوتاه SeaX KB ما را تماشا کنید:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/C_e_gaZHSFA" title="پخش کننده ویدیوی YouTube" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>


## رابط کاربری تعبیه شده برای نمایندگان زنده

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-intro.png" alt="نگاهی اولیه به رابط کاربری پایگاه دانش SeaX."/>

*نگاهی اولیه به رابط کاربری پایگاه دانش SeaX.*
</center>

طبیعتاً، از آنجایی که موتور پایگاه دانش ما به طور خاص برای برنامه های مرکز تماس طراحی شده است، به طور بومی در پلتفرم SeaX ادغام شده است تا نمایندگان بتوانند به طور یکپارچه به پایگاه دانش دسترسی داشته باشند و در عین حال تماس ها و پیام ها را مدیریت کنند. بدون تعویض پنجره، بدون دست و پا زدن در میان برگه ها، بدون پیمایش در صفحات وب تو در تو.

## جستجوی سریع و دقیق

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-manual-search.png" alt="نتایج جستجوی دستی در پایگاه دانش SeaX."/>

*نتایج جستجوی دستی در پایگاه دانش SeaX.*
</center>

در ابتدایی ترین سطح، پایگاه دانش ما توسط یک موتور جستجوی بسیار سریع و دقیق پشتیبانی می شود. ما از پیشرفته ترین تکنیک های پردازش زبان طبیعی و استخراج اطلاعات برای جمع آوری معنا از متن خام، پرس و جوهای نمونه و URL های پشتیبانی و مطابقت گفته های مشتریان با مرتبط ترین ورودی های پایگاه دانش استفاده می کنیم. موتور پایگاه دانش بسیار مقیاس پذیر است و می تواند از میلیاردها سند بدون تغییر قابل توجهی در زمان پاسخ پشتیبانی کند.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-detail.png" alt="یک مقاله پایگاه دانش در نمای بزرگ شده پس از کلیک بر روی نتیجه جستجو."/>

*یک مقاله پایگاه دانش در نمای بزرگ شده پس از کلیک بر روی نتیجه جستجو.*
</center>

علاوه بر یافتن مرتبط ترین اسناد، موتور جستجوی ما با استخراج کلمات کلیدی برجسته از درخواست کاربر و برجسته کردن مرتبط ترین کلمات کلیدی و عبارات در هر ورودی پایگاه دانش پیشنهادی، نتایج دقیق تری را نیز ارائه می دهد.

## پیشنهادات خودکار در زمان واقعی

اما آنچه تاکنون نشان داده ایم هنوز یک جستجوی دستی است. نمایندگان زنده مشغول تعامل با مشتریان هستند و تایپ دستی جستجوها در پایگاه دانش هر بار که به اطلاعات نیاز دارند، زمان گرانبهایی را هدر می دهد. بنابراین، بزرگترین ارزش افزوده ای که با پایگاه دانش SeaX ارائه می شود، جستجوی خودکار در زمان واقعی برای تعاملات متنی و صوتی است.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-automatic-search.png" alt="پایگاه دانش SeaX پیشنهادات مقاله خودکار را برای پیام ورودی کاربر نشان می دهد."/>

*پایگاه دانش SeaX پیشنهادات مقاله خودکار را برای پیام ورودی کاربر نشان می دهد.*
</center>

هر بار که پیام جدیدی از کاربر وارد می شود، پایگاه دانش به طور خودکار با پیام دقیق مشتری پرس و جو می کند. در زمان واقعی، همانطور که مشتری صحبت می کند، به نمایندگان پیشنهادات به روز مقاله پایگاه دانش برای مرجع ارائه می شود.

این برای تماس های صوتی نیز کار می کند! پست وبلاگ قبلی ما [به مرکز تماس خود با هوش صوتی SeaX صدایی بدهید](https://seasalt.ai/blog/21-seax-voice-intelligence/) موتور پیشرفته گفتار به متن Seasalt.ai را به نمایش گذاشت. پلتفرم SeaX از این موتور برای رونویسی تمام تماس های صوتی در زمان واقعی استفاده می کند. در نتیجه، ما می توانیم از این رونویسی ها برای انواع برنامه های پایین دستی، از جمله جستجوی خودکار پایگاه دانش استفاده کنیم.

## قالب های پاسخ

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-response-template.png" alt="نماینده ای که با یک کلیک با یک الگوی پاسخ تولید شده توسط پایگاه دانش SeaX به مشتری پاسخ می دهد."/>

*نماینده ای که با یک کلیک با یک الگوی پاسخ تولید شده توسط پایگاه دانش SeaX به مشتری پاسخ می دهد.*
</center>

نتایج جستجوی پایگاه دانش با یک ویژگی اضافی برای کمک به سرعت بخشیدن به پاسخگویی نمایندگان برای تعاملات مبتنی بر متن ارائه می شود. هنگامی که یک نماینده یک مقاله پایگاه دانش مرتبط را پیدا می کند، می تواند به سادگی روی نماد «+» در سمت چپ عنوان کلیک کند تا یک الگوی پاسخ را در پنجره چت خود وارد کند. در باطن، هر بار که پایگاه دانش جستجو می شود، یک پاسخ مکتوب به سؤال کاربر بر اساس مرتبط ترین اطلاعات از مقالات پایگاه دانش پیشنهادی ایجاد می کند و هرگونه پیوند پشتیبانی را شامل می شود. این می تواند به طور چشمگیری زمان پاسخگویی نمایندگان را بهبود بخشد زیرا نمایندگان دیگر از ابتدا شروع نمی کنند. در عوض، آنها از قبل اطلاعات مهم مقاله پایگاه دانش را در پنجره چت خود نمایش داده اند، بنابراین تنها کاری که باید انجام دهند ویرایش و ارسال است.


## مدیریت پایگاه دانش

اکنون که دیدیم موتور پایگاه دانش چه کاری می تواند انجام دهد، یک سؤال در مورد باطن باقی می ماند: اطلاعات در پایگاه دانش چگونه مدیریت می شود؟ پلتفرم SeaX یک رابط کاربری مدیریت پایگاه دانش کاملاً یکپارچه را ارائه می دهد که مدیران می توانند از صفحه تنظیمات به آن دسترسی داشته باشند.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-management.png" alt="رابط کاربری مدیریت پایگاه دانش SeaX."/>

*رابط کاربری مدیریت پایگاه دانش SeaX.*
</center>

در این صفحه، می توانید ورودی های جدید پایگاه دانش را به صورت جداگانه اضافه کنید، یا می توانید کل پایگاه دانش را با استفاده از یک فایل صفحه گسترده وارد/صادر کنید. رابط کاربری همچنین از ویرایش و حذف ورودی های پایگاه دانش پشتیبانی می کند تا بتوانید به طور مداوم پایگاه دانش خود را به روز نگه دارید.

<center>
<img src="/images/blog/22-seax-knowledge-base/kb-edit.png" alt="ویرایش یک مقاله پایگاه دانش از طریق رابط کاربری مدیریت پایگاه دانش SeaX."/>

*ویرایش یک مقاله پایگاه دانش از طریق رابط کاربری مدیریت پایگاه دانش SeaX.*
</center>

## وبینار

اگر می خواهید نگاهی عمیق تر به سیستم پایگاه دانش و نحوه ادغام آن با پلتفرم SeaX بیندازید، وبینار ما را در این زمینه تماشا کنید:
<iframe width="85%" height="450px" src="https://www.youtube.com/embed/FOqQ01fpKQ4" title="پخش کننده ویدیوی YouTube" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

برای یک نسخه ی نمایشی یک به یک، یا برای اطلاع از اینکه چگونه Seasalt.ai می تواند راه حلی را برای نیازهای تجاری شما سفارشی کند، لطفاً [فرم برنامه ریزی نسخه ی نمایشی](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) ما را پر کنید.`;export{e as default};
