const e=`---
title: "SeaX केस मैनेजमेंट: अपने संपर्क केंद्र के केस ट्रैकिंग पर नियंत्रण रखें"
metatitle: "SeaX केस मैनेजमेंट: अपने ग्राहक इंटरैक्शन को ट्रैक करें"
date: 2022-08-17 22:28:15+00:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sarah Reid
description: "इस पोस्ट में, हम केस मैनेजमेंट के साथ AI एकीकरण का पता लगाते हैं, जो आपके एजेंटों को SeaX में आपके ग्राहकों के साथ इंटरैक्शन को ट्रैक और रिकॉर्ड करने के लिए उपकरण देता है।"
weight: 1
tags:
  - SeaX
image: images/blog/23-seax-case-management/0-main.png
canonicalURL: /blog/seax-case-management/
url: /blog/seax-case-management/
---

*हमारी पिछली ब्लॉग पोस्ट, [SeaX KB: एक ज्ञान आधार जो पूछे जाने से पहले जवाब देता है](https://seasalt.ai/blog/22-seax-knowledge-base/), में हमने दिखाया कि Seasalt.ai का इन-हाउस ज्ञान आधार आपकी कंपनी की जानकारी को सीधे आपके एजेंटों की उंगलियों पर कैसे रखता है, जिससे आपके संपर्क केंद्र में दक्षता और सटीकता बढ़ती है। इस पोस्ट में, हम SeaX के केस मैनेजमेंट सिस्टम के साथ AI एकीकरण के विषय पर जारी रखते हैं, जो आपके एजेंटों को SeaX इंटरफ़ेस में सीधे आपके ग्राहकों के साथ इंटरैक्शन को ट्रैक और रिकॉर्ड करने के लिए शक्तिशाली उपकरण देता है।*

# विषय-सूची
- [टिकटिंग बनाम केस मैनेजमेंट](#ticketing-vs-case-management)
- [SeaX केस मैनेजमेंट](#seax-case-management)
    - [लाइव एजेंटों के लिए एम्बेडेड यूजर इंटरफेस](#embedded-user-interface-for-live-agents)
    - [शक्तिशाली स्वचालित खोज](#powerful-automatic-search)
    - [एकीकृत संपर्क प्रबंधन](#integrated-contact-management)
    - [लिंक्ड ग्राहक इंटरैक्शन](#linked-customer-interactions)
    - [अनुकूलन योग्य फ़ील्ड](#customizable-fields)
    - [स्वचालित केस फॉलो-अप](#automated-case-follow-up)
    - [प्रशासक डैशबोर्ड](#administrator-dashboard)
    - [वेबिनार](#webinar)

# टिकटिंग बनाम केस मैनेजमेंट

'टिकटिंग' और 'केस मैनेजमेंट' शब्द अक्सर एक प्रणाली को संदर्भित करने के लिए एक दूसरे के स्थान पर उपयोग किए जाते हैं जब किसी मुद्दे का विवरण किसी डेटा ऑब्जेक्ट में संग्रहीत होता है, जिसका उपयोग तब मुद्दे को हल करने के दौरान किया जाता है और संदर्भित किया जाता है। हालांकि, इन दोनों शब्दों में आमतौर पर अंतर सिस्टम की जटिलता में होता है।

'टिकटिंग' सिस्टम आमतौर पर सरल होते हैं, जहां टिकट का उपयोग किसी एक विशिष्ट मुद्दे के विवरण को संग्रहीत करने के लिए किया जाता है, और जब मुद्दा हल हो जाता है तो उसे छोड़ दिया जाता है या संग्रहीत किया जाता है। 'केस मैनेजमेंट' सिस्टम आमतौर पर अधिक जटिल होते हैं, और किसी मुद्दे के जीवन को ट्रैक करने से कहीं अधिक करते हैं। मामलों को अक्सर अन्य चीजों से जोड़ा जाता है, जैसे अन्य समान मामले या ग्राहक जिसने मामला खोला, ताकि रुझानों का उपयोग अधिक व्यापक मुद्दों को हल करने के लिए किया जा सके। मुद्दे के दौरान ग्राहक के साथ कई इंटरैक्शन की जानकारी केस डेटा में संग्रहीत की जा सकती है, ताकि केस को संभालने वाला प्रत्येक बाद का एजेंट ठीक से जानता हो कि क्या चल रहा है। यदि ग्राहक एक आवर्ती मुद्दे के साथ लौटता है तो एक केस को बंद किया जा सकता है और फिर से खोला जा सकता है। केस मैनेजमेंट एक संपर्क केंद्र के भीतर अधिक जटिल कार्यों और इंटरैक्शन को ट्रैक करने के लिए एक अधिक शक्तिशाली और लचीला उपकरण है।

# SeaX केस मैनेजमेंट

हमारा केस मैनेजमेंट ग्राहकों के साथ बातचीत करते समय उपयोग में आसानी के सिद्धांत पर आधारित है। ग्राहक की सहायता करते समय एक एजेंट को जिस आखिरी चीज की चिंता करने की आवश्यकता होती है, वह यह है कि कॉल के बाद नोट्स लिखने के लिए सब कुछ याद रखना, या ग्राहक से बात करने, मौजूदा जानकारी खोजने और नई जानकारी पर नोट्स लेने के लिए कई अलग-अलग कार्यक्रमों में स्विच करने के लिए मजबूर होना।

यदि आप सीधे प्रदर्शन पर जाना चाहते हैं, तो आप हमारा छोटा SeaX केस मैनेजमेंट डेमो वीडियो देख सकते हैं:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/yf1REVZtRa8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## लाइव एजेंटों के लिए एम्बेडेड यूजर इंटरफेस

<center>
<img src="/images/blog/23-seax-case-management/1-intro.png" alt="SeaX केस मैनेजमेंट इंटरफ़ेस पर पहली नज़र।"/>

*SeaX केस मैनेजमेंट इंटरफ़ेस पर पहली नज़र।*
</center>

चूंकि हमारा ध्यान केस मैनेजमेंट को एजेंटों के लिए सुलभ बनाना था, इसलिए SeaX केस मैनेजमेंट सिस्टम SeaX में मूल रूप से एकीकृत है। एजेंट नए केस जोड़ सकते हैं, मौजूदा केस को संपादित कर सकते हैं, और उसी इंटरफ़ेस में सभी आवश्यक नोट्स ले सकते हैं जहां वे कॉल और संदेशों को संभालते हैं। कोई विंडो स्विचिंग नहीं, कोई टैब पलटना नहीं, कोई नेस्टेड वेब पेजों के माध्यम से नेविगेट करना नहीं।

## शक्तिशाली स्वचालित खोज

<center>
<img src="/images/blog/23-seax-case-management/2-search.png" alt="SeaX केस मैनेजमेंट खोज इंटरफ़ेस।"/>

*SeaX केस मैनेजमेंट खोज इंटरफ़ेस।*
</center>

हमारी तेज़ और सटीक केस खोज आपको अपने केस की जानकारी के किसी भी पहलू से खोजने और सॉर्ट करने की अनुमति देती है, जिसमें एजेंट नोट्स की पूर्ण टेक्स्ट खोज और आपके स्वयं के कस्टम डेटा फ़ील्ड द्वारा फ़िल्टरिंग शामिल है।

## एकीकृत संपर्क प्रबंधन

<center>
<img src="/images/blog/23-seax-case-management/3-contacts.png" alt="SeaX केस मैनेजमेंट ग्राहक संपर्क इंटरफ़ेस।"/>

*SeaX केस मैनेजमेंट ग्राहक संपर्क इंटरफ़ेस।*
</center>

केस जानकारी के प्रबंधन के अलावा, हम आपकी ग्राहक जानकारी को संग्रहीत करने और ग्राहकों के मामलों को एक साथ जोड़ने के लिए संपर्क प्रबंधन भी प्रदान करते हैं। मामलों की तरह, आप ग्राहकों पर नोट्स संग्रहीत कर सकते हैं और उन्हें लेबल द्वारा समूहित कर सकते हैं ताकि यह ट्रैक किया जा सके कि आपके संपर्क केंद्र में कौन कॉल कर रहा है।

## लिंक्ड ग्राहक इंटरैक्शन

<center>
<img src="/images/blog/23-seax-case-management/4-recording.png" alt="अपनी कॉल रिकॉर्डिंग को सीधे संबंधित केस में एम्बेड करें।"/>

*अपनी कॉल रिकॉर्डिंग को सीधे संबंधित केस में एम्बेड करें।*
</center>

प्रत्येक केस संबंधित संपर्क से जुड़ा होता है, लेकिन हम व्यक्तिगत कॉल को भी संबंधित केस से जोड़ सकते हैं। 'एम्बेड टास्क रिकॉर्डिंग' फ़ंक्शन के साथ, आप सीधे कॉल रिकॉर्डिंग को केस से जोड़ सकते हैं, जिससे प्रत्येक संबंधित ग्राहक इंटरैक्शन में वास्तव में क्या हुआ, इसकी भविष्य की समीक्षा की जा सकती है।

## अनुकूलन योग्य फ़ील्ड

<center>
<img src="/images/blog/23-seax-case-management/5-custom-fields.png" alt="ग्राहक और केस की जानकारी को संग्रहीत करने के लिए कस्टम डेटा फ़ील्ड परिभाषित करें जो आपके लिए महत्वपूर्ण है।"/>

*ग्राहक और केस की जानकारी को संग्रहीत करने के लिए कस्टम डेटा फ़ील्ड परिभाषित करें जो आपके लिए महत्वपूर्ण है।*
</center>

हम समझते हैं कि प्रत्येक कंपनी अद्वितीय है, और प्रत्येक संपर्क केंद्र को अपने मामलों में विभिन्न प्रकार की जानकारी एकत्र करने की आवश्यकता होगी। इसलिए, SeaX केस मैनेजमेंट सिस्टम महत्वपूर्ण डेटा फ़ील्ड का मूल सेट प्रदान करता है, जबकि एक कस्टम फ़ील्ड फ़ंक्शन भी प्रदान करता है ताकि आप अपने संपर्क केंद्र में आवश्यक किसी भी जानकारी को एकत्र करने के लिए मामलों और ग्राहक संपर्कों दोनों में अतिरिक्त डेटा फ़ील्ड जोड़ सकें।

<center>
<img src="/images/blog/23-seax-case-management/6-custom-fields.png" alt="केस और संपर्क कार्ड में सीधे अपने कस्टम फ़ील्ड तक पहुंचें।"/>

*केस और संपर्क कार्ड में सीधे अपने कस्टम फ़ील्ड तक पहुंचें।*
</center>

## स्वचालित केस फॉलो-अप

<center>
<img src="/images/blog/23-seax-case-management/7-sms.png" alt="ग्राहकों से केस की स्थिति और CSAT स्कोर एकत्र करने के लिए संदेशों को स्वचालित करें।"/>

*ग्राहकों से केस की स्थिति और CSAT स्कोर एकत्र करने के लिए संदेशों को स्वचालित करें।*
</center>

संपर्क केंद्र में कई छोटे दोहराए जाने वाले ग्राहक इंटरैक्शन होते हैं जिन्हें यह सुनिश्चित करने के लिए किया जाना चाहिए कि मामलों को ठीक से संभाला जाए। SeaX केस मैनेजमेंट सिस्टम आपके लिए इन वार्ताओं को स्वचालित कर सकता है, ताकि आपके एजेंट अधिक जटिल मुद्दों पर ध्यान केंद्रित कर सकें। एक बटन के क्लिक के साथ, आप किसी ग्राहक को एक संदेश भेज सकते हैं ताकि लंबे समय से खुले हुए केस की स्थिति की जांच की जा सके या ग्राहक संतुष्टि सर्वेक्षण पर प्रतिक्रिया का अनुरोध किया जा सके, और सिस्टम उनकी प्रतिक्रिया के आधार पर उनकी केस जानकारी को स्वचालित रूप से अपडेट करेगा।

## प्रशासक डैशबोर्ड

<center>
<img src="/images/blog/23-seax-case-management/8-admin.png" alt="प्रशासक डैशबोर्ड के साथ अपने केस मैनेजमेंट सिस्टम में जानकारी को नियंत्रित करें।"/>

*प्रशासक डैशबोर्ड के साथ अपने केस मैनेजमेंट सिस्टम में जानकारी को नियंत्रित करें।*
</center>

अपने संपर्क केंद्र में मामलों के बारे में जानकारी संग्रहीत करना एक बात है, और अपने संपर्क केंद्र में मामलों का प्रबंधन करना दूसरी बात है। SeaX केस मैनेजमेंट सिस्टम एक प्रशासक डैशबोर्ड प्रदान करता है ताकि आप ऐसा कर सकें। यहां से आप अपने सिस्टम में सभी मामलों की निगरानी कर सकते हैं और यह निर्धारित करने के लिए विवरणों में गहराई से जा सकते हैं कि किन पर ध्यान देने की आवश्यकता है। आप समय सीमा या एजेंट द्वारा सॉर्ट कर सकते हैं, स्वचालित स्थिति जांच संदेश भेज सकते हैं, या किसी विशिष्ट टैग वाले मामलों की खोज कर सकते हैं, जो भी आपके मामलों को प्रबंधित करने के लिए आवश्यक हो।

## वेबिनार

यदि आप केस मैनेजमेंट सिस्टम और यह SeaX प्लेटफॉर्म के साथ कैसे एकीकृत होता है, इसका अधिक गहन अवलोकन देखना चाहते हैं, तो कृपया इस विषय पर हमारा वेबिनार देखें:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/xwZla3ftWLk" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

SeaX केस मैनेजमेंट सिस्टम आपके एजेंटों को आपके ग्राहकों के साथ बातचीत करते समय कैसे समर्थन करता है, इसके बारे में पढ़ने के लिए समय निकालने के लिए धन्यवाद। कृपया हमारी अगली ब्लॉग पोस्ट के लिए बने रहें, जो SeaX प्लेटफॉर्म का उपयोग करके थोक एसएमएस संदेश भेजने की प्रक्रिया में गहराई से गोता लगाएगी। यदि आप तुरंत और अधिक जानने में रुचि रखते हैं, तो SeaX प्लेटफॉर्म पर पहली नज़र डालने के लिए हमारा [डेमो बुक करें फॉर्म](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) भरें।
`;export{e as default};
