const e=`---
title: "SeaX Case Management: Возьмите под контроль отслеживание обращений в вашем контакт-центре"
metatitle: "SeaX Case Management: Отслеживайте взаимодействия с клиентами"
date: 2022-08-17 22:28:15+00:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sarah Reid
description: "В этом посте мы рассмотрим интеграцию ИИ с управлением обращениями, которая предоставляет вашим агентам инструменты для отслеживания и записи взаимодействий с вашими клиентами в SeaX."
weight: 1
tags:
  - SeaX
image: images/blog/23-seax-case-management/0-main.png
canonicalURL: /blog/seax-case-management/
url: /blog/seax-case-management/
---

*В нашем предыдущем сообщении в блоге, [SeaX KB: База знаний, которая отвечает до того, как ее спросят](https://seasalt.ai/blog/22-seax-knowledge-base/), мы показали, как внутренняя база знаний Seasalt.ai предоставляет информацию о вашей компании прямо под рукой ваших агентов, повышая эффективность и точность в вашем контакт-центре. В этом сообщении мы продолжаем тему интеграции ИИ с системой управления обращениями SeaX, которая предоставляет вашим агентам мощные инструменты для отслеживания и записи взаимодействий с вашими клиентами непосредственно в интерфейсе SeaX.*

# Содержание
- [Тикетинг против управления обращениями](#ticketing-vs-case-management)
- [Управление обращениями SeaX](#seax-case-management)
    - [Встроенный пользовательский интерфейс для живых агентов](#embedded-user-interface-for-live-agents)
    - [Мощный автоматический поиск](#powerful-automatic-search)
    - [Интегрированное управление контактами](#integrated-contact-management)
    - [Связанные взаимодействия с клиентами](#linked-customer-interactions)
    - [Настраиваемые поля](#customizable-fields)
    - [Автоматическое отслеживание обращений](#automated-case-follow-up)
    - [Панель администратора](#administrator-dashboard)
    - [Вебинар](#webinar)

# Тикетинг против управления обращениями

Термины «тикетинг» и «управление обращениями» часто используются взаимозаменяемо для обозначения системы, в которой детали проблемы хранятся в некотором объекте данных, который затем используется и упоминается в процессе решения проблемы. Однако, где эти два термина обычно различаются, так это в сложности системы.

Системы «тикетинга» обычно проще, где тикет используется для хранения деталей одной конкретной проблемы и отбрасывается или архивируется после решения проблемы. Системы «управления обращениями» обычно более сложны и делают больше, чем просто отслеживание жизненного цикла проблемы. Обращения часто связаны с другими вещами, такими как другие похожие обращения или клиент, который открыл обращение, чтобы тенденции могли быть использованы для решения более распространенных проблем. Информация о нескольких взаимодействиях с клиентом в ходе проблемы может храниться в данных обращения, поэтому каждый последующий агент, который обрабатывает обращение, точно знает, что происходит. Обращение может быть закрыто, а затем вновь открыто, если клиент возвращается с повторяющейся проблемой. Управление обращениями — это более мощный и гибкий инструмент для отслеживания более сложных задач и взаимодействий в контакт-центре.

# Управление обращениями SeaX

Наше управление обращениями основано на принципе простоты использования при взаимодействии с клиентами. Последнее, о чем нужно беспокоиться агенту при оказании помощи клиенту, — это запоминать все, чтобы записывать заметки после звонка, или быть вынужденным переключаться между несколькими различными программами только для того, чтобы поговорить с клиентом, найти существующую информацию и делать заметки о новой информации.

Если вы хотите сразу перейти к демонстрации, вы можете посмотреть наше короткое демонстрационное видео SeaX Case Management:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/yf1REVZtRa8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## Встроенный пользовательский интерфейс для живых агентов

<center>
<img src="/images/blog/23-seax-case-management/1-intro.png" alt="Первый взгляд на интерфейс SeaX Case Management."/>

*Первый взгляд на интерфейс SeaX Case Management.*
</center>

Поскольку нашей целью было сделать управление обращениями доступным для агентов, система управления обращениями SeaX изначально интегрирована в SeaX. Агенты могут добавлять новые обращения, редактировать существующие и делать все необходимые заметки в том же интерфейсе, где они обрабатывают звонки и сообщения. Никакого переключения окон, никакого перелистывания вкладок, никакого перехода по вложенным веб-страницам.

## Мощный автоматический поиск

<center>
<img src="/images/blog/23-seax-case-management/2-search.png" alt="Интерфейс поиска SeaX Case Management."/>

*Интерфейс поиска SeaX Case Management.*
</center>

Наш быстрый и точный поиск обращений позволяет искать и сортировать по любому аспекту информации о вашем обращении, включая полнотекстовый поиск заметок агента и фильтрацию по вашим собственным настраиваемым полям данных.

## Интегрированное управление контактами

<center>
<img src="/images/blog/23-seax-case-management/3-contacts.png" alt="Интерфейс контактов клиентов SeaX Case Management."/>

*Интерфейс контактов клиентов SeaX Case Management.*
</center>

В дополнение к управлению информацией об обращениях, мы также предоставляем управление контактами для хранения информации о ваших клиентах и связывания обращений клиентов. Как и в случае с обращениями, вы можете хранить заметки о клиентах и группировать их по меткам, чтобы точно отслеживать, кто звонит в ваш контакт-центр.

## Связанные взаимодействия с клиентами

<center>
<img src="/images/blog/23-seax-case-management/4-recording.png" alt="Встраивайте записи звонков непосредственно в соответствующее обращение."/>

*Встраивайте записи звонков непосредственно в соответствующее обращение.*
</center>

Каждое обращение связано с соответствующим контактом, но мы также можем связывать отдельные звонки с соответствующим обращением. С помощью функции «Встроить запись задачи» вы можете напрямую прикрепить запись звонка к обращению, что позволяет в будущем просматривать, что именно произошло в каждом соответствующем взаимодействии с клиентом.

## Настраиваемые поля

<center>
<img src="/images/blog/23-seax-case-management/5-custom-fields.png" alt="Определите настраиваемые поля данных для хранения важной для вас информации о клиенте и обращении."/>

*Определите настраиваемые поля данных для хранения важной для вас информации о клиенте и обращении.*
</center>

Мы понимаем, что каждая компания уникальна, и что каждому контакт-центру потребуется собирать различные типы информации в своих обращениях. Поэтому система управления обращениями SeaX предоставляет базовый набор важных полей данных, а также функцию настраиваемых полей, чтобы вы могли добавлять дополнительные поля данных как к обращениям, так и к контактам клиентов, чтобы собирать любую информацию, которая вам нужна в вашем контакт-центре.

<center>
<img src="/images/blog/23-seax-case-management/6-custom-fields.png" alt="Доступ к вашим настраиваемым полям непосредственно в карточках обращений и контактов."/>

*Доступ к вашим настраиваемым полям непосредственно в карточках обращений и контактов.*
</center>

## Автоматическое отслеживание обращений

<center>
<img src="/images/blog/23-seax-case-management/7-sms.png" alt="Автоматизируйте сообщения для сбора статуса обращения и оценок CSAT от клиентов."/>

*Автоматизируйте сообщения для сбора статуса обращения и оценок CSAT от клиентов.*
</center>

В контакт-центре необходимо выполнять ряд небольших повторяющихся взаимодействий с клиентами, чтобы обеспечить надлежащую обработку обращений. Система управления обращениями SeaX может автоматизировать эти разговоры для вас, чтобы ваши агенты могли сосредоточиться на более сложных проблемах. Одним нажатием кнопки вы можете отправить сообщение клиенту, чтобы проверить статус обращения, которое было открыто в течение длительного времени, или запросить ответ на опрос удовлетворенности клиентов, и система автоматически обновит информацию об их обращении на основе их ответа.

## Панель администратора

<center>
<img src="/images/blog/23-seax-case-management/8-admin.png" alt="Контролируйте информацию в вашей системе управления обращениями с помощью панели администратора."/>

*Контролируйте информацию в вашей системе управления обращениями с помощью панели администратора.*
</center>

Хранение информации об обращениях в вашем контакт-центре — это одно, а управление обращениями в вашем контакт-центре — это другое. Система управления обращениями SeaX предоставляет панель администратора, чтобы вы могли это делать. Отсюда вы можете отслеживать все обращения в вашей системе и углубляться в детали, чтобы определить, какие из них требуют внимания. Вы можете сортировать по временному диапазону или агенту, отправлять автоматические сообщения проверки статуса или искать обращения с определенным тегом, все, что необходимо для управления вашими обращениями.

## Вебинар

Если вы хотите увидеть более подробное пошаговое руководство по системе управления обращениями и ее интеграции с платформой SeaX, пожалуйста, посмотрите наш вебинар на эту тему:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/xwZla3ftWLk" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

Благодарим вас за то, что уделили время, чтобы узнать, как система управления обращениями SeaX поддерживает ваших агентов при взаимодействии с вашими клиентами. Пожалуйста, следите за нашим следующим сообщением в блоге, которое будет посвящено процессу отправки массовых SMS-сообщений с использованием платформы SeaX. Если вы заинтересованы в немедленном получении дополнительной информации, заполните нашу [форму бронирования демонстрации](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting), чтобы получить первое представление о платформе SeaX.`;export{e as default};
