const e=`---
title: "إدارة الحالات في SeaX: تحكم في تتبع حالات مركز الاتصال الخاص بك"
metatitle: "إدارة الحالات في SeaX: تتبع تفاعلات عملائك"
date: 2022-08-17 22:28:15+00:00
modified_date: 2025-07-31 12:00:00+00:00
draft: false
author: Sarah Reid
description: "في هذا المقال، نستكشف تكاملات الذكاء الاصطناعي مع إدارة الحالات، والتي تمنح وكلائك أدوات لتتبع وتسجيل التفاعلات مع عملائك في SeaX."
weight: 1
tags:
  - SeaX
image: images/blog/23-seax-case-management/0-main.png
canonicalURL: /blog/seax-case-management/
url: /blog/seax-case-management/
---

*في تدوينتنا السابقة، [SeaX KB: قاعدة معرفية تجيب قبل أن تُسأل](https://seasalt.ai/blog/22-seax-knowledge-base/)، عرضنا كيف تضع قاعدة المعرفة الداخلية لشركة Seasalt.ai معلومات شركتك مباشرة في متناول وكلائك، مما يعزز الكفاءة والدقة في مركز الاتصال الخاص بك. في هذا المقال، نواصل موضوع تكاملات الذكاء الاصطناعي مع نظام إدارة الحالات في SeaX، والذي يمنح وكلائك أدوات قوية لتتبع وتسجيل التفاعلات مع عملائك مباشرة في واجهة SeaX.*

# جدول المحتويات
- [نظام التذاكر مقابل إدارة الحالات](#ticketing-vs-case-management)
- [إدارة الحالات في SeaX](#seax-case-management)
    - [واجهة مستخدم مدمجة للوكلاء المباشرين](#embedded-user-interface-for-live-agents)
    - [بحث تلقائي قوي](#powerful-automatic-search)
    - [إدارة جهات الاتصال المتكاملة](#integrated-contact-management)
    - [تفاعلات العملاء المرتبطة](#linked-customer-interactions)
    - [حقول قابلة للتخصيص](#customizable-fields)
    - [متابعة آلية للحالات](#automated-case-follow-up)
    - [لوحة تحكم للمسؤول](#administrator-dashboard)
    - [ندوة عبر الإنترنت](#webinar)

# نظام التذاكر مقابل إدارة الحالات

غالبًا ما يتم استخدام مصطلحي "نظام التذاكر" و "إدارة الحالات" بشكل متبادل للإشارة إلى نظام يتم فيه تخزين تفاصيل مشكلة ما في كائن بيانات معين، والذي يتم استخدامه والإشارة إليه بعد ذلك في سياق حل المشكلة. ومع ذلك، حيث يختلف هذان المصطلحان عادةً هو في مدى تعقيد النظام.

عادةً ما تكون أنظمة "التذاكر" أبسط، حيث تُستخدم التذكرة لتخزين تفاصيل مشكلة معينة، ويتم التخلص منها أو أرشفتها عند حل المشكلة. أما أنظمة "إدارة الحالات" فهي عادةً أكثر تعقيدًا، وتقوم بأكثر من مجرد تتبع حياة المشكلة. غالبًا ما ترتبط الحالات بأشياء أخرى، مثل الحالات المماثلة الأخرى أو العميل الذي فتح الحالة، بحيث يمكن استخدام الاتجاهات لحل المشكلات الأكثر انتشارًا. يمكن تخزين المعلومات حول التفاعلات المتعددة مع العميل على مدار المشكلة في بيانات الحالة، بحيث يعرف كل وكيل لاحق يتعامل مع الحالة بالضبط ما يجري. يمكن إغلاق الحالة ثم إعادة فتحها إذا عاد العميل بمشكلة متكررة. تعد إدارة الحالات أداة أكثر قوة ومرونة لتتبع المهام والتفاعلات الأكثر تعقيدًا داخل مركز الاتصال.

# إدارة الحالات في SeaX

تعتمد إدارة الحالات لدينا على مبدأ سهولة الاستخدام أثناء التفاعل مع العملاء. آخر شيء يحتاجه الوكيل أثناء مساعدة العميل هو القلق بشأن تذكر كل شيء لتدوين الملاحظات بعد المكالمة، أو إجباره على التبديل إلى برامج متعددة مختلفة لمجرد التحدث إلى العميل، والعثور على المعلومات الحالية، وتدوين ملاحظات حول المعلومات الجديدة.

إذا كنت ترغب في الانتقال مباشرة إلى العرض التوضيحي، يمكنك مشاهدة فيديو العرض التوضيحي القصير لإدارة الحالات في SeaX:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/yf1REVZtRa8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## واجهة مستخدم مدمجة للوكلاء المباشرين

<center>
<img src="/images/blog/23-seax-case-management/1-intro.png" alt="نظرة أولى على واجهة إدارة الحالات في SeaX."/>

*نظرة أولى على واجهة إدارة الحالات في SeaX.*
</center>

نظرًا لأن تركيزنا كان على جعل إدارة الحالات في متناول الوكلاء، فإن نظام إدارة الحالات في SeaX مدمج أصلاً في SeaX. يمكن للوكلاء إضافة حالات جديدة وتعديل الحالات الحالية وتدوين جميع الملاحظات اللازمة في نفس الواجهة التي يتعاملون فيها مع المكالمات والرسائل. لا حاجة لتبديل النوافذ، ولا تقليب علامات التبويب، ولا التنقل عبر صفحات الويب المتداخلة.

## بحث تلقائي قوي

<center>
<img src="/images/blog/23-seax-case-management/2-search.png" alt="واجهة بحث إدارة الحالات في SeaX."/>

*واجهة بحث إدارة الحالات في SeaX.*
</center>

يتيح لك بحثنا السريع والدقيق عن الحالات البحث والفرز حسب أي جانب من جوانب معلومات حالتك، بما في ذلك البحث في النص الكامل لملاحظات الوكيل والتصفية حسب حقول البيانات المخصصة الخاصة بك.

## إدارة جهات الاتصال المتكاملة

<center>
<img src="/images/blog/23-seax-case-management/3-contacts.png" alt="واجهة جهات اتصال عملاء إدارة الحالات في SeaX."/>

*واجهة جهات اتصال عملاء إدارة الحالات في SeaX.*
</center>

بالإضافة إلى إدارة معلومات الحالة، نوفر أيضًا إدارة جهات الاتصال لتخزين معلومات عملائك وربط حالات العملاء معًا. كما هو الحال مع الحالات، يمكنك تخزين ملاحظات حول العملاء وتجميعهم حسب التسميات لتتبع من يتصل بمركز الاتصال الخاص بك بالضبط.

## تفاعلات العملاء المرتبطة

<center>
<img src="/images/blog/23-seax-case-management/4-recording.png" alt="قم بتضمين تسجيلات مكالماتك مباشرة في الحالة المرتبطة."/>

*قم بتضمين تسجيلات مكالماتك مباشرة في الحالة المرتبطة.*
</center>

ترتبط كل حالة بجهة الاتصال المرتبطة، ولكن يمكننا أيضًا ربط المكالمات الفردية بالحالة المرتبطة أيضًا. باستخدام وظيفة "تضمين تسجيل المهمة"، يمكنك إرفاق تسجيل المكالمة مباشرة بالحالة، مما يسمح بالمراجعة المستقبلية لما حدث بالضبط في كل تفاعل عميل مرتبط.

## حقول قابلة للتخصيص

<center>
<img src="/images/blog/23-seax-case-management/5-custom-fields.png" alt="حدد حقول بيانات مخصصة لتخزين معلومات العميل والحالة المهمة بالنسبة لك."/>

*حدد حقول بيانات مخصصة لتخزين معلومات العميل والحالة المهمة بالنسبة لك.*
</center>

نحن ندرك أن كل شركة فريدة من نوعها، وأن كل مركز اتصال سيحتاج إلى جمع أنواع مختلفة من المعلومات في حالاته. لذلك، يوفر نظام إدارة الحالات في SeaX المجموعة الأساسية من حقول البيانات المهمة، مع توفير وظيفة حقل مخصص حتى تتمكن من إضافة حقول بيانات إضافية لكل من الحالات وجهات اتصال العملاء لجمع أي معلومات تحتاجها في مركز الاتصال الخاص بك.

<center>
<img src="/images/blog/23-seax-case-management/6-custom-fields.png" alt="الوصول إلى الحقول المخصصة مباشرة في بطاقات الحالة وجهات الاتصال."/>

*الوصول إلى الحقول المخصصة مباشرة في بطاقات الحالة وجهات الاتصال.*
</center>

## متابعة آلية للحالات

<center>
<img src="/images/blog/23-seax-case-management/7-sms.png" alt="أتمتة الرسائل لجمع حالة الحالة ودرجات رضا العملاء من العملاء."/>

*أتمتة الرسائل لجمع حالة الحالة ودرجات رضا العملاء من العملاء.*
</center>

هناك عدد من تفاعلات العملاء الصغيرة المتكررة التي يجب القيام بها في مركز الاتصال لضمان معالجة الحالات بشكل صحيح. يمكن لنظام إدارة الحالات في SeaX أتمتة هذه المحادثات نيابة عنك، حتى يتمكن وكلاؤك من التركيز على المشكلات الأكثر تعقيدًا. بنقرة زر واحدة، يمكنك إرسال رسالة إلى عميل للتحقق من حالة حالة مفتوحة لفترة طويلة أو طلب رد على استبيان رضا العملاء، وسيقوم النظام تلقائيًا بتحديث معلومات حالته بناءً
على رده.

## لوحة تحكم للمسؤول

<center>
<img src="/images/blog/23-seax-case-management/8-admin.png" alt="تحكم في المعلومات الموجودة في نظام إدارة الحالات الخاص بك باستخدام لوحة معلومات المسؤول."/>

*تحكم في المعلومات الموجودة في نظام إدارة الحالات الخاص بك باستخدام لوحة معلومات المسؤول.*
</center>

إن تخزين المعلومات حول الحالات في مركز الاتصال الخاص بك شيء، وإدارة الحالات في مركز الاتصال الخاص بك شيء آخر. يوفر نظام إدارة الحالات في SeaX لوحة تحكم للمسؤول حتى تتمكن من القيام بذلك بالضبط. من هنا يمكنك مراقبة جميع الحالات في نظامك والتعمق في التفاصيل لتحديد أي منها يحتاج إلى اهتمام. يمكنك الفرز حسب النطاق الزمني أو الوكيل، أو إرسال رسائل تحقق من الحالة تلقائيًا، أو البحث عن حالات بعلامة معينة، كل ما هو ضروري لإدارة حالاتك.

## ندوة عبر الإنترنت

إذا كنت ترغب في رؤية شرح أكثر تعمقًا لنظام إدارة الحالات وكيفية تكامله مع منصة SeaX، فيرجى مشاهدة ندوتنا عبر الإنترنت حول هذا الموضوع:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/xwZla3ftWLk" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

شكرًا لك على الوقت الذي قضيته في القراءة عن كيفية دعم نظام إدارة الحالات في SeaX لوكلائك أثناء تفاعلهم مع عملائك. يرجى ترقب تدوينتنا التالية، والتي ستتعمق في عملية إرسال رسائل نصية قصيرة مجمعة باستخدام منصة SeaX. إذا كنت مهتمًا بمعرفة المزيد على الفور، فاملأ [نموذج حجز عرض توضيحي](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) لإلقاء نظرة مباشرة على منصة SeaX.
`;export{e as default};
