const e=`---
title: "SeaX Case Management: کنترل ردیابی پرونده مرکز تماس خود را در دست بگیرید"
metatitle: "SeaX Case Management: تعاملات مشتری خود را ردیابی کنید"
date: 2022-08-17 22:28:15+00:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sarah Reid
description: "در این پست، ما ادغام‌های هوش مصنوعی با مدیریت پرونده را بررسی می‌کنیم که ابزارهایی را برای ردیابی و ثبت تعاملات با مشتریان شما در SeaX به عوامل شما می‌دهد."
weight: 1
tags:
  - SeaX
image: images/blog/23-seax-case-management/0-main.png
canonicalURL: /blog/seax-case-management/
url: /blog/seax-case-management/
---

*در پست وبلاگ قبلی ما، [SeaX KB: یک پایگاه دانش که قبل از پرسیدن پاسخ می‌دهد](https://seasalt.ai/blog/22-seax-knowledge-base/)، ما نشان دادیم که چگونه پایگاه دانش داخلی Seasalt.ai اطلاعات شرکت شما را مستقیماً در دسترس عوامل شما قرار می‌دهد و کارایی و دقت را در مرکز تماس شما افزایش می‌دهد. در این پست، ما به موضوع ادغام‌های هوش مصنوعی با سیستم مدیریت پرونده SeaX ادامه می‌دهیم که ابزارهای قدرتمندی را برای ردیابی و ثبت تعاملات با مشتریان شما مستقیماً در رابط SeaX به عوامل شما می‌دهد.*

# فهرست مطالب
- [تیکتینگ در مقابل مدیریت پرونده](#ticketing-vs-case-management)
- [مدیریت پرونده SeaX](#seax-case-management)
    - [رابط کاربری تعبیه شده برای عوامل زنده](#embedded-user-interface-for-live-agents)
    - [جستجوی خودکار قدرتمند](#powerful-automatic-search)
    - [مدیریت تماس یکپارچه](#integrated-contact-management)
    - [تعاملات مشتری مرتبط](#linked-customer-interactions)
    - [فیلدهای قابل تنظیم](#customizable-fields)
    - [پیگیری خودکار پرونده](#automated-case-follow-up)
    - [داشبورد مدیر](#administrator-dashboard)
    - [وبینار](#webinar)

# تیکتینگ در مقابل مدیریت پرونده

اصطلاحات «تیکتینگ» و «مدیریت پرونده» اغلب به طور متناوب برای اشاره به سیستمی استفاده می‌شوند که در آن جزئیات یک مسئله در یک شیء داده ذخیره می‌شود، که سپس در طول حل مسئله استفاده و ارجاع می‌شود. با این حال، تفاوت اصلی این دو اصطلاح معمولاً در پیچیدگی سیستم است.

سیستم‌های «تیکتینگ» معمولاً ساده‌تر هستند، جایی که تیکت برای ذخیره جزئیات یک مسئله خاص استفاده می‌شود و پس از حل مسئله دور انداخته یا بایگانی می‌شود. سیستم‌های «مدیریت پرونده» معمولاً پیچیده‌تر هستند و کارهای بیشتری از صرفاً ردیابی عمر یک مسئله انجام می‌دهند. پرونده‌ها اغلب به چیزهای دیگر، مانند سایر پرونده‌های مشابه یا مشتری که پرونده را باز کرده است، مرتبط می‌شوند تا بتوان از روندها برای حل مسائل فراگیرتر استفاده کرد. اطلاعات مربوط به تعاملات متعدد با مشتری در طول مسئله می‌تواند در داده‌های پرونده ذخیره شود، بنابراین هر عامل بعدی که پرونده را مدیریت می‌کند، دقیقاً می‌داند چه اتفاقی در حال رخ دادن است. یک پرونده می‌تواند بسته شود و سپس دوباره باز شود اگر مشتری با یک مسئله تکراری بازگردد. مدیریت پرونده ابزاری قدرتمندتر و انعطاف‌پذیرتر برای پیگیری وظایف و تعاملات پیچیده‌تر در یک مرکز تماس است.

# مدیریت پرونده SeaX

مدیریت پرونده ما بر اساس اصل سهولت استفاده در هنگام تعامل با مشتریان است. آخرین چیزی که یک عامل هنگام کمک به مشتری به آن نیاز دارد، نگرانی در مورد به خاطر سپردن همه چیز برای یادداشت برداری پس از تماس، یا مجبور شدن به جابجایی بین چندین برنامه مختلف فقط برای صحبت با مشتری، یافتن اطلاعات موجود و یادداشت برداری از اطلاعات جدید است.

اگر می‌خواهید مستقیماً به یک نمایش بروید، می‌توانید ویدیوی کوتاه دمو مدیریت پرونده SeaX ما را تماشا کنید:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/yf1REVZtRa8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

## رابط کاربری تعبیه شده برای عوامل زنده

<center>
<img src="/images/blog/23-seax-case-management/1-intro.png" alt="اولین نگاه به رابط کاربری مدیریت پرونده SeaX."/>

*اولین نگاه به رابط کاربری مدیریت پرونده SeaX.*
</center>

از آنجایی که تمرکز ما بر دسترسی عوامل به مدیریت پرونده بود، سیستم مدیریت پرونده SeaX به طور بومی در SeaX ادغام شده است. عوامل می‌توانند پرونده‌های جدید اضافه کنند، پرونده‌های موجود را ویرایش کنند و تمام یادداشت‌های لازم را در همان رابطی که تماس‌ها و پیام‌ها را مدیریت می‌کنند، یادداشت کنند. بدون جابجایی پنجره‌ها، بدون ورق زدن تب‌ها، بدون پیمایش در صفحات وب تو در تو.

## جستجوی خودکار قدرتمند

<center>
<img src="/images/blog/23-seax-case-management/2-search.png" alt="رابط جستجوی مدیریت پرونده SeaX."/>

*رابط جستجوی مدیریت پرونده SeaX.*
</center>

جستجوی سریع و دقیق پرونده ما به شما امکان می‌دهد تا بر اساس هر جنبه‌ای از اطلاعات پرونده خود، از جمله جستجوی متن کامل یادداشت‌های عامل و فیلتر کردن بر اساس فیلدهای داده سفارشی خود، جستجو و مرتب‌سازی کنید.

## مدیریت تماس یکپارچه

<center>
<img src="/images/blog/23-seax-case-management/3-contacts.png" alt="رابط تماس مشتری مدیریت پرونده SeaX."/>

*رابط تماس مشتری مدیریت پرونده SeaX.*
</center>

علاوه بر مدیریت اطلاعات پرونده، ما همچنین مدیریت تماس را برای ذخیره اطلاعات مشتری شما و پیوند دادن پرونده‌های مشتریان به یکدیگر ارائه می‌دهیم. همانند پرونده‌ها، می‌توانید یادداشت‌هایی را در مورد مشتریان ذخیره کرده و آنها را بر اساس برچسب‌ها گروه‌بندی کنید تا دقیقاً پیگیری کنید که چه کسی با مرکز تماس شما تماس می‌گیرد.

## تعاملات مشتری مرتبط

<center>
<img src="/images/blog/23-seax-case-management/4-recording.png" alt="ضبط تماس‌های خود را مستقیماً در پرونده مرتبط جاسازی کنید."/>

*ضبط تماس‌های خود را مستقیماً در پرونده مرتبط جاسازی کنید.*
</center>

هر پرونده به تماس مرتبط متصل است، اما ما همچنین می‌توانیم تماس‌های فردی را نیز به پرونده مرتبط متصل کنیم. با عملکرد «جاسازی ضبط وظیفه»، می‌توانید ضبط تماس را مستقیماً به پرونده پیوست کنید، که امکان بررسی دقیق آنچه در هر تعامل مشتری مرتبط رخ داده است را در آینده فراهم می‌کند.

## فیلدهای قابل تنظیم

<center>
<img src="/images/blog/23-seax-case-management/5-custom-fields.png" alt="فیلدهای داده سفارشی را برای ذخیره اطلاعات مشتری و پرونده که برای شما مهم است، تعریف کنید."/>

*فیلدهای داده سفارشی را برای ذخیره اطلاعات مشتری و پرونده که برای شما مهم است، تعریف کنید.*
</center>

ما درک می‌کنیم که هر شرکتی منحصر به فرد است و هر مرکز تماسی نیاز به جمع‌آوری انواع مختلفی از اطلاعات در پرونده‌های خود دارد. بنابراین، سیستم مدیریت پرونده SeaX مجموعه اصلی فیلدهای داده مهم را فراهم می‌کند، در حالی که یک عملکرد فیلد سفارشی را نیز ارائه می‌دهد تا بتوانید فیلدهای داده اضافی را به پرونده‌ها و مخاطبین مشتری اضافه کنید تا هر اطلاعاتی را که در مرکز تماس خود نیاز دارید، جمع‌آوری کنید.

<center>
<img src="/images/blog/23-seax-case-management/6-custom-fields.png" alt="به فیلدهای سفارشی خود مستقیماً در کارت‌های پرونده و تماس دسترسی پیدا کنید."/>

*به فیلدهای سفارشی خود مستقیماً در کارت‌های پرونده و تماس دسترسی پیدا کنید.*
</center>

## پیگیری خودکار پرونده

<center>
<img src="/images/blog/23-seax-case-management/7-sms.png" alt="پیام‌ها را برای جمع‌آوری وضعیت پرونده و امتیازات CSAT از مشتریان خودکار کنید."/>

*پیام‌ها را برای جمع‌آوری وضعیت پرونده و امتیازات CSAT از مشتریان خودکار کنید.*
</center>

تعدادی تعاملات کوچک و تکراری با مشتری وجود دارد که باید در یک مرکز تماس انجام شود تا اطمینان حاصل شود که پرونده‌ها به درستی رسیدگی می‌شوند. سیستم مدیریت پرونده SeaX می‌تواند این مکالمات را برای شما خودکار کند، تا عوامل شما بتوانند بر روی مسائل پیچیده‌تر تمرکز کنند. با یک کلیک دکمه، می‌توانید پیامی به مشتری ارسال کنید تا وضعیت پرونده‌ای را که مدت‌هاست باز است بررسی کنید یا پاسخی را در نظرسنجی رضایت مشتری درخواست کنید، و سیستم به طور خودکار اطلاعات پرونده آنها را بر اساس پاسخ آنها به‌روزرسانی خواهد کرد.

## داشبورد مدیر

<center>
<img src="/images/blog/23-seax-case-management/8-admin.png" alt="اطلاعات را در سیستم مدیریت پرونده خود با داشبورد مدیر کنترل کنید."/>

*اطلاعات را در سیستم مدیریت پرونده خود با داشبورد مدیر کنترل کنید.*
</center>

ذخیره اطلاعات در مورد پرونده‌ها در مرکز تماس شما یک چیز است و مدیریت پرونده‌ها در مرکز تماس شما چیز دیگری است. سیستم مدیریت پرونده SeaX یک داشبورد مدیر را فراهم می‌کند تا بتوانید این کار را انجام دهید. از اینجا می‌توانید تمام پرونده‌های موجود در سیستم خود را نظارت کرده و به جزئیات بپردازید تا مشخص کنید کدام یک نیاز به توجه دارند. می‌توانید بر اساس محدوده زمانی یا عامل مرتب‌سازی کنید، پیام‌های بررسی وضعیت خودکار ارسال کنید، یا پرونده‌ها را با یک برچسب خاص جستجو کنید، هر آنچه برای مدیریت پرونده‌های شما لازم است.

## وبینار

اگر می‌خواهید یک راهنمای جامع‌تر از سیستم مدیریت پرونده و نحوه ادغام آن با پلتفرم SeaX را مشاهده کنید، لطفاً وبینار ما را در این زمینه تماشا کنید:

<iframe width="85%" height="450px" src="https://www.youtube.com/embed/xwZla3ftWLk" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

از اینکه وقت گذاشتید و در مورد نحوه پشتیبانی سیستم مدیریت پرونده SeaX از عوامل شما در هنگام تعامل با مشتریان خود مطالعه کردید، سپاسگزاریم. لطفاً منتظر پست وبلاگ بعدی ما باشید که به بررسی فرآیند ارسال پیامک انبوه با استفاده از پلتفرم SeaX می‌پردازد. اگر علاقه‌مند به کسب اطلاعات بیشتر هستید، [فرم رزرو دمو](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) ما را پر کنید تا از نزدیک با پلتفرم SeaX آشنا شوید.
`;export{e as default};
