const n=`---
title: "پیامک انبوه SeaX: برای ارتباط سریعتر و موثرتر با مشتری"
metatitle: "پیامک انبوه SeaX: برای ارتباط سریعتر و موثرتر با مشتری"
date: 2022-09-09 11:05:22-07:00
modified_date: 2025-07-28T16:03:25.123456
draft: false
author: Amy Chen, Kim Dodds, Sarah Reid
description: "در این وبلاگ، ما نشان خواهیم داد که چگونه ویژگی پیامک انبوه SeaX به نمایندگان اجازه می دهد تا به طور فعال پیام های خروجی را از طریق متن ارسال کنند."
weight: 1
tags:
  - SeaX
image: images/blog/24-seax-bulk-sms/thumbnail.png
canonicalURL: /blog/seax-bulk-sms/
url: /blog/seax-bulk-sms/
---


*در پست های وبلاگ قبلی ما، برخی از ویژگی های کلیدی SeaX (از جمله [هوش صوتی](https://seasalt.ai/blog/21-seax-voice-intelligence/)، [پایگاه دانش](https://seasalt.ai/blog/22-seax-knowledge-base/) و [مدیریت پرونده](https://seasalt.ai/blog/23-seax-case-management/)) را بررسی کردیم که به نمایندگان کمک می کند تا تماس ها و پیام های ورودی را بهتر مدیریت کنند. در این وبلاگ، ما نشان خواهیم داد که چگونه ویژگی پیامک انبوه SeaX به نمایندگان اجازه می دهد تا به طور فعال پیام های خروجی را از طریق متن ارسال کنند، که گیرندگان نشان داده شده است که زودتر و به طور مداوم تری نسبت به ارتباطات ایمیل سنتی باز می کنند.*

# فهرست مطالب
- [پیامک در مقابل ایمیل](#sms-vs-email)
- [استانداردهای 10DLC](#10dlc-standards)
- [پیامک انبوه SeaX](#seax-bulk-sms)
    - [بارگذاری مخاطب](#contact-upload)
    - [ترکیب پیام](#message-composition)
    - [تخمین هزینه](#cost-estimate)
    - [پیش نمایش پیام انبوه](#bulk-message-preview)
    - [نظارت بر پیشرفت کمپین](#campaign-progress-monitoring)
    - [چت پیام ورودی](#incoming-message-chat)
- [بسته شدن](#closing)

# پیامک در مقابل ایمیل

ایمیل تمایل دارد که حالت ارتباطی بالفعل برای اکثر عملیات تجاری باشد. تا همین اواخر، پیام کوتاه (SMS) یک کانال ارتباطی پرکاربرد برای پیام رسانی تجاری انبوه نبود، علیرغم محبوبیت آن برای ارتباطات بین فردی روزمره. با این حال، در سال های اخیر، ارائه دهندگان ارتباطات ابری مانند Twilio کانال پیامک را با رسیدگی به جزئیات زیرساخت های مخابراتی و ارائه دهندگان خدمات در باطن، و ارائه یک API پیامک ساده به عنوان یک سرویس به مشتریان، برای مشاغل بسیار در دسترس تر کرده اند. در حالی که ایمیل ممکن است محبوب ترین کانال برای تجارت باقی بماند، پیامک می تواند مکمل منحصر به فردی برای ارتباطات ایمیل سنتی باشد.

<center>
<img src="/images/blog/24-seax-bulk-sms/1-pros-cons.png" alt="برخی از مزایا و معایب پیامک برای ارتباطات تجاری."/>

*برخی از مزایا و معایب پیامک برای ارتباطات تجاری.*
</center>

اما چرا اگر ایمیل ثابت شده است که موفقیت آمیز است، اصلاً از پیامک استفاده کنیم؟ اگر کمپین های بازاریابی را به عنوان مثال در نظر بگیریم، پاسخ کوتاه این است: در حالی که نرخ باز شدن برای یک کمپین ایمیل فقط 20٪ است، میانگین نرخ باز شدن برای پیامک می تواند تا *98٪* باشد - ناگفته نماند که پیام های متنی تمایل به دریافت پاسخ های بیشتری دارند. علاوه بر این، پیام های متنی معمولاً ظرف 90 ثانیه پس از دریافت باز می شوند، در حالی که ایمیل ها معمولاً در حدود 90 دقیقه باز می شوند. آخرین اما نه کم اهمیت، پیامک دارای نرخ کلیک متوسط ​​حدود 19٪ است که به طور قابل توجهی بالاتر از 3.2٪ برای ایمیل است ([منبع](https://manychat.com/blog/sms-vs-email-marketing-2021/)).

به طور کلی، پیام های متنی سریعتر و بیشتر از ایمیل ها باز می شوند - شاید به این دلیل که متن ها همیشه مستقیماً به گیرنده در هر کجا که هستند تحویل داده می شوند، چه وای فای داشته باشند یا نه. همچنین از آنجا که پیامک معمولاً برای پیام های شخصی استفاده می شود و کمتر برای ارتباطات تجاری، گیرندگان ممکن است متن ها را مهمتر یا قابل توجه تر از ایمیل ها بدانند.

پس چرا همه از پیامک استفاده نمی کنند؟؟ خوب، البته مزایا و معایبی وجود دارد. طبیعتاً پیامک به طور قابل توجهی گرانتر از ایمیل است زیرا برای تحویل پیام ها به زیرساخت های مخابراتی و ارائه دهندگان خدمات (مانند Verizon، AT&T و غیره) متکی است. علاوه بر این، پیام های متنی دارای محدودیت سختی در حدود 900 کاراکتر و یک پیوست واحد هستند (که البته هزینه اضافی دارد). بنابراین در کل، در حالی که پیامک ممکن است یک روش ارتباطی به طور قابل توجهی موثرتر باشد، معامله این است که مشاغل باید در مورد محتوایی که ارسال می کنند انتخابی تر باشند تا مطمئن شوند که مقرون به صرفه هستند.

با این حال، هیچ دلیلی وجود ندارد که پیامک و ایمیل نباید با هم استفاده شوند! هر کانال مزایا و معایب خاص خود را دارد، بنابراین یک کسب و کار می تواند با استفاده از نقاط قوت هر کانال اطمینان حاصل کند که موثرترین ارتباطات را ارسال می کند.

# استانداردهای 10DLC

برای پیام رسانی پیام کوتاه A2P (برنامه به شخص) با حجم بالا، اپراتورهای ایالات متحده از کدهای طولانی 10 رقمی استاندارد یا 10DLC استفاده می کنند. قبل از شروع یک کمپین پیامک انبوه، به شما توصیه می کنیم در مورد 10DLC و برنامه های کاربردی آن [اینجا](https://support.twilio.com/hc/en-us/articles/1260800720410-What-is-A2P-10DLC-) بیشتر بخوانید.

# پیامک انبوه SeaX

سرویس پیامک انبوه SeaX به شما امکان می دهد به راحتی مخاطبین/سرنخ های خود را بارگذاری کنید، پیامک (ما از MMS - پیام های چندرسانه ای نیز پشتیبانی می کنیم) را به صورت انبوه ارسال کنید و پاسخ های ورودی را مدیریت کنید. برای دیدن چند مرحله ساده برای شروع اولین کمپین پیامک انبوه خود، ادامه مطلب را بخوانید.

## بارگذاری مخاطب

<center>
<img src="/images/blog/24-seax-bulk-sms/2-contact-upload.png" alt="در حال بارگذاری لیستی از مخاطبین در پیامک انبوه SeaX."/>

*در حال بارگذاری لیستی از مخاطبین در پیامک انبوه SeaX.*
</center>

اولین قدم بارگذاری مخاطبین و سرنخ ها است. ابتدا، مخاطبین کمپین پیامک خود را در یک فایل csv سازماندهی کنید. علاوه بر فیلدهای مورد نیاز، \`phone_number\` و \`name\`، می توانید فیلدهای دیگری اضافه کرده و از آنها در بدنه پیام استفاده کنید. به عنوان مثال، می توانید بدنه پیام را به صورت پویا تغییر دهید تا نام گیرنده را بر اساس فیلد \`name\` برای هر مخاطب شامل شود.

بعد، به سادگی سرویس پیامک انبوه را در SeaX باز کرده و برای بارگذاری مخاطبین خود، «وارد کردن» را فشار دهید. ما تمام مخاطبین قبلی شما را در لیست گیرندگان ذخیره می کنیم تا بتوانید به راحتی کمپین های بعدی را راه اندازی کنید.

## ترکیب پیام

<center>
<img src="/images/blog/24-seax-bulk-sms/3-message-draft.png" alt="در حال نوشتن یک پیامک جدید با پیامک انبوه SeaX."/>

*در حال نوشتن یک پیامک جدید.*
</center>

مرحله بعدی این است که به کمپین خود یک نام بدهید و پیام را بنویسید. پیامک انبوه به شما امکان می دهد به تمام اطلاعات تماس ذخیره شده در فایل csv/excel خود دسترسی داشته باشید. به عنوان مثال، اگر در لیست مخاطبین فیلدی به نام \`name\` دارید، می توانید \`{name}\` را در پیام تایپ کنید و پیام به طور خودکار نام هر مخاطب را در بدنه پیام ارائه می دهد.

## تخمین هزینه

<center>
<img src="/images/blog/24-seax-bulk-sms/4-cost-estimate.png" alt="انتخاب شماره تلفن های ارسال کننده و دریافت تخمین هزینه کمپین با پیامک انبوه SeaX."/>

*انتخاب شماره تلفن های ارسال کننده و دریافت تخمین هزینه کمپین.*
</center>

بعد، شماره تلفنی را که می خواهید برای ارسال پیام های خروجی استفاده کنید، انتخاب کنید. اگر هنوز شماره تلفن ندارید، می توانید روی «نقل قول برای یک شماره جدید» در گوشه سمت راست بالا کلیک کنید تا درخواست خرید را ارسال کنید. تیم ما می تواند به شما در خرید شماره های 10DLC جدید کمک کند.

همچنین می توانید قیمت واحد تخمینی کمپین را پیش نمایش کنید. توجه داشته باشید که هم ارسال و هم دریافت پیامک/MMS هزینه دارد، بنابراین مطمئن شوید که بودجه خود را بر این اساس تنظیم کرده اید.

## پیش نمایش پیام انبوه

<center>
<img src="/images/blog/24-seax-bulk-sms/5-preview.png" alt="پیش نمایش یک کمپین پیامک انبوه قبل از ارسال با SeaX."/>

*پیش نمایش یک کمپین پیامک انبوه قبل از ارسال.*
</center>

می توانید پیام های انبوه را قبل از ارسال پیش نمایش کنید. تأیید بدنه پیام، شماره تلفن گیرندگان و شماره تلفن فرستنده حیاتی است. پس از راه اندازی کمپین، امکان پس گرفتن پیام ها وجود نخواهد داشت. در این صفحه، می توانید 3 پیام اول کمپین خود را که مربوط به 3 مخاطب اول لیست شما است، پیش نمایش کنید.

## نظارت بر پیشرفت کمپین

<center>
<img src="/images/blog/24-seax-bulk-sms/6-monitor.png" alt="نظارت بر پیشرفت یک کمپین پیامک انبوه با SeaX."/>

*نظارت بر پیشرفت یک کمپین پیامک انبوه.*
</center>

در نهایت، می توانید بنشینید و پیشرفت کمپین را در داشبورد پیامک انبوه نظارت کنید. صفحه به طور خودکار بازخوانی می شود و وضعیت کمپین را به روز می کند. می توانید وضعیت های تحویل پیام، نرخ موفقیت/تحویل، هزینه های تخمینی و همچنین نرخ پاسخ را در این صفحه مشاهده کنید.

## چت پیام ورودی

<center>
<img src="/images/blog/24-seax-bulk-sms/7-chat.png" alt="رسیدگی به پاسخ های ورودی از یک کمپین پیامک انبوه با SeaX."/>

*رسیدگی به پاسخ های ورودی از یک کمپین پیامک انبوه.*
</center>

درست مانند تمام ویژگی های SeaX، ما در تلاشیم تا نمایندگان یا مدیران کمپین را برای رسیدگی به درخواست ها/مشکلات ورودی توانمند کنیم - پیامک انبوه به SeaX اجازه می دهد تا تلاش های بازاریابی خروجی را نیز مدیریت کند. پس از راه اندازی کمپین، می توانید تمام پاسخ های ورودی را در پنجره چت نشان داده شده در زیر مدیریت کنید.

# بسته شدن

از اینکه وقت گذاشتید و در مورد اینکه چگونه سیستم پیامک انبوه SeaX به نمایندگان امکان می دهد علاوه بر رسیدگی به درخواست های پیام ورودی، ارتباطات خروجی را نیز ارسال کنند، مطالعه کردید، سپاسگزاریم. منتظر بخش بعدی در سری وبلاگ ما باشید که برخی از ابزارهای مدیریت و تجزیه و تحلیل داخلی پلتفرم SeaX را پوشش می دهد. اگر علاقه مند به کسب اطلاعات بیشتر هستید، فرم [رزرو نسخه ی نمایشی](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) ما را پر کنید تا نگاهی دست اول به پلتفرم SeaX بیندازید.
`;export{n as default};
