const n=`---
title: "SeaX बल्क एसएमएस: तेज़, अधिक प्रभावी ग्राहक विस्तार"
metatitle: "SeaX बल्क एसएमएस: तेज़, अधिक प्रभावी ग्राहक विस्तार"
date: 2022-09-09 11:05:22-07:00
modified_date: 2024-12-19 10:30:00+00:00
draft: false
author: Amy Chen, Kim Dodds, Sarah Reid
description: "इस ब्लॉग में, हम दिखाएंगे कि SeaX का बल्क एसएमएस फीचर एजेंटों को टेक्स्ट के माध्यम से आउटबाउंड संदेश भेजने में कैसे सक्षम बनाता है।"
weight: 1
tags:
  - SeaX
image: images/blog/24-seax-bulk-sms/thumbnail.png
canonicalURL: /blog/seax-bulk-sms/
url: /blog/seax-bulk-sms/
---


*हमारे पिछले ब्लॉग लेखों में, हमने SeaX के कुछ मुख्य फीचर्स (जिसमें [वॉइस इंटेलिजेंस](https://seasalt.ai/blog/21-seax-voice-intelligence/), [नॉलेज बेस](https://seasalt.ai/blog/22-seax-knowledge-base/) और [केस मैनेजमेंट](https://seasalt.ai/blog/23-seax-case-management/) शामिल हैं) का परिचय दिया, जो एजेंटों को आने वाले कॉल और संदेशों को बेहतर तरीके से संभालने में मदद करते हैं। इस ब्लॉग में, हम दिखाएंगे कि SeaX का बल्क एसएमएस फीचर एजेंटों को टेक्स्ट के माध्यम से आउटबाउंड संदेश भेजने में कैसे सक्षम बनाता है, और इन संदेशों के प्राप्तकर्ता पारंपरिक ईमेल संचार की तुलना में तेज़ और अधिक निरंतर रूप से खोलने के लिए सिद्ध होते हैं।*

# सामग्री
- [एसएमएस बनाम ईमेल](#sms-vs-email)
- [10DLC मानक](#10dlc-standards)
- [SeaX बल्क एसएमएस](#seax-bulk-sms)
    - [संपर्क अपलोड](#contact-upload)
    - [संदेश लेखन](#message-composition)
    - [लागत अनुमान](#cost-estimate)
    - [बल्क संदेश पूर्वावलोकन](#bulk-message-preview)
    - [अभियान प्रगति निगरानी](#campaign-progress-monitoring)
    - [आने वाले संदेश चैट](#incoming-message-chat)
- [समापन](#closing)

# एसएमएस बनाम ईमेल

ईमेल अक्सर अधिकांश व्यावसायिक संचालन के लिए डिफ़ॉल्ट संचार मोड होता है। हाल ही तक, एसएमएस (SMS) दैनिक पारस्परिक संचार में लोकप्रिय होने के बावजूद, बल्क व्यावसायिक संदेश वितरण के लिए व्यापक रूप से उपयोग नहीं किया जाता था। हालांकि, हाल के वर्षों में, Twilio जैसे क्लाउड संचार प्रदाताओं ने बैकएंड दूरसंचार बुनियादी ढांचे और सेवा प्रदाताओं की जटिलताओं को संभालकर और सरल SMS API को ग्राहक सेवा के रूप में प्रदान करके SMS चैनल को उद्यमों के लिए अधिक सुलभ बना दिया है। जबकि ईमेल अभी भी उद्यमों के लिए सबसे लोकप्रिय चैनल हो सकता है, SMS पारंपरिक ईमेल संचार के लिए एक अनूठा पूरक प्रदान कर सकता है।

<center>
<img src="/images/blog/24-seax-bulk-sms/1-pros-cons.png" alt="व्यावसायिक संचार में SMS के कुछ फायदे और नुकसान।"/>

*व्यावसायिक संचार में SMS के कुछ फायदे और नुकसान।*
</center>

लेकिन, यदि ईमेल सफल साबित हो चुका है, तो SMS का उपयोग क्यों करें? यदि हम मार्केटिंग अभियान को उदाहरण के रूप में लें, तो संक्षिप्त उत्तर है: जबकि ईमेल अभियानों की खुलने की दर केवल 20% है, SMS की औसत खुलने की दर *98%* तक हो सकती है—यह कहना नहीं है कि SMS अक्सर अधिक प्रतिक्रियाएं प्राप्त करते हैं। इसके अलावा, SMS आमतौर पर प्राप्त होने के 90 सेकंड के भीतर खोले जाते हैं, जबकि ईमेल आमतौर पर प्राप्त होने के लगभग 90 मिनट बाद खोले जाते हैं। अंत में लेकिन कम महत्वपूर्ण नहीं, SMS की औसत क्लिक-थ्रू दर लगभग 19% है, जो ईमेल के 3.2% से काफी अधिक है ([स्रोत](https://manychat.com/blog/sms-vs-email-marketing-2021/))।

सामान्य तौर पर, SMS ईमेल की तुलना में तेज़ और अधिक बार खोले जाते हैं—यह संभवतः इसलिए है क्योंकि SMS हमेशा सीधे प्राप्तकर्ता को वितरित किए जाते हैं, चाहे वे कहीं भी हों, चाहे उनके पास Wi-Fi हो या नहीं। इसके अतिरिक्त, चूंकि SMS आमतौर पर व्यक्तिगत संदेशों के लिए उपयोग किए जाते हैं और कम व्यावसायिक संचार के लिए, प्राप्तकर्ता SMS को ईमेल की तुलना में अधिक महत्वपूर्ण या अधिक सार्थक मान सकते हैं।

तो हर कोई SMS का उपयोग क्यों नहीं करता? निश्चित रूप से, फायदे और नुकसान दोनों हैं। स्वाभाविक रूप से, SMS ईमेल की तुलना में बहुत अधिक महंगा है क्योंकि यह संदेश वितरण के लिए दूरसंचार बुनियादी ढांचे और सेवा प्रदाताओं (जैसे Verizon, AT&T, आदि) पर निर्भर करता है। इसके अतिरिक्त, SMS में लगभग 900 वर्णों की कठोर सीमा और एक एकल अनुलग्नक (जो निश्चित रूप से अतिरिक्त शुल्क लगता है) होता है। इसलिए, कुल मिलाकर, जबकि SMS एक अधिक प्रभावी संचार माध्यम हो सकता है, लेकिन व्यापार-बंद में, उद्यमों को अपनी लागत-प्रभावशीलता सुनिश्चित करने के लिए अधिक चयनात्मक रूप से सामग्री भेजनी चाहिए।

यह कहा जा रहा है, कोई कारण नहीं है कि SMS और ईमेल एक साथ उपयोग नहीं किए जा सकते! प्रत्येक चैनल की अपनी ताकत और कमजोरियां हैं, इसलिए उद्यम प्रत्येक चैनल के फायदों का लाभ उठाकर यह सुनिश्चित कर सकते हैं कि वे सबसे प्रभावी संचार भेज रहे हैं।

# 10DLC मानक

बड़े पैमाने के A2P (एप्लिकेशन-टू-पर्सन) SMS वितरण के लिए, अमेरिकी दूरसंचार कंपनियां मानकीकृत 10-अंकीय लंबे कोड, या 10DLC का उपयोग करती हैं। बल्क SMS अभियान शुरू करने से पहले, हम अनुशंसा करते हैं कि आप [यहां](https://support.twilio.com/hc/en-us/articles/1260800720410-What-is-A2P-10DLC-) 10DLC और इसके अनुप्रयोगों के बारे में अधिक पढ़ें।

# SeaX बल्क एसएमएस

SeaX का बल्क SMS सेवा आपको आसानी से संपर्कों/लीड्स को अपलोड करने, बल्क SMS भेजने (हम MMS - मल्टीमीडिया संदेश भी समर्थन करते हैं), और प्राप्त प्रतिक्रियाओं का प्रबंधन करने में सक्षम बनाता है। अपने पहले बल्क SMS अभियान को शुरू करने के कुछ सरल चरणों के बारे में जानने के लिए पढ़ना जारी रखें।

## संपर्क अपलोड

<center>
<img src="/images/blog/24-seax-bulk-sms/2-contact-upload.png" alt="SeaX बल्क SMS में संपर्क सूची अपलोड करें।"/>

*SeaX बल्क SMS में संपर्क सूची अपलोड करें।*
</center>

पहला कदम संपर्कों और लीड्स को अपलोड करना है। सबसे पहले, अपने SMS अभियान संपर्कों को CSV फ़ाइल में व्यवस्थित करें। आवश्यक फ़ील्ड \`phone_number\` और \`name\` के अलावा, आप अन्य फ़ील्ड जोड़ सकते हैं और संदेश सामग्री में उनका उपयोग कर सकते हैं। उदाहरण के लिए, आप प्रत्येक संपर्क के \`name\` फ़ील्ड के आधार पर संदेश सामग्री को गतिशील रूप से बदल सकते हैं ताकि प्राप्तकर्ता का नाम शामिल हो।

अगला, बस SeaX के तहत बल्क SMS सेवा खोलें और अपने संपर्कों को अपलोड करने के लिए "आयात" पर क्लिक करें। हम आपके सभी पिछले संपर्कों को प्राप्तकर्ता सूची में सहेजेंगे ताकि आप आसानी से बाद के अभियान शुरू कर सकें।

## संदेश लेखन

<center>
<img src="/images/blog/24-seax-bulk-sms/3-message-draft.png" alt="SeaX बल्क SMS का उपयोग करके नया SMS लिखें।"/>

*नया SMS लिखें।*
</center>

अगला कदम अपने अभियान का नाम रखना और संदेश लिखना है। बल्क SMS आपको CSV/Excel फ़ाइल में संग्रहीत सभी संपर्क जानकारी तक पहुंच की अनुमति देता है। उदाहरण के लिए, यदि आपकी संपर्क सूची में \`name\` नामक फ़ील्ड है, तो आप संदेश में \`{name}\` टाइप कर सकते हैं, और संदेश स्वचालित रूप से संदेश सामग्री में प्रत्येक संपर्क का नाम प्रस्तुत करेगा।

## लागत अनुमान

<center>
<img src="/images/blog/24-seax-bulk-sms/4-cost-estimate.png" alt="भेजने के लिए फोन नंबर चुनें और SeaX बल्क SMS का उपयोग करके अभियान लागत अनुमान प्राप्त करें।"/>

*भेजने के लिए फोन नंबर चुनें और अभियान लागत अनुमान प्राप्त करें।*
</center>

अगला, उस फोन नंबर को चुनें जिसका उपयोग आप आउटबाउंड संदेश भेजने के लिए करना चाहते हैं। यदि आपके पास अभी तक फोन नंबर नहीं है, तो आप खरीद अनुरोध जमा करने के लिए ऊपर दाएं कोने में "नया नंबर उद्धरण" पर क्लिक कर सकते हैं। हमारी टीम आपको नए 10DLC नंबर खरीदने में मदद कर सकती है।

आप अभियान का अनुमानित इकाई मूल्य भी पूर्वावलोकन कर सकते हैं। कृपया ध्यान दें कि SMS/मल्टीमीडिया संदेश भेजने और प्राप्त करने दोनों के लिए शुल्क लगता है, इसलिए कृपया तदनुसार बजट बनाएं।

## बल्क संदेश पूर्वावलोकन

<center>
<img src="/images/blog/24-seax-bulk-sms/5-preview.png" alt="भेजने से पहले SeaX का उपयोग करके बल्क SMS अभियान का पूर्वावलोकन करें।"/>

*भेजने से पहले SeaX का उपयोग करके बल्क SMS अभियान का पूर्वावलोकन करें।*
</center>

आप भेजने से पहले बल्क संदेश का पूर्वावलोकन कर सकते हैं। संदेश सामग्री, प्राप्तकर्ता फोन नंबर और प्रेषक फोन नंबर की पुष्टि करना महत्वपूर्ण है। एक बार जब आप अभियान शुरू करते हैं, तो संदेश वापस नहीं लिए जा सकते। इस पेज पर, आप अभियान के पहले 3 संदेशों का पूर्वावलोकन कर सकते हैं, जो आपकी सूची के पहले 3 संपर्कों से मेल खाते हैं।

## अभियान प्रगति निगरानी

<center>
<img src="/images/blog/24-seax-bulk-sms/6-monitor.png" alt="SeaX का उपयोग करके बल्क SMS अभियान की प्रगति की निगरानी करें।"/>

*SeaX का उपयोग करके बल्क SMS अभियान की प्रगति की निगरानी करें।*
</center>

अंत में, आप बैठकर बल्क SMS डैशबोर्ड पर अभियान की प्रगति की निगरानी कर सकते हैं। पेज स्वचालित रूप से रिफ्रेश होगा और अभियान स्थिति अपडेट करेगा। आप इस पेज पर संदेश वितरण स्थिति, सफलता/वितरण दर, अनुमानित लागत और प्रतिक्रिया दर देख सकते हैं।

## आने वाले संदेश चैट

<center>
<img src="/images/blog/24-seax-bulk-sms/7-chat.png" alt="SeaX का उपयोग करके बल्क SMS अभियान के आने वाले संदेश प्रतिक्रियाओं को संभालें।"/>

*SeaX का उपयोग करके बल्क SMS अभियान के आने वाले संदेश प्रतिक्रियाओं को संभालें।*
</center>

सभी SeaX फीचर्स की तरह, हम एजेंटों या अभियान प्रबंधकों को आने वाले अनुरोधों/समस्याओं को संभालने की क्षमता प्रदान करने का प्रयास करते हैं—बल्क SMS भी SeaX को आउटबाउंड मार्केटिंग कार्य को संभालने की अनुमति देता है। अभियान शुरू करने के बाद, आप नीचे दिखाए गए चैट विंडो में सभी आने वाले संदेश प्रतिक्रियाओं का प्रबंधन कर सकते हैं।

# समापन

SeaX बल्क SMS सिस्टम कैसे एजेंटों को आउटबाउंड संचार भेजने और आने वाले संदेश अनुरोधों को संभालने की क्षमता प्रदान करता है, इसे पढ़ने के लिए समय निकालने के लिए धन्यवाद। कृपया हमारी ब्लॉग श्रृंखला के अगले भाग पर ध्यान रखें, जिसमें SeaX प्लेटफॉर्म में निर्मित कुछ प्रबंधन और विश्लेषण उपकरण शामिल होंगे। यदि आप तुरंत अधिक जानकारी प्राप्त करने में रुचि रखते हैं, तो कृपया SeaX प्लेटफॉर्म का प्रत्यक्ष अनुभव प्राप्त करने के लिए हमारा [डेमो बुकिंग फॉर्म](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) भरें। `;export{n as default};
