const n=`---
title: "SeaX மொத்த SMS: விரைவான, பயனுள்ள வாடிக்கையாளர் அணுகலுக்கு"
metatitle: "SeaX மொத்த SMS: விரைவான, பயனுள்ள வாடிக்கையாளர் அணுகலுக்கு"
date: 2022-09-09 11:05:22-07:00
draft: false
author: Amy Chen, Kim Dodds, Sarah Reid
description: "இந்த வலைப்பதிவில், SeaX இன் மொத்த SMS அம்சம் முகவர்களுக்கு உரை வழியாக வெளிச்செல்லும் செய்திகளை முன்கூட்டியே அனுப்ப எவ்வாறு அனுமதிக்கிறது என்பதை நாங்கள் காண்பிப்போம்."
weight: 1
tags:
  - SeaX
image: images/blog/24-seax-bulk-sms/thumbnail.png
canonicalURL: /blog/seax-bulk-sms/
url: /blog/seax-bulk-sms/
---


*எங்கள் முந்தைய வலைப்பதிவு இடுகைகளில், உள்வரும் அழைப்புகள் மற்றும் செய்திகளை முகவர்கள் சிறப்பாகக் கையாள உதவும் SeaX இன் சில முக்கிய அம்சங்களை ( [குரல் நுண்ணறிவு](https://seasalt.ai/blog/21-seax-voice-intelligence/), [அறிவுத் தளம்](https://seasalt.ai/blog/22-seax-knowledge-base/), மற்றும் [வழக்கு மேலாண்மை](https://seasalt.ai/blog/23-seax-case-management/) உட்பட) நாங்கள் விளக்கினோம். இந்த வலைப்பதிவில், SeaX இன் மொத்த SMS அம்சம் முகவர்களுக்கு உரை வழியாக வெளிச்செல்லும் செய்திகளை முன்கூட்டியே அனுப்ப எவ்வாறு அனுமதிக்கிறது என்பதை நாங்கள் காண்பிப்போம், இது பாரம்பரிய மின்னஞ்சல் தகவல்தொடர்புகளை விட பெறுநர்கள் விரைவாகவும் சீராகவும் திறப்பதாகக் காட்டப்பட்டுள்ளது.*

# பொருளடக்கம்
- [SMS vs மின்னஞ்சல்](#sms-vs-email)
- [10DLC தரநிலைகள்](#10dlc-standards)
- [SeaX மொத்த SMS](#seax-bulk-sms)
    - [தொடர்பு பதிவேற்றம்](#contact-upload)
    - [செய்தி உருவாக்கம்](#message-composition)
    - [செலவு மதிப்பீடு](#cost-estimate)
    - [மொத்த செய்தி முன்னோட்டம்](#bulk-message-preview)
    - [பிரச்சார முன்னேற்ற கண்காணிப்பு](#campaign-progress-monitoring)
    - [உள்வரும் செய்தி அரட்டை](#incoming-message-chat)
- [முடிவுரை](#closing)

# SMS vs மின்னஞ்சல்

பெரும்பாலான வணிக நடவடிக்கைகளுக்கு மின்னஞ்சல் என்பது இயல்புநிலை தகவல்தொடர்பு முறையாகும். சமீப காலம் வரை, உரைச் செய்தி (SMS) என்பது அன்றாட தனிப்பட்ட தகவல்தொடர்புகளுக்கு அதன் புகழ் இருந்தபோதிலும், மொத்த வணிகச் செய்தியிடலுக்கான பரவலாகப் பயன்படுத்தப்படும் தகவல்தொடர்பு சேனலாக இல்லை. இருப்பினும், சமீபத்திய ஆண்டுகளில், Twilio போன்ற கிளவுட் தகவல்தொடர்பு வழங்குநர்கள், தொலைத்தொடர்பு உள்கட்டமைப்பு மற்றும் சேவை வழங்குநர்களின் நுணுக்கங்களை பின்னணியில் கையாள்வதன் மூலம், SMS சேனலை வணிகங்களுக்கு மிகவும் அணுகக்கூடியதாக மாற்றியுள்ளனர், மேலும் வாடிக்கையாளர்களுக்கு ஒரு எளிய SMS API ஐ ஒரு சேவையாக வழங்குகின்றனர். மின்னஞ்சல் வணிகத்திற்கான மிகவும் பிரபலமான சேனலாக இருந்தாலும், SMS பாரம்பரிய மின்னஞ்சல் தகவல்தொடர்புகளுக்கு ஒரு தனித்துவமான நிரப்பியாக செயல்பட முடியும்.

<center>
<img src="/images/blog/24-seax-bulk-sms/1-pros-cons.png" alt="வணிகத் தகவல்தொடர்புகளுக்கான SMS இன் சில நன்மை தீமைகள்."/>

*வணிகத் தகவல்தொடர்புகளுக்கான SMS இன் சில நன்மை தீமைகள்.*
</center>

ஆனால் மின்னஞ்சல் வெற்றிகரமாக நிரூபிக்கப்பட்டால், SMS ஐ ஏன் பயன்படுத்த வேண்டும்? சந்தைப்படுத்தல் பிரச்சாரங்களை ஒரு உதாரணமாக எடுத்துக் கொண்டால், சுருக்கமான பதில்: ஒரு மின்னஞ்சல் பிரச்சாரத்திற்கான திறப்பு விகிதம் 20% மட்டுமே என்றாலும், SMS க்கான சராசரி திறப்பு விகிதம் *98%* வரை அதிகமாக இருக்கலாம் - மேலும் உரைச் செய்திகள் அதிக பதில்களைப் பெறுகின்றன. கூடுதலாக, உரைச் செய்திகள் பொதுவாகப் பெறப்பட்ட 90 வினாடிகளுக்குள் திறக்கப்படுகின்றன, அதே நேரத்தில் மின்னஞ்சல்கள் சுமார் 90 நிமிடங்களுக்குப் பிறகு திறக்கப்படுகின்றன. கடைசியாக ஆனால் குறைவானது அல்ல, SMS இன் சராசரி கிளிக்-த்ரூ விகிதம் சுமார் 19% ஆகும், இது மின்னஞ்சல்களுக்கான 3.2% ஐ விட கணிசமாக அதிகமாகும் ([ஆதாரம்](https://manychat.com/blog/sms-vs-email-marketing-2021/)).

பொதுவாக, உரைச் செய்திகள் மின்னஞ்சல்களை விட விரைவாகவும் அடிக்கடி திறக்கப்படுகின்றன - ஒருவேளை உரைச் செய்திகள் எப்போதும் பெறுநருக்கு நேரடியாக வழங்கப்படுவதால், அவர்களுக்கு வைஃபை இருந்தாலும் இல்லாவிட்டாலும். மேலும் SMS பொதுவாக தனிப்பட்ட செய்திகளுக்குப் பயன்படுத்தப்படுவதாலும், வணிகத் தகவல்தொடர்புகளுக்கு குறைவாகப் பயன்படுத்தப்படுவதாலும், பெறுநர்கள் உரைச் செய்திகளை மின்னஞ்சல்களை விட முக்கியமானதாகவோ அல்லது கணிசமானதாகவோ கருதலாம்.

அப்படியானால் ஏன் எல்லோரும் SMS ஐப் பயன்படுத்துவதில்லை? சரி, நிச்சயமாக நன்மை தீமைகள் உள்ளன. இயற்கையாகவே SMS மின்னஞ்சலை விட கணிசமாக விலை அதிகம், ஏனெனில் இது செய்திகளை வழங்க தொலைத்தொடர்பு உள்கட்டமைப்பு மற்றும் சேவை வழங்குநர்களை (Verizon, AT&T போன்றவை) நம்பியுள்ளது. கூடுதலாக, உரைச் செய்திகளுக்கு சுமார் 900 எழுத்துகள் மற்றும் ஒரு ஒற்றை இணைப்பு (இது கூடுதல் செலவாகும், நிச்சயமாக) என்ற கடினமான வரம்பு உள்ளது. எனவே ஒட்டுமொத்தமாக, SMS ஒரு கணிசமாக பயனுள்ள தகவல்தொடர்பு முறையாக இருந்தாலும், வணிகங்கள் செலவு குறைந்ததாக இருப்பதை உறுதிப்படுத்த அவர்கள் அனுப்பும் உள்ளடக்கத்தில் அதிக தேர்ந்தெடுக்கப்பட்டதாக இருக்க வேண்டும் என்பதே வர்த்தகமாகும்.

அப்படியிருந்தும், SMS மற்றும் மின்னஞ்சல் ஒன்றாகப் பயன்படுத்தப்படக்கூடாது என்பதற்கு எந்த காரணமும் இல்லை! ஒவ்வொரு சேனலுக்கும் அதன் சொந்த நன்மை தீமைகள் உள்ளன, எனவே ஒரு வணிகம் ஒவ்வொரு சேனலின் பலங்களையும் பயன்படுத்தி மிகவும் பயனுள்ள தகவல்தொடர்புகளை அனுப்புவதை உறுதிப்படுத்த முடியும்.

# 10DLC தரநிலைகள்

அதிக அளவிலான A2P (பயன்பாட்டிலிருந்து நபருக்கு) SMS செய்தியிடலுக்கு, அமெரிக்க கேரியர்கள் தரப்படுத்தப்பட்ட 10 இலக்க நீண்ட குறியீடுகளை, அல்லது 10DLC ஐப் பயன்படுத்துகின்றன. மொத்த SMS பிரச்சாரத்தைத் தொடங்குவதற்கு முன், 10DLC மற்றும் அதன் பயன்பாடுகளைப் பற்றி [இங்கே](https://support.twilio.com/hc/en-us-articles/1260800720410-What-is-A2P-10DLC-) மேலும் படிக்க பரிந்துரைக்கிறோம்.

# SeaX மொத்த SMS

SeaX இன் மொத்த SMS சேவை உங்கள் தொடர்புகள்/முன்னணிகளை எளிதாகப் பதிவேற்றவும், மொத்தமாக SMS (MMS - மல்டிமீடியா செய்திகளையும் நாங்கள் ஆதரிக்கிறோம்) அனுப்பவும், உள்வரும் பதில்களை நிர்வகிக்கவும் உதவுகிறது. உங்கள் முதல் மொத்த SMS பிரச்சாரத்தைத் தொடங்க சில எளிய படிகளைப் பார்க்க தொடர்ந்து படிக்கவும்.

## தொடர்பு பதிவேற்றம்

<center>
<img src="/images/blog/24-seax-bulk-sms/2-contact-upload.png" alt="SeaX மொத்த SMS க்கு தொடர்புகளின் பட்டியலைப் பதிவேற்றுகிறது."/>

*SeaX மொத்த SMS க்கு தொடர்புகளின் பட்டியலைப் பதிவேற்றுகிறது.*
</center>

முதல் படி தொடர்புகள் மற்றும் முன்னணிகளைப் பதிவேற்றுவது. முதலில், உங்கள் SMS பிரச்சாரத்திற்கான தொடர்புகளை ஒரு csv கோப்பில் ஒழுங்கமைக்கவும். தேவையான புலங்களான \`phone_number\` மற்றும் \`name\` தவிர, நீங்கள் மற்ற புலங்களைச் சேர்த்து அவற்றை செய்தி உடலில் பயன்படுத்தலாம். உதாரணமாக, ஒவ்வொரு தொடர்புக்கும் \`name\` புலத்தின் அடிப்படையில் பெறுநரின் பெயரைச் சேர்க்க செய்தி உடலை மாறும் வகையில் மாற்றலாம்.

அடுத்து, SeaX இன் கீழ் மொத்த SMS சேவையைத் திறந்து, உங்கள் தொடர்புகளைப் பதிவேற்ற “Import” ஐ அழுத்தவும். உங்கள் முந்தைய தொடர்புகள் அனைத்தையும் பெறுநர்கள் பட்டியலில் சேமிக்கிறோம், எனவே நீங்கள் எளிதாக பின்தொடர்தல் பிரச்சாரங்களைத் தொடங்கலாம்.

## செய்தி உருவாக்கம்

<center>
<img src="/images/blog/24-seax-bulk-sms/3-message-draft.png" alt="SeaX மொத்த SMS உடன் புதிய SMS செய்தியை உருவாக்குகிறது."/>

*புதிய SMS செய்தியை உருவாக்குகிறது.*
</center>

அடுத்த படி உங்கள் பிரச்சாரத்திற்கு ஒரு பெயரைக் கொடுத்து செய்தியை உருவாக்குவது. மொத்த SMS உங்கள் csv/excel கோப்பில் சேமிக்கப்பட்ட அனைத்து தொடர்பு தகவல்களையும் அணுக அனுமதிக்கிறது. உதாரணமாக, தொடர்பு பட்டியலில் \`name\` என்ற புலம் இருந்தால், செய்தியில் \`{name}\` என்று தட்டச்சு செய்யலாம், மேலும் செய்தி தானாகவே ஒவ்வொரு தொடர்புக்கும் பெயரை செய்தி உடலில் காண்பிக்கும்.

## செலவு மதிப்பீடு

<center>
<img src="/images/blog/24-seax-bulk-sms/4-cost-estimate.png" alt="SeaX மொத்த SMS உடன் அனுப்பும் தொலைபேசி எண்களைத் தேர்ந்தெடுத்து பிரச்சார செலவு மதிப்பீட்டைப் பெறுகிறது."/>

*அனுப்பும் தொலைபேசி எண்களைத் தேர்ந்தெடுத்து பிரச்சார செலவு மதிப்பீட்டைப் பெறுகிறது.*
</center>

அடுத்து, வெளிச்செல்லும் செய்திகளை அனுப்ப நீங்கள் பயன்படுத்த விரும்பும் தொலைபேசி எண்ணைத் தேர்ந்தெடுக்கவும். உங்களிடம் இன்னும் தொலைபேசி எண் இல்லையென்றால், கொள்முதல் கோரிக்கையைச் சமர்ப்பிக்க மேல் வலது மூலையில் உள்ள “புதிய எண்ணுக்கான மேற்கோள்” என்பதைக் கிளிக் செய்யலாம். புதிய 10DLC எண்களை வாங்க எங்கள் குழு உங்களுக்கு உதவ முடியும்.

பிரச்சாரத்திற்கான மதிப்பிடப்பட்ட அலகு விலையையும் நீங்கள் முன்னோட்டமிடலாம். SMS/MMS அனுப்புவதற்கும் பெறுவதற்கும் பணம் செலவாகும் என்பதை நினைவில் கொள்ளுங்கள், எனவே அதற்கேற்ப பட்ஜெட் இருப்பதை உறுதிப்படுத்தவும்.

## மொத்த செய்தி முன்னோட்டம்

<center>
<img src="/images/blog/24-seax-bulk-sms/5-preview.png" alt="SeaX உடன் அனுப்புவதற்கு முன் ஒரு மொத்த SMS பிரச்சாரத்தை முன்னோட்டமிடுகிறது."/>

*SeaX உடன் அனுப்புவதற்கு முன் ஒரு மொத்த SMS பிரச்சாரத்தை முன்னோட்டமிடுகிறது.*
</center>

அனுப்புவதற்கு முன் மொத்த செய்திகளை நீங்கள் முன்னோட்டமிடலாம். செய்தி உடல், பெறுநர்களின் தொலைபேசி எண் மற்றும் அனுப்புநரின் தொலைபேசி எண் ஆகியவற்றை உறுதிப்படுத்துவது மிக முக்கியம். நீங்கள் பிரச்சாரத்தைத் தொடங்கியவுடன், செய்திகளைத் திரும்பப் பெற முடியாது. இந்த பக்கத்தில், உங்கள் பிரச்சாரத்தில் முதல் 3 செய்திகளை நீங்கள் முன்னோட்டமிடலாம், இது உங்கள் பட்டியலில் இருந்து முதல் 3 தொடர்புகளுக்கு ஒத்திருக்கிறது.

## பிரச்சார முன்னேற்ற கண்காணிப்பு

<center>
<img src="/images/blog/24-seax-bulk-sms/6-monitor.png" alt="SeaX உடன் ஒரு மொத்த SMS பிரச்சாரத்தின் முன்னேற்றத்தைக் கண்காணிக்கிறது."/>

*SeaX உடன் ஒரு மொத்த SMS பிரச்சாரத்தின் முன்னேற்றத்தைக் கண்காணிக்கிறது.*
</center>

இறுதியாக, நீங்கள் உட்கார்ந்து மொத்த SMS டாஷ்போர்டில் பிரச்சார முன்னேற்றத்தைக் கண்காணிக்கலாம். பக்கம் தானாகவே புதுப்பிக்கப்பட்டு பிரச்சார நிலையை புதுப்பிக்கிறது. இந்த பக்கத்தில் செய்தி விநியோக நிலைகள், வெற்றி/விநியோக விகிதம், மதிப்பிடப்பட்ட செலவுகள், அத்துடன் பதில் விகிதம் ஆகியவற்றைக் காணலாம்.

## உள்வரும் செய்தி அரட்டை

<center>
<img src="/images/blog/24-seax-bulk-sms/7-chat.png" alt="SeaX உடன் ஒரு மொத்த SMS பிரச்சாரத்திலிருந்து உள்வரும் பதில்களை நிவர்த்தி செய்கிறது."/>

*SeaX உடன் ஒரு மொத்த SMS பிரச்சாரத்திலிருந்து உள்வரும் பதில்களை நிவர்த்தி செய்கிறது.*
</center>

அனைத்து SeaX அம்சங்களைப் போலவே, உள்வரும் கோரிக்கைகள்/சிக்கல்களைக் கையாள முகவர்கள் அல்லது பிரச்சார மேலாளர்களுக்கு அதிகாரம் அளிக்க நாங்கள் முயற்சி செய்கிறோம் - மொத்த SMS ஆனது வெளிச்செல்லும் சந்தைப்படுத்தல் முயற்சிகளையும் கையாள SeaX ஐ அனுமதிக்கிறது. நீங்கள் பிரச்சாரத்தைத் தொடங்கிய பிறகு, கீழே காட்டப்பட்டுள்ள அரட்டை சாளரத்தில் உள்வரும் பதில்கள் அனைத்தையும் நீங்கள் நிர்வகிக்கலாம்.

# முடிவுரை

உள்வரும் செய்தி கோரிக்கைகளைக் கையாள்வதோடு கூடுதலாக வெளிச்செல்லும் தகவல்தொடர்புகளை அனுப்ப முகவர்களுக்கு SeaX மொத்த SMS அமைப்பு எவ்வாறு அதிகாரம் அளிக்கிறது என்பதைப் பற்றி படிக்க நேரம் ஒதுக்கியதற்கு நன்றி. எங்கள் வலைப்பதிவுத் தொடரின் அடுத்த பகுதிக்காக காத்திருங்கள், இது SeaX தளத்தில் கட்டமைக்கப்பட்ட சில மேலாண்மை மற்றும் பகுப்பாய்வு கருவிகளை உள்ளடக்கும். உடனடியாக மேலும் அறிய ஆர்வமாக இருந்தால், SeaX தளத்தைப் பற்றி முதலில் தெரிந்துகொள்ள எங்கள் [டெமோ படிவத்தை முன்பதிவு செய்யவும்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting).`;export{n as default};
