const n=`---
title: "SeaX Bulk SMS: لتواصل أسرع وأكثر فعالية مع العملاء"
metatitle: "SeaX Bulk SMS: لتواصل أسرع وأكثر فعالية مع العملاء"
date: 2022-09-09 11:05:22-07:00
modified_date: 2025-07-28 16:03:25.123456
draft: false
author: Amy Chen, Kim Dodds, Sarah Reid
description: "في هذه المدونة، سنوضح كيف تتيح ميزة الرسائل النصية الجماعية في SeaX للوكلاء إرسال رسائل صادرة بشكل استباقي عبر الرسائل النصية."
weight: 1
tags:
  - SeaX
image: images/blog/24-seax-bulk-sms/thumbnail.png
canonicalURL: /blog/seax-bulk-sms/
url: /blog/seax-bulk-sms/
---


*في منشورات مدونتنا السابقة، استعرضنا بعض الميزات الرئيسية لـ SeaX (بما في ذلك [الذكاء الصوتي](https://seasalt.ai/blog/21-seax-voice-intelligence/)، و[قاعدة المعرفة](https://seasalt.ai/blog/22-seax-knowledge-base/)، و[إدارة الحالات](https://seasalt.ai/blog/23-seax-case-management/)) التي تساعد الوكلاء على التعامل بشكل أفضل مع المكالمات والرسائل الواردة. في هذه المدونة، سنوضح كيف تتيح ميزة الرسائل النصية الجماعية في SeaX للوكلاء إرسال رسائل صادرة بشكل استباقي عبر الرسائل النصية، والتي يظهر أن المستلمين يفتحونها بشكل أسرع وأكثر اتساقًا من اتصالات البريد الإلكتروني التقليدية.*

# جدول المحتويات
- [الرسائل النصية القصيرة مقابل البريد الإلكتروني](#sms-vs-email)
- [معايير 10DLC](#10dlc-standards)
- [SeaX Bulk SMS](#seax-bulk-sms)
    - [تحميل جهات الاتصال](#contact-upload)
    - [إنشاء الرسالة](#message-composition)
    - [تقدير التكلفة](#cost-estimate)
    - [معاينة الرسائل الجماعية](#bulk-message-preview)
    - [مراقبة تقدم الحملة](#campaign-progress-monitoring)
    - [دردشة الرسائل الواردة](#incoming-message-chat)
- [الخاتمة](#closing)

# الرسائل النصية القصيرة مقابل البريد الإلكتروني

يميل البريد الإلكتروني إلى أن يكون وسيلة الاتصال الفعلية لمعظم العمليات التجارية. حتى وقت قريب إلى حد ما، لم تكن الرسائل النصية (SMS) قناة اتصال مستخدمة على نطاق واسع لرسائل الأعمال الجماعية، على الرغم من شعبيتها في الاتصالات الشخصية اليومية. ومع ذلك، في السنوات الأخيرة، جعل مقدمو خدمات الاتصالات السحابية مثل Twilio قناة الرسائل النصية القصيرة في متناول الشركات بشكل أكبر من خلال التعامل مع التفاصيل الدقيقة للبنية التحتية للاتصالات ومقدمي الخدمات في الخلفية، وتوفير واجهة برمجة تطبيقات بسيطة للرسائل النصية القصيرة كخدمة للعملاء. في حين أن البريد الإلكتروني قد يظل القناة الأكثر شيوعًا للأعمال، يمكن أن توفر الرسائل النصية القصيرة مكملاً فريدًا لاتصالات البريد الإلكتروني التقليدية.

<center>
<img src="/images/blog/24-seax-bulk-sms/1-pros-cons.png" alt="بعض إيجابيات وسلبيات الرسائل النصية القصيرة لاتصالات الأعمال."/>

*بعض إيجابيات وسلبيات الرسائل النصية القصيرة لاتصالات الأعمال.*
</center>

ولكن لماذا نستخدم الرسائل النصية القصيرة على الإطلاق إذا ثبت نجاح البريد الإلكتروني؟ إذا أخذنا الحملات التسويقية كمثال، فإن الإجابة المختصرة هي: في حين أن معدل فتح حملة البريد الإلكتروني هو 20٪ فقط، يمكن أن يصل متوسط ​​معدل فتح الرسائل النصية القصيرة إلى *98٪* - ناهيك عن أن الرسائل النصية تميل إلى الحصول على المزيد من الردود. بالإضافة إلى ذلك، يتم فتح الرسائل النصية عادةً في غضون 90 ثانية من استلامها، بينما يميل فتح رسائل البريد الإلكتروني إلى حوالي 90 دقيقة. أخيرًا وليس آخرًا، يبلغ متوسط ​​معدل النقر للرسائل النصية القصيرة حوالي 19٪، وهو أعلى بكثير من 3.2٪ لرسائل البريد الإلكتروني ([المصدر](https://manychat.com/blog/sms-vs-email-marketing-2021/)).

بشكل عام، يتم فتح الرسائل النصية بشكل أسرع وأكثر تكرارًا من رسائل البريد الإلكتروني - ربما لأن الرسائل النصية يتم تسليمها دائمًا مباشرة إلى المستلم أينما كان، سواء كان لديه شبكة wifi أم لا. أيضًا نظرًا لأن الرسائل النصية القصيرة تستخدم عادةً للرسائل الشخصية، وبشكل أقل تكرارًا لاتصالات الأعمال، فقد ينظر المستلمون إلى الرسائل النصية على أنها أكثر أهمية أو جوهرية من رسائل البريد الإلكتروني.

فلماذا لا يستخدم الجميع الرسائل النصية القصيرة إذن؟؟ حسنًا، بالطبع هناك إيجابيات وسلبيات. بطبيعة الحال، تعد الرسائل النصية القصيرة أغلى بكثير من البريد الإلكتروني لأنها تعتمد على البنية التحتية للاتصالات ومقدمي الخدمات (مثل Verizon و AT&T وما إلى ذلك) لتسليم الرسائل. بالإضافة إلى ذلك، تحتوي الرسائل النصية على حد أقصى يبلغ حوالي 900 حرف ومرفق واحد (والذي يكلف مبلغًا إضافيًا بالطبع). لذا بشكل عام، في حين أن الرسائل النصية القصيرة قد تكون وسيلة اتصال أكثر فعالية بكثير، فإن المقايضة هي أنه يجب على الشركات أن تكون أكثر انتقائية في المحتوى الذي ترسله للتأكد من أنها فعالة من حيث التكلفة.

ومع ذلك، لا يوجد سبب يمنع استخدام الرسائل النصية القصيرة والبريد الإلكتروني معًا! لكل قناة إيجابياتها وسلبياتها، لذلك يمكن للشركة التأكد من أنها ترسل الاتصالات الأكثر فعالية من خلال الاستفادة من نقاط القوة في كل قناة.

# معايير 10DLC

بالنسبة لرسائل SMS A2P (من تطبيق إلى شخص) ذات الحجم الكبير، تستخدم شركات النقل الأمريكية رموزًا طويلة موحدة مكونة من 10 أرقام، أو 10DLC. قبل بدء حملة رسائل نصية جماعية، نوصيك بقراءة المزيد عن 10DLC وتطبيقاتها [هنا](https://support.twilio.com/hc/en-us/articles/1260800720410-What-is-A2P-10DLC-).

# SeaX Bulk SMS

تمكنك خدمة الرسائل النصية الجماعية من SeaX من تحميل جهات الاتصال/العملاء المحتملين بسهولة، وإرسال رسائل نصية قصيرة (ندعم أيضًا رسائل الوسائط المتعددة - MMS) بكميات كبيرة، وإدارة الردود الواردة. تابع القراءة لمعرفة الخطوات البسيطة القليلة لبدء أول حملة رسائل نصية جماعية لك.

## تحميل جهات الاتصال

<center>
<img src="/images/blog/24-seax-bulk-sms/2-contact-upload.png" alt="تحميل قائمة جهات الاتصال إلى SeaX Bulk SMS."/>

*تحميل قائمة جهات الاتصال إلى SeaX Bulk SMS.*
</center>

الخطوة الأولى هي تحميل جهات الاتصال والعملاء المحتملين. أولاً، قم بتنظيم جهات الاتصال لحملة الرسائل النصية القصيرة الخاصة بك في ملف csv. بالإضافة إلى الحقول المطلوبة، \`phone_number\` و \`name\`، يمكنك إضافة حقول أخرى واستخدامها في نص الرسالة. على سبيل
مثال، يمكنك تغيير نص الرسالة ديناميكيًا لتضمين اسم المستلم بناءً على حقل \`name\` لكل جهة اتصال.

بعد ذلك، ما عليك سوى فتح خدمة الرسائل النصية الجماعية ضمن SeaX والضغط على "استيراد" لتحميل جهات الاتصال الخاصة بك. نقوم بحفظ جميع جهات الاتصال السابقة الخاصة بك في قائمة المستلمين حتى تتمكن من إطلاق حملات متابعة بسهولة.

## إنشاء الرسالة

<center>
<img src="/images/blog/24-seax-bulk-sms/3-message-draft.png" alt="إنشاء رسالة نصية جديدة باستخدام SeaX Bulk SMS."/>

*إنشاء رسالة نصية جديدة.*
</center>

الخطوة التالية هي إعطاء حملتك اسمًا وإنشاء الرسالة. تتيح لك الرسائل النصية الجماعية الوصول إلى جميع معلومات جهات الاتصال المخزنة في ملف csv/excel الخاص بك. على سبيل المثال، إذا كان لديك حقل يسمى \`name\` في قائمة جهات الاتصال، فيمكنك كتابة \`{name}\` في الرسالة وستقوم الرسالة تلقائيًا بعرض الاسم لكل جهة اتصال في نص الرسالة.

## تقدير التكلفة

<center>
<img src="/images/blog/24-seax-bulk-sms/4-cost-estimate.png" alt="تحديد أرقام هواتف الإرسال والحصول على تقدير تكلفة الحملة باستخدام SeaX Bulk SMS."/>

*تحديد أرقام هواتف الإرسال والحصول على تقدير تكلفة الحملة.*
</center>

بعد ذلك، اختر رقم الهاتف الذي ترغب في استخدامه لإرسال الرسائل الصادرة. إذا لم يكن لديك رقم هاتف بعد، فيمكنك النقر فوق "عرض أسعار لرقم جديد" في الزاوية اليمنى العليا لتقديم طلب شراء. يمكن لفريقنا مساعدتك في شراء أرقام 10DLC جديدة.

يمكنك أيضًا معاينة سعر الوحدة المقدر للحملة. اعلم أن إرسال واستلام الرسائل القصيرة/رسائل الوسائط المتعددة يكلف مالًا، لذا تأكد من وضع ميزانية وفقًا لذلك.

## معاينة الرسائل الجماعية

<center>
<img src="/images/blog/24-seax-bulk-sms/5-preview.png" alt="معاينة حملة رسائل نصية جماعية قبل إرسالها باستخدام SeaX."/>

*معاينة حملة رسائل نصية جماعية قبل إرسالها.*
</center>

يمكنك معاينة الرسائل الجماعية قبل إرسالها. من الضروري تأكيد نص الرسالة ورقم هاتف المستلمين ورقم هاتف المرسل. بمجرد إطلاق الحملة، لن يكون من الممكن سحب الرسائل. في هذه الصفحة، يمكنك معاينة أول 3 رسائل في حملتك، والتي تتوافق مع أول 3 جهات اتصال من قائمتك.

## مراقبة تقدم الحملة

<center>
<img src="/images/blog/24-seax-bulk-sms/6-monitor.png" alt="مراقبة تقدم حملة رسائل نصية جماعية باستخدام SeaX."/>

*مراقبة تقدم حملة رسائل نصية جماعية.*
</center>

أخيرًا، يمكنك الجلوس ومراقبة تقدم الحملة على لوحة معلومات الرسائل النصية الجماعية. يتم تحديث الصفحة تلقائيًا وتحديث حالة الحملة. يمكنك عرض حالات تسليم الرسائل، ومعدل النجاح/التسليم، والتكاليف المقدرة، بالإضافة إلى معدل الاستجابة في هذه الصفحة.

## دردشة الرسائل الواردة

<center>
<img src="/images/blog/24-seax-bulk-sms/7-chat.png" alt="معالجة الردود الواردة من حملة رسائل نصية جماعية باستخدام SeaX."/>

*معالجة الردود الواردة من حملة رسائل نصية جماعية.*
</center>

تمامًا مثل جميع ميزات SeaX، نسعى جاهدين لتمكين الوكلاء أو مديري الحملات من التعامل مع الطلبات/المشكلات الواردة - تتيح الرسائل النصية الجماعية لـ SeaX التعامل مع جهود التسويق الصادرة أيضًا. بعد إطلاق الحملة، يمكنك إدارة جميع الردود الواردة في نافذة الدردشة الموضحة أدناه.

# الخاتمة

شكرًا لك على الوقت الذي قضيته في القراءة عن كيفية تمكين نظام الرسائل النصية الجماعية من SeaX للوكلاء من إرسال اتصالات صادرة بالإضافة إلى التعامل مع طلبات الرسائل الواردة. ترقبوا الجزء التالي في سلسلة مدوناتنا، والذي سيغطي بعض أدوات الإدارة والتحليلات المضمنة في منصة SeaX. إذا كنت مهتمًا بمعرفة المزيد على الفور، فاملأ [نموذج حجز عرض توضيحي](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) للحصول على نظرة مباشرة على منصة SeaX.
`;export{n as default};
