const a=`---
title: "Twilio и Seasalt.ai запустили SeaX в Азиатско-Тихоокеанском регионе и Японии"
metatitle: "Пусть ваш контакт-центр говорит с помощью SeaX Voice Intelligence"
date: 2022-11-23 10:28:33-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Xuchen Yao
description: "Twilio и Seasalt.ai расширяют партнерство в Азиатско-Тихоокеанском регионе и Японии для создания многонациональных облачных контакт-центров"
weight: 1
tags:
  - SeaX
image: images/blog/25-twilio-seasalt-ai-launch-seax/Frankco-on-Seasalt-ai-parternship.png
canonicalURL: /blog/twilio-seasalt-ai-launch-seax/
url: /blog/twilio-seasalt-ai-launch-seax/
---

По мере развития контакт-центра – и появления все большего числа каналов связи онлайн – компании как никогда ранее удовлетворяют предпочтения потребителей. Сегодняшний клиент хочет общаться по своим предпочтительным каналам. Колл-центр хорошо известен своей поддержкой клиентов, но все чаще ожидается, что каналы могут использоваться как для поддержки клиентов, так и для коммерческих бесед с брендом.

Для достижения этой цели современные контакт-центры зависят от широкого спектра решений, каналов и интеграций, которые обеспечивают широкий и дифференцированный опыт, способствующий вовлечению клиентов.

В прошлом году мы объявили о нашем партнерстве с Twilio и представили поддержку SeaX, нашего CX для Twilio Flex. Сегодня мы расширяем эти отношения и [выпускаем технологические пакеты SeaX](https://www.twilio.com/press/releases/twilio-and-seasaltai-expand-partnership-in-apj) для контакт-центра. Эти предопределенные пакеты позволяют создать ваш колл-центр на Twilio Flex всего за 5 дней!

Доступные сейчас пакеты [SeaX](https://seax.seasalt.ai/?utm_source=blog/) объединяют основные функции любого контакт-центра, такие как праздничные и рабочие часы, диспозиция звонков, холодный и теплый трансфер, а также коучинг и вмешательство. Мы также поддерживаем омниканальный обмен сообщениями, включая, но не ограничиваясь, веб-чат, SMS, Messenger, WhatsApp, Line и Google Business Messages. SeaX также интегрируется с распространенным программным обеспечением CRM, таким как Zendesk, Salesforce, HubSpot и Microsoft Dynamics 365.

В Seasalt.ai мы предоставляем вам прочную основу для создания облачного контакт-центра в нескольких географических регионах или [управляемого контакт-центра Seasalt.ai](https://seasalt.ai/managed-contact-center/), комплексного решения для вашего контакт-центра: Seasalt.ai предоставляет программное обеспечение, человеческих агентов и управление вашим контакт-центром.

Наша штаб-квартира находится в Сиэтле, штат Вашингтон, и у нас есть местные офисы APAC в Тайбэе. Мы рады запустить наши решения на базе Twilio для наших клиентов по всему миру. Ознакомьтесь с нами сегодня – мы будем рады показать вам, что может сделать небольшое добавление Seasalt.ai для вашего бизнеса.

Удачи!
`;export{a as default};
