const a=`---
title: "Twilio و Seasalt.ai از SeaX در آسیا-اقیانوسیه و ژاپن رونمایی کردند"
metatitle: "اجازه دهید مرکز تماس شما با SeaX Voice Intelligence صحبت کند"
date: 2022-11-23 10:28:33-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Xuchen Yao
description: "Twilio و Seasalt.ai همکاری خود را در آسیا-اقیانوسیه و ژاپن برای ساخت مراکز تماس ابری چند کشوری گسترش می‌دهند"
weight: 1
tags:
  - SeaX
image: images/blog/25-twilio-seasalt-ai-launch-seax/Frankco-on-Seasalt-ai-parternship.png
canonicalURL: /blog/twilio-seasalt-ai-launch-seax/
url: /blog/twilio-seasalt-ai-launch-seax/
---

با تکامل مرکز تماس – و آنلاین شدن کانال‌های ارتباطی بیشتر – کسب‌وکارها بیش از هر زمان دیگری ترجیحات مصرف‌کنندگان را برآورده می‌کنند. مشتری امروزی می‌خواهد از طریق کانال‌های مورد علاقه خود ارتباط برقرار کند. مرکز تماس به دلیل پشتیبانی مشتری شناخته شده است، اما به طور فزاینده‌ای انتظار می‌رود که کانال‌ها هم برای پشتیبانی مشتری و هم برای مکالمات تجاری با یک برند استفاده شوند.

برای دستیابی به این هدف، مراکز تماس مدرن به طیف گسترده‌ای از راه‌حل‌ها، کانال‌ها و یکپارچه‌سازی‌ها در سراسر تجربیات گسترده و متمایز که تعامل مشتری را افزایش می‌دهند، وابسته هستند.

سال گذشته ما همکاری خود را با Twilio اعلام کردیم و پیش‌نمایش پشتیبانی از SeaX، CX ما برای Twilio Flex را ارائه دادیم. امروز ما این رابطه را گسترش می‌دهیم و [بسته‌های فناوری SeaX](https://www.twilio.com/press/releases/twilio-and-seasaltai-expand-partnership-in-apj) را برای مرکز تماس منتشر می‌کنیم. این بسته‌های از پیش تعریف شده مرکز تماس شما را در Twilio Flex تنها در 5 روز راه‌اندازی می‌کنند!

اکنون در دسترس است، [SeaX](https://seax.seasalt.ai/?utm_source=blog/) ویژگی‌های اصلی هر مرکز تماس را در یک بسته جمع‌آوری می‌کند، مانند تعطیلات و ساعات کاری، دفع تماس، انتقال سرد و گرم، و مربی و مداخله. ما همچنین از پیام‌رسانی چند کاناله از جمله، اما نه محدود به، چت وب، پیامک، مسنجر، واتساپ، لاین و پیام‌های کسب‌وکار Google پشتیبانی می‌کنیم. SeaX همچنین با نرم‌افزارهای CRM رایج مانند Zendesk، Salesforce، HubSpot و Microsoft Dynamics 365 ادغام می‌شود.

در Seasalt.ai، ما به شما یک پایه محکم برای ساخت یک مرکز تماس ابری در چندین منطقه جغرافیایی یا [مرکز تماس مدیریت شده Seasalt.ai](https://seasalt.ai/managed-contact-center/)، یک راه حل همه کاره برای مرکز تماس شما ارائه می‌دهیم: Seasalt.ai نرم‌افزار، عوامل انسانی و عملیات مرکز تماس شما را فراهم می‌کند.

دفتر مرکزی ما در سیاتل، واشنگتن، و دفاتر محلی APAC در تایپه داریم. ما هیجان‌زده‌ایم که راه‌حل‌های مبتنی بر Twilio خود را به مشتریان خود در هر کجای جهان عرضه کنیم. امروز ما را بررسی کنید – ما دوست داریم به شما نشان دهیم که اضافه کردن کمی Seasalt.ai چه کاری می‌تواند برای کسب‌وکار شما انجام دهد.

به سلامتی!
`;export{a as default};
