const a=`---
title: "Twilio و Seasalt.ai تطلقان SeaX في آسيا والمحيط الهادئ واليابان"
metatitle: "دع مركز الاتصال الخاص بك يتحدث مع SeaX Voice Intelligence"
date: 2022-11-23 10:28:33-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Xuchen Yao
description: "Twilio و Seasalt.ai توسعان الشراكة في آسيا والمحيط الهادئ واليابان لبناء مراكز اتصال سحابية متعددة البلدان"
weight: 1
tags:
  - SeaX
image: images/blog/25-twilio-seasalt-ai-launch-seax/Frankco-on-Seasalt-ai-parternship.png
canonicalURL: /blog/twilio-seasalt-ai-launch-seax/
url: /blog/twilio-seasalt-ai-launch-seax/
---

مع تطور مركز الاتصال - وزيادة عدد قنوات الاتصال عبر الإنترنت - تلبي الشركات أكثر من أي وقت مضى تفضيلات المستهلكين. يرغب عميل اليوم في التواصل عبر قنواته المفضلة. يشتهر مركز الاتصال بدعم العملاء، ولكن التوقع المتزايد هو أنه يمكن استخدام القنوات لكل من دعم العملاء ومحادثات التجارة مع العلامة التجارية.

لتحقيق ذلك، تعتمد مراكز الاتصال الحديثة على مجموعة واسعة من الحلول والقنوات والتكاملات عبر تجارب واسعة ومتنوعة تدفع مشاركة العملاء.

في العام الماضي، أعلنا عن شراكتنا مع Twilio وعرضنا دعم SeaX، وهو CX الخاص بنا لـ Twilio Flex. اليوم، نقوم بتوسيع هذه العلاقة و [إصدار حزم تقنية SeaX](https://www.twilio.com/press/releases/twilio-and-seasaltai-expand-partnership-in-apj) لمركز الاتصال. هذه الحزم المحددة مسبقًا تجعل مركز الاتصال الخاص بك مبنيًا على Twilio Flex في أقل من 5 أيام!

متوفرة الآن، حزم [SeaX](https://seax.seasalt.ai/?utm_source=blog/) تجمع الميزات الأساسية لأي مركز اتصال في حزمة واحدة، مثل العطلات وساعات العمل، وتصنيف المكالمات، والتحويل البارد والدافئ، والتدريب والتدخل. نحن ندعم أيضًا المراسلة متعددة القنوات بما في ذلك على سبيل المثال لا الحصر الدردشة عبر الويب، والرسائل النصية القصيرة، والماسنجر، وواتساب، ولاين، ورسائل Google Business. يتكامل SeaX أيضًا مع برامج CRM الشائعة مثل Zendesk و Salesforce و HubSpot و Microsoft Dynamics 365.

في Seasalt.ai، نوفر لك أساسًا متينًا لبناء مركز اتصال سحابي عبر مناطق جغرافية متعددة أو [مركز اتصال مُدار من Seasalt.ai](https://seasalt.ai/managed-contact-center/)، وهو حل شامل لمركز الاتصال الخاص بك: توفر Seasalt.ai البرامج، والوكلاء البشريين، وتشغيل مركز الاتصال الخاص بك.

يقع مقرنا الرئيسي في سياتل، واشنطن، ولدينا مكاتب محلية في منطقة آسيا والمحيط الهادئ في تايبيه. يسعدنا إطلاق حلولنا المدعومة من Twilio لعملائنا في أي مكان في العالم. تحقق منا اليوم - يسعدنا أن نوضح لك ما يمكن أن يفعله القليل من Seasalt.ai لعملك.

تحياتي!
`;export{a as default};
