const a=`---
title: "Twilio และ Seasalt.ai เปิดตัว SeaX ในเอเชียแปซิฟิกและญี่ปุ่น"
metatitle: "ให้ศูนย์ติดต่อของคุณพูดด้วย SeaX Voice Intelligence"
date: 2022-11-23 10:28:33-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Xuchen Yao
description: "Twilio และ Seasalt.ai ขยายความร่วมมือในเอเชียแปซิฟิกและญี่ปุ่นเพื่อสร้างศูนย์ติดต่อคลาวด์หลายประเทศ"
weight: 1
tags:
  - SeaX
image: images/blog/25-twilio-seasalt-ai-launch-seax/Frankco-on-Seasalt-ai-parternship.png
canonicalURL: /blog/twilio-seasalt-ai-launch-seax/
url: /blog/twilio-seasalt-ai-launch-seax/
---

เมื่อศูนย์ติดต่อพัฒนาขึ้น – และช่องทางการสื่อสารออนไลน์เพิ่มขึ้น – ธุรกิจต่างๆ ตอบสนองความต้องการของผู้บริโภคได้มากกว่าที่เคย ลูกค้าในปัจจุบันต้องการสื่อสารผ่านช่องทางที่พวกเขาต้องการ ศูนย์บริการทางโทรศัพท์เป็นที่รู้จักกันดีสำหรับการสนับสนุนลูกค้า แต่ความคาดหวังที่เพิ่มขึ้นคือช่องทางต่างๆ สามารถใช้ได้ทั้งสำหรับการสนับสนุนลูกค้าและการสนทนาเชิงพาณิชย์กับแบรนด์

เพื่อให้บรรลุเป้าหมายนี้ ศูนย์ติดต่อสมัยใหม่จึงต้องพึ่งพาโซลูชัน ช่องทาง และการผสานรวมที่หลากหลาย ซึ่งครอบคลุมประสบการณ์ที่กว้างขวางและแตกต่างกัน ซึ่งขับเคลื่อนการมีส่วนร่วมของลูกค้า

ปีที่แล้วเราได้ประกาศความร่วมมือกับ Twilio และแสดงตัวอย่างการสนับสนุนสำหรับ SeaX ซึ่งเป็น CX ของเราสำหรับ Twilio Flex วันนี้เรากำลังขยายความสัมพันธ์นั้นและ [เปิดตัวแพ็คเกจเทคโนโลยี SeaX](https://www.twilio.com/press/releases/twilio-and-seasaltai-expand-partnership-in-apj) สำหรับศูนย์ติดต่อ แพ็คเกจที่กำหนดไว้ล่วงหน้าเหล่านี้ช่วยให้ศูนย์บริการทางโทรศัพท์ของคุณสร้างขึ้นบน Twilio Flex ได้ภายในเวลาเพียง 5 วัน!

ขณะนี้มีให้บริการแล้ว [SeaX](https://seax.seasalt.ai/?utm_source=blog/) รวมคุณสมบัติหลักของศูนย์ติดต่อใดๆ ไว้ในแพ็คเกจเดียว เช่น วันหยุดและเวลาทำการ การจัดการการโทร การโอนสายแบบเย็นและแบบอุ่น และการฝึกสอนและการแทรกแซง เรายังรองรับการส่งข้อความแบบ Omnichannel รวมถึงแต่ไม่จำกัดเพียงเว็บแชท, SMS, Messenger, WhatsApp, Line และ Google Business Messages SeaX ยังรวมเข้ากับซอฟต์แวร์ CRM ทั่วไป เช่น Zendesk, Salesforce, HubSpot และ Microsoft Dynamics 365

ที่ Seasalt.ai เรามอบรากฐานที่มั่นคงให้คุณในการสร้างศูนย์ติดต่อคลาวด์ในหลายพื้นที่ทางภูมิศาสตร์ หรือ [ศูนย์ติดต่อที่จัดการโดย Seasalt.ai](https://seasalt.ai/managed-contact-center/) ซึ่งเป็นโซลูชันแบบครบวงจรสำหรับศูนย์ติดต่อของคุณ: Seasalt.ai ให้บริการซอฟต์แวร์ ตัวแทนที่เป็นมนุษย์ และการดำเนินงานของศูนย์ติดต่อของคุณ

เรามีสำนักงานใหญ่ในซีแอตเทิล รัฐวอชิงตัน และมีสำนักงาน APAC ในท้องถิ่นในไทเป เราตื่นเต้นที่จะเปิดตัวโซลูชันที่ขับเคลื่อนโดย Twilio ให้กับลูกค้าของเราทั่วโลก ลองดูเราวันนี้ – เรายินดีที่จะแสดงให้คุณเห็นว่าการเพิ่ม Seasalt.ai เล็กน้อยสามารถทำอะไรให้กับธุรกิจของคุณได้บ้าง

ไชโย!
`;export{a as default};
