const n=`---
title: "SeaVoice STT/TTS Discord Bot: Первый, кто предоставляет загружаемые голосовые записи с AI-транскрипциями"
metatitle: "SeaVoice STT/TTS Discord Bot: Загрузки записей"
date: 2022-12-13 11:51:16-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "С последним выпуском, SeaVoice Discord Bot является первым на платформе, который предлагает загружаемые записи голосовых каналов с транскрипциями, сгенерированными ИИ."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/26-discord-download/seavoice-discord-audio-transcript-download.jpg
url: /blog/seavoice-discord-recording-download/
---

*Бот SeaVoice Discord набирает популярность как один из лучших вариантов для транскрибирования речи в голосовых каналах Discord. С последним выпуском, бот является первым на Discord, который предлагает загружаемые записи голосовых каналов с транскрипциями, сгенерированными ИИ.*

# Загружаемые аудио- и текстовые файлы в Discord: Новые захватывающие функции в последнем выпуске бота SeaVoice

Привет всем, мы рады объявить о новой функции для бота SeaVoice Discord!

<center>
<img src="/images/blog/26-discord-download/1-seavoice-discord-speech-to-text.png" alt="Бот SeaVoice Discord транскрибирует речь из голосового канала в реальном времени."/>

*Бот SeaVoice Discord транскрибирует речь из голосового канала в реальном времени.*
</center>

С момента выпуска, бот SeaVoice Discord имел две основные возможности: он транскрибирует разговоры с использованием высокоточных технологий преобразования речи в текст и может синтезировать речь на основе пользовательских вводов.
Он быстро набирает популярность и теперь находится на более чем 700 серверах по всему миру вскоре после запуска.

Как команда, мы обсуждали различные способы сделать бота более полезным и доступным для пользователей.
Мы решили, что предоставление записи и транскрипции сессий будет полезно для ведения протоколов встреч, сохранения игровых сессий и ряда других ситуаций.

## Обзор загрузки транскрипций и аудио

<center>
<img src="/images/blog/26-discord-download/2-seavoice-audio-transcript-download-discord-direct-message.png" alt="Бот SeaVoice Discord отправляет личное сообщение с транскрипцией и загрузками аудио после каждой сессии."/>

*Бот SeaVoice Discord отправляет личное сообщение с транскрипцией и загрузками аудио после каждой сессии.*
</center>

В течение последних нескольких месяцев наша команда усердно работала над воплощением этой идеи в жизнь.
Теперь, когда вы вызываете бота в свой звонок для транскрибирования разговора с помощью команды \`/recognize\`, он также будет записывать звонок и сохранять транскрипции в фоновом режиме.
Когда вы попросите бота уйти, каждый, кто участвовал в звонке, получит прямое сообщение от бота, которое будет содержать полную транскрипцию и запись звонка.

<center>
<img src="/images/blog/26-discord-download/3-seavoice-discord-audio-download.png" alt="Нажатие на ссылку от бота SeaVoice Discord открывает веб-страницу для предварительного просмотра и загрузки аудиозаписи."/>

*Нажатие на ссылку от бота SeaVoice Discord открывает веб-страницу для предварительного просмотра и загрузки аудиозаписи.*
</center>

Будет доступна ссылка для загрузки полной записи в формате mp3.
Это однодорожечная запись, поэтому речь всех пользователей будет в одном файле.
Обработка аудио может занять некоторое время, поэтому, пожалуйста, подождите несколько секунд, пока бот отправит ссылку, возможно, до нескольких минут для более длительных разговоров.

<center>
<img src="/images/blog/26-discord-download/4-seavoice-discord-transcription-file.png" alt="Загружаемый файл транскрипции, отправленный ботом SeaVoice Discord."/>

*Загружаемый файл транскрипции, отправленный ботом SeaVoice Discord.*
</center>

Транскрипция представлена в виде текстового файла и включает временные метки начала и конца каждого сказанного слова, а также имя пользователя, который его произнес.
Это должно облегчить членам вашего сервера отслеживание звонков, а также будет полезно для ведения протоколов проектных совещаний и игровых сессий.

## Вызовы

Следует также отметить, что у нас были довольно большие трудности с обработкой аудио, так как Discord отправляет аудио каждого пользователя отдельно и без какой-либо тишины.
Поэтому, пожалуйста, имейте в виду, что могут быть еще некоторые проблемы, которые нужно устранить, и мы будем продолжать улучшать эту функцию, чтобы сделать окончательные записи максимально точными!
Если у вас возникнут какие-либо проблемы с вашими записями или транскрипциями, пожалуйста, сообщите нашей команде на [официальном сервере SeaVoice Discord](https://discord.gg/dfAYfwBQ).
<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## Будущие направления

После того, как эта сложная функция наконец-то готова к выпуску, наша команда уже планирует следующие дополнения к боту.
Некоторые вещи, которые мы рассматриваем на будущее, включают возможность настраиваемых конфигураций для серверов и/или пользователей для таких вещей, как: как они хотят, чтобы записи обрабатывались, формат файла транскрипции, нужно ли/когда воспроизводить отказ от ответственности за запись, канал по умолчанию для вывода транскрипций и т. д.
Мы будем рады услышать любые ваши предложения по новым функциям (или по улучшению существующих) на нашем [официальном сервере SeaVoice Discord](https://discord.gg/dfAYfwBQ).

## Попробуйте!

Тем временем вы можете пригласить [бота SeaVoice Discord](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) на свой сервер и попробовать его сами.
Не стесняйтесь также ознакомиться с [документацией бота SeaVoice](https://wiki.seasalt.ai/seavoice/discord/discord-bot/), чтобы узнать, как вы можете использовать бота для наилучшего соответствия потребностям вашего сообщества.


Мы надеемся, что эти новые функции помогут вам во всем, для чего вы используете бота, и что вы получите удовольствие от их использования!


С уважением,


Команда бота SeaVoice
`;export{n as default};
