const o=`---
title: "SeaVoice STT/TTS Discord Bot: AI டிரான்ஸ்கிரிப்ஷன்களுடன் பதிவிறக்கக்கூடிய குரல் பதிவை வழங்கும் முதல் போட்"
metatitle: "SeaVoice STT/TTS Discord Bot: பதிவிறக்கங்கள்"
date: 2022-12-13 11:51:16-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "சமீபத்திய வெளியீட்டில், SeaVoice Discord Bot ஆனது AI-உருவாக்கப்பட்ட டிரான்ஸ்கிரிப்ஷன்களுடன் பதிவிறக்கக்கூடிய குரல் சேனல் பதிவுகளை வழங்கும் தளத்தில் முதல் போட் ஆகும்."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/26-discord-download/seavoice-discord-audio-transcript-download.jpg
url: /blog/seavoice-discord-recording-download/
---

*SeaVoice Discord Bot ஆனது Discord குரல் சேனல்களில் பேச்சை டிரான்ஸ்கிரைப் செய்வதற்கான சிறந்த விருப்பங்களில் ஒன்றாக பிரபலமடைந்து வருகிறது. சமீபத்திய வெளியீட்டில், AI-உருவாக்கப்பட்ட டிரான்ஸ்கிரிப்ஷன்களுடன் பதிவிறக்கக்கூடிய குரல் சேனல் பதிவுகளை வழங்கும் தளத்தில் முதல் போட் இதுவாகும்.*

# Discord இல் பதிவிறக்கக்கூடிய ஆடியோ மற்றும் டிரான்ஸ்கிரிப்ட் கோப்புகள்: SeaVoice இன் சமீபத்திய போட் வெளியீட்டில் உற்சாகமான புதிய அம்சங்கள்

அனைவருக்கும் வணக்கம், SeaVoice Discord போட் க்கான புதிய அம்சத்தை அறிவிப்பதில் நாங்கள் மகிழ்ச்சியடைகிறோம்!

<center>
<img src="/images/blog/26-discord-download/1-seavoice-discord-speech-to-text.png" alt="SeaVoice Discord Bot ஒரு குரல் சேனலில் இருந்து பேச்சை நிகழ்நேரத்தில் டிரான்ஸ்கிரைப் செய்கிறது."/>

*SeaVoice Discord Bot ஒரு குரல் சேனலில் இருந்து பேச்சை நிகழ்நேரத்தில் டிரான்ஸ்கிரைப் செய்கிறது.*
</center>

வெளியிடப்பட்டதிலிருந்து, SeaVoice Discord Bot இரண்டு முக்கிய திறன்களைக் கொண்டுள்ளது: இது மிகவும் துல்லியமான பேச்சு-க்கு-உரை தொழில்நுட்பங்களைப் பயன்படுத்தி உரையாடல்களை டிரான்ஸ்கிரைப் செய்கிறது மற்றும் பயனர் உள்ளீடுகளின் அடிப்படையில் பேச்சை தொகுக்க முடியும்.
இது விரைவாக பிரபலமடைந்து வருகிறது மற்றும் தொடங்கப்பட்ட சிறிது நேரத்திலேயே உலகளவில் 700 க்கும் மேற்பட்ட சேவையகங்களில் உள்ளது.

ஒரு குழுவாக நாங்கள் பயனர்களுக்கு போட் ஐ மிகவும் பயனுள்ளதாகவும் அணுகக்கூடியதாகவும் மாற்றுவதற்கான பல்வேறு வழிகளைப் பற்றி விவாதித்தோம்.
கூட்டங்களை பதிவு செய்வதற்கும், விளையாட்டு அமர்வுகளை சேமிப்பதற்கும், மற்றும் பல சூழ்நிலைகளுக்கும் அமர்வுகளின் பதிவு மற்றும் டிரான்ஸ்கிரிப்ட் வழங்குவது பயனுள்ளதாக இருக்கும் என்று நாங்கள் முடிவு செய்தோம்.

## டிரான்ஸ்கிரிப்ஷன் & ஆடியோ பதிவிறக்க கண்ணோட்டம்

<center>
<img src="/images/blog/26-discord-download/2-seavoice-audio-transcript-download-discord-direct-message.png" alt="SeaVoice Discord Bot ஒவ்வொரு அமர்வுக்குப் பிறகும் டிரான்ஸ்கிரிப்ஷன் மற்றும் ஆடியோ பதிவிறக்கங்களுடன் ஒரு DM ஐ அனுப்புகிறது."/>

*SeaVoice Discord Bot ஒவ்வொரு அமர்வுக்குப் பிறகும் டிரான்ஸ்கிரிப்ஷன் மற்றும் ஆடியோ பதிவிறக்கங்களுடன் ஒரு DM ஐ அனுப்புகிறது.*
</center>

கடந்த சில மாதங்களாக எங்கள் குழு இந்த யோசனையை யதார்த்தமாக்க கடுமையாக உழைத்து வருகிறது.
இப்போது நீங்கள் \`/recognize\` கட்டளையுடன் உங்கள் உரையாடலை டிரான்ஸ்கிரைப் செய்ய போட் ஐ உங்கள் அழைப்பிற்கு கொண்டு வரும்போது, அது அழைப்பையும் பதிவு செய்து டிரான்ஸ்கிரிப்ஷன்களை திரைக்குப் பின்னால் நிலைநிறுத்தும்.
நீங்கள் போட் ஐ விட்டு வெளியேறச் சொல்லும்போது, அழைப்பில் பங்கேற்ற அனைவருக்கும் போட் இலிருந்து ஒரு நேரடி செய்தி கிடைக்கும், அதில் முழு டிரான்ஸ்கிரிப்ஷன் மற்றும் அழைப்பின் பதிவு இருக்கும்.

<center>
<img src="/images/blog/26-discord-download/3-seavoice-discord-audio-download.png" alt="SeaVoice Discord Bot இலிருந்து இணைப்பைக் கிளிக் செய்வதன் மூலம் ஆடியோ பதிவை முன்னோட்டமிட மற்றும் பதிவிறக்க ஒரு வலைப்பக்கம் திறக்கும்."/>

*SeaVoice Discord Bot இலிருந்து இணைப்பைக் கிளிக் செய்வதன் மூலம் ஆடியோ பதிவை முன்னோட்டமிட மற்றும் பதிவிறக்க ஒரு வலைப்பக்கம் திறக்கும்.*
</center>

முழு பதிவையும் mp3 வடிவத்தில் பதிவிறக்க ஒரு இணைப்பு இருக்கும்.
இது ஒரு ஒற்றை டிராக் பதிவு, எனவே அனைத்து பயனர்களின் பேச்சும் ஒரே கோப்பில் இருக்கும்.
இதற்கான ஆடியோ செயலாக்கம் சிறிது நேரம் ஆகலாம், எனவே போட் இணைப்பை அனுப்ப சில வினாடிகள் காத்திருக்கவும், நீண்ட உரையாடல்களுக்கு சில நிமிடங்கள் வரை ஆகலாம்.

<center>
<img src="/images/blog/26-discord-download/4-seavoice-discord-transcription-file.png" alt="SeaVoice Discord Bot ஆல் அனுப்பப்பட்ட பதிவிறக்கக்கூடிய டிரான்ஸ்கிரிப்ஷன் கோப்பு."/>

*SeaVoice Discord Bot ஆல் அனுப்பப்பட்ட பதிவிறக்கக்கூடிய டிரான்ஸ்கிரிப்ஷன் கோப்பு.*
</center>

டிரான்ஸ்கிரிப்ஷன் ஒரு உரை கோப்பு வடிவத்தில் உள்ளது மற்றும் ஒவ்வொரு சொல்லப்பட்ட விஷயத்தின் தொடக்க மற்றும் முடிவுக்கான நேர முத்திரைகளையும், அதைச் சொன்ன நபரின் பயனர்பெயரையும் உள்ளடக்கியது.
இது உங்கள் சேவையக உறுப்பினர்களுக்கு அழைப்புகளைக் கண்காணிக்க எளிதாக்கும், மேலும் திட்டக் கூட்டங்கள் மற்றும் விளையாட்டு அமர்வுகளைப் பதிவு செய்வதற்கும் உதவியாக இருக்கும்.

## சவால்கள்

ஆடியோவை ஒழுங்குபடுத்துவதில் எங்களுக்கு ஒரு பெரிய சவால் இருந்தது என்பதையும் கவனத்தில் கொள்ள வேண்டும், ஏனெனில் Discord ஒவ்வொரு பயனரின் ஆடியோவையும் தனித்தனியாகவும் எந்த அமைதியும் இல்லாமல் அனுப்புகிறது.
எனவே இன்னும் சில சிக்கல்கள் இருக்கலாம் என்பதை நினைவில் கொள்ளவும், மேலும் இறுதி பதிவுகளை முடிந்தவரை துல்லியமாக்க இந்த அம்சத்தை தொடர்ந்து மேம்படுத்துவோம்!
உங்கள் பதிவுகள் அல்லது டிரான்ஸ்கிரிப்ஷன்களில் ஏதேனும் சிக்கல்கள் ஏற்பட்டால், எங்கள் குழுவை [அதிகாரப்பூர்வ SeaVoice Discord Server](https://discord.gg/dfAYfwBQ) இல் தெரிவிக்கவும்.
<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## எதிர்கால திசைகள்

இந்த சவாலான அம்சம் இறுதியாக வெளியிட தயாராக இருப்பதால், எங்கள் குழு ஏற்கனவே போட் க்கான அடுத்த சேர்த்தல்களை திட்டமிட்டுள்ளது.
எதிர்காலத்தில் நாங்கள் கருத்தில் கொள்ளும் சில விஷயங்கள் சேவையகங்கள் மற்றும்/அல்லது பயனர்களுக்கான தனிப்பயனாக்கக்கூடிய உள்ளமைவுகளை அனுமதிப்பது போன்ற விஷயங்கள்: பதிவுகள் எவ்வாறு கையாளப்பட வேண்டும், டிரான்ஸ்கிரிப்ட் கோப்பின் வடிவம், பதிவு மறுப்பு எப்போது/எப்போது இயக்கப்பட வேண்டும், டிரான்ஸ்கிரிப்ஷன்களை வெளியிடுவதற்கான இயல்புநிலை சேனல் போன்றவை.
புதிய அம்சங்களுக்கான (அல்லது ஏற்கனவே உள்ளவற்றை எவ்வாறு மேம்படுத்துவது) உங்கள் பரிந்துரைகளை எங்கள் [அதிகாரப்பூர்வ SeaVoice Discord Server](https://discord.gg/dfAYfwBQ) இல் கேட்க நாங்கள் விரும்புகிறோம்.

## முயற்சி செய்து பாருங்கள்!

இதற்கிடையில் நீங்கள் [SeaVoice Discord Bot](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) ஐ உங்கள் சேவையகத்திற்கு அழைத்து அதை நீங்களே முயற்சி செய்யலாம்.
உங்கள் சமூகத்தின் தேவைகளுக்கு ஏற்ப போட் ஐ எவ்வாறு பயன்படுத்தலாம் என்பதைப் பார்க்க [SeaVoice Bot ஆவணங்களையும்](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) படிக்க தயங்க வேண்டாம்.


இந்த புதிய அம்சங்கள் நீங்கள் போட் ஐப் பயன்படுத்தும் எதற்கும் உங்களுக்கு உதவும் மற்றும் அவற்றை நீங்கள் பயன்படுத்தி மகிழ்வீர்கள் என்று நம்புகிறோம்!


வாழ்த்துக்கள்,


SeaVoice போட் குழு
`;export{o as default};
