const n=`---
title: "ربات SeaVoice STT/TTS Discord: اولین رباتی که ضبط صدای قابل دانلود با رونویسی هوش مصنوعی را ارائه می‌دهد"
metatitle: "ربات SeaVoice STT/TTS Discord: دانلود ضبط‌ها"
date: 2022-12-13 11:51:16-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "با آخرین نسخه، ربات SeaVoice Discord اولین رباتی در این پلتفرم است که ضبط کانال صوتی قابل دانلود با رونویسی‌های تولید شده توسط هوش مصنوعی را ارائه می‌دهد."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/26-discord-download/seavoice-discord-audio-transcript-download.jpg
url: /blog/seavoice-discord-recording-download/
---

*ربات SeaVoice Discord به عنوان یکی از بهترین گزینه‌ها برای رونویسی گفتار در کانال‌های صوتی Discord محبوبیت زیادی پیدا کرده است. با آخرین نسخه، این ربات اولین رباتی در Discord است که ضبط کانال صوتی قابل دانلود با رونویسی‌های تولید شده توسط هوش مصنوعی را ارائه می‌دهد.*

# فایل‌های صوتی و رونویسی قابل دانلود در Discord: ویژگی‌های جدید و هیجان‌انگیز در آخرین نسخه ربات SeaVoice

سلام به همه، ما هیجان‌زده‌ایم که یک ویژگی جدید برای ربات SeaVoice Discord را اعلام کنیم!

<center>
<img src="/images/blog/26-discord-download/1-seavoice-discord-speech-to-text.png" alt="ربات SeaVoice Discord در حال رونویسی گفتار از یک کانال صوتی در زمان واقعی."/>

*ربات SeaVoice Discord در حال رونویسی گفتار از یک کانال صوتی در زمان واقعی.*
</center>

از زمان انتشار، ربات SeaVoice Discord دو قابلیت اصلی داشته است: مکالمات را با استفاده از فناوری‌های گفتار به متن بسیار دقیق رونویسی می‌کند و می‌تواند گفتار را بر اساس ورودی‌های کاربر سنتز کند.
این ربات به سرعت در حال افزایش محبوبیت است و اکنون مدت کوتاهی پس از راه‌اندازی در بیش از 700 سرور در سراسر جهان قرار دارد.

به عنوان یک تیم، ما راه‌های مختلفی را برای مفیدتر و قابل دسترس‌تر کردن ربات برای کاربران مورد بحث قرار دادیم.
ما تصمیم گرفتیم که ارائه یک ضبط و رونویسی از جلسات برای ثبت جلسات، ذخیره جلسات بازی و تعدادی موقعیت دیگر مفید خواهد بود.

## نمای کلی دانلود رونویسی و صدا

<center>
<img src="/images/blog/26-discord-download/2-seavoice-audio-transcript-download-discord-direct-message.png" alt="ربات SeaVoice Discord پس از هر جلسه یک پیام مستقیم با رونویسی و دانلود صدا ارسال می‌کند."/>

*ربات SeaVoice Discord پس از هر جلسه یک پیام مستقیم با رونویسی و دانلود صدا ارسال می‌کند.*
</center>

در طول چند ماه گذشته، تیم ما سخت کار کرده است تا این ایده را به واقعیت تبدیل کند.
اکنون، هنگامی که ربات را با دستور \`/recognize\` به تماس خود برای رونویسی مکالمه خود می‌آورید، تماس را نیز ضبط کرده و رونویسی‌ها را در پشت صحنه حفظ می‌کند.
هنگامی که از ربات می‌خواهید خارج شود، هر کسی که در تماس شرکت کرده است، یک پیام مستقیم از ربات دریافت می‌کند که حاوی یک رونویسی کامل و یک ضبط از تماس است.

<center>
<img src="/images/blog/26-discord-download/3-seavoice-discord-audio-download.png" alt="با کلیک بر روی لینک از ربات SeaVoice Discord، یک صفحه وب برای پیش‌نمایش و دانلود ضبط صدا باز می‌شود."/>

*با کلیک بر روی لینک از ربات SeaVoice Discord، یک صفحه وب برای پیش‌نمایش و دانلود ضبط صدا باز می‌شود.*
</center>

یک لینک برای دانلود کامل ضبط با فرمت mp3 وجود خواهد داشت.
این یک ضبط تک آهنگ است، بنابراین گفتار همه کاربران در یک فایل خواهد بود.
پردازش صوتی برای این کار ممکن است کمی زمان ببرد، بنابراین لطفاً چند ثانیه صبر کنید تا ربات لینک را ارسال کند، شاید برای مکالمات طولانی‌تر تا چند دقیقه.

<center>
<img src="/images/blog/26-discord-download/4-seavoice-discord-transcription-file.png" alt="فایل رونویسی قابل دانلود ارسال شده توسط ربات SeaVoice Discord."/>

*فایل رونویسی قابل دانلود ارسال شده توسط ربات SeaVoice Discord.*
</center>

رونویسی به صورت یک فایل متنی است و شامل مهرهای زمانی برای شروع و پایان هر چیزی که گفته شده است، و همچنین نام کاربری شخصی که آن را گفته است.
این کار باید ردیابی تماس‌ها را برای اعضای سرور شما آسان کند و برای ثبت جلسات پروژه و همچنین جلسات بازی مفید خواهد بود.

## چالش‌ها

همچنین باید توجه داشت که ما در مدیریت صدا با چالش‌های زیادی روبرو بودیم، زیرا Discord صدای هر کاربر را به طور جداگانه و بدون هیچ گونه سکوتی ارسال می‌کند.
بنابراین لطفاً به خاطر داشته باشید که ممکن است هنوز چند مشکل برای حل وجود داشته باشد، و ما به بهبود این ویژگی ادامه خواهیم داد تا ضبط‌های نهایی تا حد امکان دقیق باشند!
اگر با ضبط‌ها یا رونویسی‌های خود مشکلی داشتید، لطفاً تیم ما را در [سرور رسمی Discord SeaVoice](https://discord.gg/dfAYfwBQ) مطلع کنید.
<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## مسیرهای آینده

با آماده شدن نهایی این ویژگی چالش‌برانگیز برای انتشار، تیم ما در حال برنامه‌ریزی برای افزودنی‌های بعدی به ربات است.
برخی از مواردی که ما در آینده به آنها نگاه می‌کنیم، اجازه دادن به تنظیمات قابل تنظیم برای سرورها و/یا کاربران برای مواردی مانند: نحوه مدیریت ضبط‌ها، فرمت فایل رونویسی، اینکه آیا/چه زمانی باید سلب مسئولیت ضبط پخش شود، کانال پیش‌فرض برای خروجی رونویسی‌ها و غیره است.
ما دوست داریم هر پیشنهادی را که برای ویژگی‌های جدید (یا نحوه بهبود ویژگی‌های موجود) دارید در [سرور رسمی Discord SeaVoice](https://discord.gg/dfAYfwBQ) بشنویم.

## آن را امتحان کنید!

در این میان می‌توانید [ربات SeaVoice Discord](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) را به سرور خود دعوت کرده و خودتان آن را امتحان کنید.
همچنین می‌توانید [مستندات ربات SeaVoice](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) را نیز مطالعه کنید تا ببینید چگونه می‌توانید از ربات برای بهترین تناسب با نیازهای جامعه خود استفاده کنید.


امیدواریم این ویژگی‌های جدید به شما در هر کاری که از ربات استفاده می‌کنید کمک کند و از استفاده از آنها لذت ببرید!


با احترام،


تیم ربات SeaVoice
`;export{n as default};
