const n=`---
title: "بوت SeaVoice STT/TTS Discord: الأول الذي يوفر تسجيلات صوتية قابلة للتنزيل مع نصوص AI"
metatitle: "بوت SeaVoice STT/TTS Discord: تنزيلات التسجيلات"
date: 2022-12-13 11:51:16-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "مع أحدث إصدار، يعد بوت SeaVoice Discord الأول على المنصة الذي يقدم تسجيلات قنوات صوتية قابلة للتنزيل مع نصوص تم إنشاؤها بواسطة الذكاء الاصطناعي."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/26-discord-download/seavoice-discord-audio-transcript-download.jpg
url: /blog/seavoice-discord-recording-download/
---

*اكتسب بوت SeaVoice Discord شعبية كأحد أفضل الخيارات لنسخ الكلام في قنوات Discord الصوتية. مع أحدث إصدار، يعد البوت الأول على Discord الذي يقدم تسجيلات قنوات صوتية قابلة للتنزيل مع نصوص تم إنشاؤها بواسطة الذكاء الاصطناعي.*

# ملفات الصوت والنصوص القابلة للتنزيل على Discord: ميزات جديدة ومثيرة في أحدث إصدار من بوت SeaVoice

مرحباً بالجميع، يسعدنا أن نعلن عن ميزة جديدة لبوت SeaVoice Discord!

<center>
<img src="/images/blog/26-discord-download/1-seavoice-discord-speech-to-text.png" alt="بوت SeaVoice Discord ينسخ الكلام من قناة صوتية في الوقت الفعلي."/>

*بوت SeaVoice Discord ينسخ الكلام من قناة صوتية في الوقت الفعلي.*
</center>

منذ إطلاقه، كان لبوت SeaVoice Discord قدرتان رئيسيتان: ينسخ المحادثات باستخدام تقنيات تحويل الكلام إلى نص عالية الدقة ويمكنه تركيب الكلام بناءً على مدخلات المستخدم.
لقد نما بسرعة في شعبيته وهو الآن موجود في أكثر من 700 خادم حول العالم بعد وقت قصير من إطلاقه.

بصفتنا فريقًا، ناقشنا طرقًا مختلفة لجعل البوت أكثر فائدة وسهولة في الوصول للمستخدمين.
قررنا أن توفير تسجيل ونسخة من الجلسات سيكون مفيدًا لتسجيل الاجتماعات، وحفظ جلسات اللعب، وعدد من المواقف الأخرى.

## نظرة عامة على تنزيل النصوص والصوت

<center>
<img src="/images/blog/26-discord-download/2-seavoice-audio-transcript-download-discord-direct-message.png" alt="بوت SeaVoice Discord يرسل رسالة مباشرة مع تنزيلات النصوص والصوت بعد كل جلسة."/>

*بوت SeaVoice Discord يرسل رسالة مباشرة مع تنزيلات النصوص والصوت بعد كل جلسة.*
</center>

على مدار الأشهر القليلة الماضية، عمل فريقنا بجد لتحويل هذه الفكرة إلى حقيقة.
الآن، عندما تحضر البوت إلى مكالمتك لنسخ محادثتك باستخدام الأمر \`/recognize\`، فإنه سيسجل المكالمة أيضًا ويحتفظ بالنصوص خلف الكواليس.
عندما تطلب من البوت المغادرة، سيتلقى كل من شارك في المكالمة رسالة مباشرة من البوت تحتوي على نسخة كاملة وتسجيل للمكالمة.

<center>
<img src="/images/blog/26-discord-download/3-seavoice-discord-audio-download.png" alt="النقر على الرابط من بوت SeaVoice Discord يفتح صفحة ويب لمعاينة وتنزيل التسجيل الصوتي."/>

*النقر على الرابط من بوت SeaVoice Discord يفتح صفحة ويب لمعاينة وتنزيل التسجيل الصوتي.*
</center>

سيكون هناك رابط لتنزيل التسجيل الكامل بتنسيق mp3.
هذا تسجيل أحادي المسار، لذا سيكون الكلام من جميع المستخدمين في نفس الملف.
قد تستغرق معالجة الصوت بعض الوقت، لذا يرجى الانتظار بضع ثوانٍ حتى يرسل البوت الرابط، وربما بضع دقائق للمحادثات الأطول.

<center>
<img src="/images/blog/26-discord-download/4-seavoice-discord-transcription-file.png" alt="ملف نصي قابل للتنزيل أرسله بوت SeaVoice Discord."/>

*ملف نصي قابل للتنزيل أرسله بوت SeaVoice Discord.*
</center>

النص يكون في شكل ملف نصي ويتضمن طوابع زمنية لبداية ونهاية كل ما قيل، بالإضافة إلى اسم المستخدم للشخص الذي قاله.
يجب أن يجعل هذا الأمر سهلاً على أعضاء خادمك لتتبع المكالمات، وسيكون مفيدًا لتسجيل اجتماعات المشروع وكذلك جلسات اللعب.

## التحديات

تجدر الإشارة أيضًا إلى أننا واجهنا تحديًا كبيرًا في التعامل مع الصوت، حيث يرسل Discord صوت كل مستخدم بشكل منفصل وبدون أي صمت.
لذا يرجى الأخذ في الاعتبار أنه قد لا يزال هناك بعض المشكلات التي يجب حلها، وسنواصل تحسين هذه الميزة لجعل التسجيلات النهائية دقيقة قدر الإمكان!
إذا واجهت أي مشاكل في تسجيلاتك أو نصوصك، يرجى إبلاغ فريقنا على [خادم Discord SeaVoice الرسمي](https://discord.gg/dfAYfwBQ).
<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## الاتجاهات المستقبلية

مع استعداد هذه الميزة الصعبة أخيرًا للإصدار، يخطط فريقنا بالفعل لإضافاتنا التالية إلى البوت.
بعض الأشياء التي نبحث عنها في المستقبل هي السماح بتكوينات قابلة للتخصيص للخوادم و/أو المستخدمين لأشياء مثل: كيفية التعامل مع التسجيلات، وتنسيق ملف النص، وما إذا كان يجب تشغيل إخلاء مسؤولية التسجيل ومتى، والقناة الافتراضية لإخراج النصوص، وما إلى ذلك.
نود أن نسمع أي اقتراحات لديكم لميزات جديدة (أو كيفية تحسين الميزات الحالية) على [خادم Discord SeaVoice الرسمي](https://discord.gg/dfAYfwBQ).

## جربها!

في غضون ذلك، يمكنك دعوة [بوت SeaVoice Discord](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) إلى خادمك وتجربته بنفسك.
لا تتردد في قراءة [وثائق بوت SeaVoice](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) أيضًا لمعرفة كيفية استخدام البوت ليناسب احتياجات مجتمعك على أفضل وجه.


نأمل أن تساعدك هذه الميزات الجديدة في أي شيء تستخدم البوت من أجله وأن تستمتع باستخدامها!


مع خالص التقدير،


فريق بوت SeaVoice
`;export{n as default};
