const n=`---
title: "SeaVoice STT/TTS डिस्कॉर्ड बॉट: AI ट्रांसक्रिप्शन के साथ डाउनलोड करने योग्य वॉयस रिकॉर्डिंग प्रदान करने वाला पहला"
metatitle: "SeaVoice STT/TTS डिस्कॉर्ड बॉट: रिकॉर्डिंग डाउनलोड"
date: 2022-12-13 11:51:16-08:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "नवीनतम रिलीज़ के साथ, SeaVoice डिस्कॉर्ड बॉट प्लेटफ़ॉर्म पर AI-जनित ट्रांसक्रिप्शन के साथ डाउनलोड करने योग्य वॉयस चैनल रिकॉर्डिंग प्रदान करने वाला पहला है।"
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/26-discord-download/seavoice-discord-audio-transcript-download.jpg
url: /blog/seavoice-discord-recording-download/
---

*SeaVoice डिस्कॉर्ड बॉट डिस्कॉर्ड वॉयस चैनलों में भाषण को ट्रांसक्राइब करने के लिए सबसे अच्छे विकल्पों में से एक के रूप में लोकप्रियता प्राप्त कर रहा है। नवीनतम रिलीज़ के साथ, बॉट AI-जनित ट्रांसक्रिप्शन के साथ डाउनलोड करने योग्य वॉयस चैनल रिकॉर्डिंग प्रदान करने वाला डिस्कॉर्ड पर पहला है।*

# डिस्कॉर्ड पर डाउनलोड करने योग्य ऑडियो और ट्रांसक्रिप्ट फ़ाइलें: SeaVoice के नवीनतम बॉट रिलीज़ में रोमांचक नई सुविधाएँ

नमस्ते सभी को, हम SeaVoice डिस्कॉर्ड बॉट के लिए एक नई सुविधा की घोषणा करते हुए उत्साहित हैं!

<center>
<img src="/images/blog/26-discord-download/1-seavoice-discord-speech-to-text.png" alt="SeaVoice डिस्कॉर्ड बॉट वास्तविक समय में वॉयस चैनल से भाषण को ट्रांसक्राइब कर रहा है।"/>

*SeaVoice डिस्कॉर्ड बॉट वास्तविक समय में वॉयस चैनल से भाषण को ट्रांसक्राइब कर रहा है।*
</center>

रिलीज़ के बाद से, SeaVoice डिस्कॉर्ड बॉट में दो मुख्य क्षमताएँ थीं: यह अत्यधिक सटीक स्पीच-टू-टेक्स्ट तकनीकों का उपयोग करके वार्तालापों को ट्रांसक्राइब करता है और उपयोगकर्ता इनपुट के आधार पर भाषण को संश्लेषित कर सकता है।
यह तेजी से लोकप्रियता में बढ़ रहा है और लॉन्च होने के कुछ ही समय बाद अब दुनिया भर में 700 से अधिक सर्वर में है।

एक टीम के रूप में हमने उपयोगकर्ताओं के लिए बॉट को अधिक उपयोगी और सुलभ बनाने के विभिन्न तरीकों पर चर्चा की।
हमने फैसला किया कि सत्रों की रिकॉर्डिंग और प्रतिलेख प्रदान करना बैठकों को लॉग करने, प्ले सत्रों को सहेजने और कई अन्य स्थितियों के लिए उपयोगी होगा।

## ट्रांसक्रिप्शन और ऑडियो डाउनलोड अवलोकन

<center>
<img src="/images/blog/26-discord-download/2-seavoice-audio-transcript-download-discord-direct-message.png" alt="SeaVoice डिस्कॉर्ड बॉट प्रत्येक सत्र के बाद ट्रांसक्रिप्शन और ऑडियो डाउनलोड के साथ एक डीएम भेजता है।"/>

*SeaVoice डिस्कॉर्ड बॉट प्रत्येक सत्र के बाद ट्रांसक्रिप्शन और ऑडियो डाउनलोड के साथ एक डीएम भेजता है।*
</center>

पिछले कुछ महीनों से हमारी टीम इस विचार को हकीकत में बदलने के लिए कड़ी मेहनत कर रही है।
अब जब आप \`/recognize\` कमांड के साथ अपनी बातचीत को ट्रांसक्राइब करने के लिए बॉट को अपनी कॉल में लाते हैं, तो यह कॉल को भी रिकॉर्ड करेगा और पर्दे के पीछे ट्रांसक्रिप्शन को बनाए रखेगा।
जब आप बॉट को छोड़ने के लिए कहते हैं, तो कॉल में भाग लेने वाले सभी को बॉट से एक सीधा संदेश प्राप्त होगा जिसमें एक पूर्ण ट्रांसक्रिप्शन और कॉल की रिकॉर्डिंग होगी।

<center>
<img src="/images/blog/26-discord-download/3-seavoice-discord-audio-download.png" alt="SeaVoice डिस्कॉर्ड बॉट से लिंक पर क्लिक करने से ऑडियो रिकॉर्डिंग का पूर्वावलोकन और डाउनलोड करने के लिए एक वेबपेज खुलता है।"/>

*SeaVoice डिस्कॉर्ड बॉट से लिंक पर क्लिक करने से ऑडियो रिकॉर्डिंग का पूर्वावलोकन और डाउनलोड करने के लिए एक वेबपेज खुलता है।*
</center>

mp3 प्रारूप में पूर्ण रिकॉर्डिंग डाउनलोड करने के लिए एक लिंक होगा।
यह एक सिंगल ट्रैक रिकॉर्डिंग है, इसलिए सभी उपयोगकर्ताओं का भाषण एक ही फ़ाइल में होगा।
इसके लिए ऑडियो प्रोसेसिंग में थोड़ा समय लग सकता है, इसलिए बॉट को लिंक भेजने के लिए कुछ सेकंड का समय दें, शायद लंबी बातचीत के लिए कुछ मिनट तक।

<center>
<img src="/images/blog/26-discord-download/4-seavoice-discord-transcription-file.png" alt="SeaVoice डिस्कॉर्ड बॉट द्वारा भेजी गई डाउनलोड करने योग्य ट्रांसक्रिप्शन फ़ाइल।"/>

*SeaVoice डिस्कॉर्ड बॉट द्वारा भेजी गई डाउनलोड करने योग्य ट्रांसक्रिप्शन फ़ाइल।*
</center>

ट्रांसक्रिप्शन एक टेक्स्ट फ़ाइल के रूप में है और इसमें कही गई प्रत्येक चीज़ के प्रारंभ और अंत के लिए टाइमस्टैम्प शामिल हैं, साथ ही इसे कहने वाले व्यक्ति का उपयोगकर्ता नाम भी शामिल है।
यह आपके सर्वर के सदस्यों के लिए कॉल पर नज़र रखना आसान बना देगा, और परियोजना बैठकों के साथ-साथ प्ले सत्रों को लॉग करने के लिए भी सहायक होगा।

## चुनौतियाँ

यह भी ध्यान दिया जाना चाहिए कि हमें ऑडियो को नियंत्रित करने में काफी चुनौती का सामना करना पड़ा, क्योंकि डिस्कॉर्ड प्रत्येक उपयोगकर्ता के ऑडियो को अलग से और बिना किसी चुप्पी के भेजता है।
तो कृपया ध्यान रखें कि अभी भी कुछ मुद्दे हो सकते हैं जिन्हें हल करने की आवश्यकता है, और हम अंतिम रिकॉर्डिंग को यथासंभव सटीक बनाने के लिए इस सुविधा में सुधार करना जारी रखेंगे!
यदि आपको अपनी रिकॉर्डिंग या ट्रांसक्रिप्शन में कोई समस्या आती है, तो कृपया हमारी टीम को [आधिकारिक SeaVoice डिस्कॉर्ड सर्वर](https://discord.gg/dfAYfwBQ) पर बताएं।
<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## भविष्य की दिशाएँ

इस चुनौतीपूर्ण सुविधा के अंततः रिलीज़ के लिए तैयार होने के साथ, हमारी टीम पहले से ही बॉट में अपने अगले परिवर्धन की योजना बना रही है।
भविष्य के लिए हम जिन चीजों पर विचार कर रहे हैं, उनमें सर्वर और/या उपयोगकर्ताओं के लिए अनुकूलन योग्य कॉन्फ़िगरेशन की अनुमति देना शामिल है, जैसे: वे रिकॉर्डिंग को कैसे संभालना चाहते हैं, ट्रांसक्रिप्ट फ़ाइल का प्रारूप, रिकॉर्डिंग अस्वीकरण कब/कब चलाना है, ट्रांसक्रिप्शन आउटपुट करने के लिए डिफ़ॉल्ट चैनल, आदि।
हम अपने [आधिकारिक SeaVoice डिस्कॉर्ड सर्वर](https://discord.gg/dfAYfwBQ) पर नई सुविधाओं (या मौजूदा सुविधाओं को कैसे बेहतर बनाया जाए) के लिए आपके किसी भी सुझाव को सुनना पसंद करेंगे।

## इसे आज़माएं!

इस बीच आप [SeaVoice डिस्कॉर्ड बॉट](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) को अपने सर्वर में आमंत्रित कर सकते हैं और इसे स्वयं आज़मा सकते हैं।
आप [SeaVoice बॉट दस्तावेज़](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) को भी पढ़ने के लिए स्वतंत्र महसूस करें ताकि यह देख सकें कि आप बॉट का उपयोग अपनी समुदाय की जरूरतों को पूरा करने के लिए कैसे कर सकते हैं।


हमें उम्मीद है कि ये नई सुविधाएँ आपको बॉट का उपयोग करने के लिए किसी भी चीज़ में मदद करेंगी और आप उनका उपयोग करके मज़े करेंगे!


शुभकामनाएं,


SeaVoice बॉट टीम
`;export{n as default};
