const e=`---
title: "روبوت SeaVoice STT/TTS Discord: تحسينات الواجهة الخلفية والاستقرار"
metatitle: "روبوت SeaVoice STT/TTS Discord: تحسينات الواجهة الخلفية والا..."
date: 2022-12-13 11:58:34-08:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "مع أحدث إصدار، يطلق روبوت SeaVoice Discord تحسينات هائلة في الواجهة الخلفية تعمل على تحسين استقرار الروبوت والتطوير المستقبلي."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/27-discord-backend-improvements/seavoice-discord-stt-tts-bot-backend-improvements.jpg
canonicalURL: /blog/seavoice-discord-backend-improvements/
url: /blog/seavoice-discord-backend-improvements/
---


*اكتسب روبوت SeaVoice Discord شعبية كأحد أفضل الخيارات لنسخ الكلام في قنوات Discord الصوتية. مع أحدث إصدار، نطلق تحسينات هائلة في الواجهة الخلفية تعمل على تحسين استقرار الروبوت وتساعد في التطوير المستقبلي.*

# SeaVoice تتذكر: قاعدة البيانات متصلة بالإنترنت!

مرحبًا بالجميع، لقد عملنا مؤخرًا على بعض الأشياء خلف الكواليس لروبوت SeaVoice Discord التي نود مشاركتها!

كما رأيتم في منشور مدونتنا السابق، أضفنا الكثير من الميزات لروبوت SeaVoice، مثل تسجيلات المكالمات الجديدة والنسخ. إلى جانب هذه التطورات، منحنا روبوت SeaVoice Discord القدرة على تذكر ما فعله: كل شيء من الأوامر إلى تسجيل الأخطاء. الآن عندما يتحدث الروبوت إليك، أو تستخدمه لتسجيل مكالمة، يتم حفظ كل هذه المعلومات بطريقة منظمة.

## ماذا يعني هذا للمستخدمين
قد تسأل، ماذا يعني هذا لك الآن؟

حسنًا، لكي نبدأ، فإن ميزة النسخ وتنزيل الصوت الجديدة لدينا لن تكون ممكنة بدون تحسينات الواجهة الخلفية هذه! يمكننا الآن أيضًا تخزين أي أعطال مؤسفة تواجهها تلقائيًا حتى يتمكن فريق التطوير لدينا من البدء في إصلاح هذه المشكلات قبل أن تلاحظها. بالإضافة إلى ذلك، إذا قرر أي شخص أنه لم يعد يرغب في تخزين بياناته في نظامنا، فإن هذا التنظيم الجديد يسمح لنا بالعثور بسرعة على أي بيانات واستردادها و/أو إزالتها حسب الخادم والقناة والمستخدم والتاريخ وما إلى ذلك.

علاوة على ذلك، يفتح هذا الباب لميزات جديدة مثل تتبع الإحصائيات، والإشراف التلقائي، والمزيد. أيها المشرفون، هل ترغبون في التأكد من اتباع قواعد الخادم الخاص بكم أو التحقق من عدد مرات استخدام الروبوت في خادمكم؟ ربما ترغبون في استعراض تلك المحادثة المضحكة التي أجريتموها الأسبوع الماضي؟ مع وجود إطار عمل قاعدة البيانات الآن راسخًا ومستخدمًا في روبوت الإنتاج، أصبح الوصول إلى مجموعة واسعة من الميزات الجديدة أسهل بكثير.

## خصوصية البيانات

بطبيعة الحال، كلما ناقشنا حفظ بيانات المستخدم، يطرح سؤال خصوصية وأمان البيانات. إليك بعض النقاط الرئيسية حول كيفية تعاملنا مع بياناتك:
- يتم تخزين جميع بيانات المستخدم على خادم بعيد آمن، ولا يمكن الوصول إليه إلا لعدد قليل من موظفي Seasalt.ai المختارين.
- يسجل SeaVoice فقط البيانات المقدمة من Discord التي يقدمها المستخدمون عند التفاعل مع روبوت SeaVoice؛ ويشمل ذلك:
    - اسم ومعرف الخادم والقناة والمستخدم
    - النص المدخل في أمر \`/speak\`
    - الصوت المنطوق في قناة صوتية أثناء قيام الروبوت بتنفيذ أمر \`/recognize\`
- ستُستخدم هذه البيانات فقط بواسطة Seasalt.ai لتحسين الخدمات.
- يمكنك طلب إزالة أي من بياناتك أو كلها في أي وقت.

للحصول على التفاصيل الكاملة، يرجى الرجوع إلى [سياسة خصوصية Seasalt.ai](https://seasalt.ai/privacy/).

## الاتجاهات المستقبلية

الكثير من هذا الجزء من التحديث لن يكون ملحوظًا، ولكن بالنسبة لنا، الجزء الصعب قد انتهى، والآن يمكننا البدء في العمل على مشاريع تسمح لك بتخصيص واستخدام روبوت SeaVoice Discord أكثر مما كنت تتخيل.
إحدى الميزات القادمة هي التكوينات القابلة للتخصيص للخادم و/أو المستخدم.
مع وجود قاعدة البيانات، سيسمح لنا ذلك بحفظ التفضيلات في المستقبل، مثل ما إذا كنت تريد تذكيرك بأن الدردشة الصوتية يتم تسجيلها، أو من يتلقى رابط التنزيل لنسخ المكالمة، أو من يريد إلغاء التسجيل.

هل لديك أي أفكار ترغب في إضافتها الآن بعد أن أصبح بإمكاننا حفظ البيانات؟ لا تتردد في إرسال بعض الاقتراحات إلينا عبر [خادم SeaVoice Discord الرسمي](https://discord.gg/dfAYfwBQ)!

<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## جربه!

وإذا لم تكن قد جربت أحدث إصدار من روبوت SeaVoice بعد، فجربه! ادعُ [روبوت SeaVoice Discord](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) إلى خادمك.
لا تتردد في قراءة [وثائق روبوت SeaVoice](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) أيضًا لمعرفة كيفية استخدام الروبوت ليناسب احتياجات مجتمعك على أفضل وجه.

ترقبوا بعض التحديثات المثيرة القادمة!

شكرًا لكم،

فريق روبوت SeaVoice.
`;export{e as default};
