const e=`---
title: "SeaVoice STT/TTS Discord Bot: การปรับปรุงแบ็กเอนด์และความเสถียร"
metatitle: "SeaVoice STT/TTS Discord Bot: การปรับปรุงแบ็กเอนด์และความเสถ..."
date: 2022-12-13 11:58:34-08:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "ด้วยการเปิดตัวล่าสุด SeaVoice Discord Bot ได้เปิดตัวการปรับปรุงแบ็กเอนด์ครั้งใหญ่ ซึ่งช่วยเพิ่มความเสถียรของบอทและการพัฒนาในอนาคต"
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/27-discord-backend-improvements/seavoice-discord-stt-tts-bot-backend-improvements.jpg
canonicalURL: /blog/seavoice-discord-backend-improvements/
url: /blog/seavoice-discord-backend-improvements/
---


*SeaVoice Discord Bot ได้รับความนิยมในฐานะหนึ่งในตัวเลือกที่ดีที่สุดสำหรับการถอดเสียงพูดในช่องเสียง Discord ด้วยการเปิดตัวล่าสุด เรากำลังเปิดตัวการปรับปรุงแบ็กเอนด์ครั้งใหญ่ ซึ่งช่วยเพิ่มความเสถียรของบอทและช่วยในการพัฒนาในอนาคต*

# SeaVoice จดจำ: ฐานข้อมูลออนไลน์!

สวัสดีทุกคน ช่วงนี้เรากำลังทำงานเบื้องหลังสำหรับ SeaVoice Discord Bot ที่เราอยากจะแบ่งปัน!

อย่างที่คุณเห็นในบล็อกโพสต์ก่อนหน้าของเรา เราได้เพิ่มคุณสมบัติมากมายสำหรับ SeaVoice Bot เช่น การบันทึกการโทรและการถอดเสียงใหม่ของเรา นอกเหนือจากการพัฒนาเหล่านี้ เราได้มอบความสามารถให้ SeaVoice Discord Bot จดจำสิ่งที่ได้ทำไปแล้ว: ทุกอย่างตั้งแต่คำสั่งไปจนถึงการบันทึกข้อผิดพลาด ตอนนี้เมื่อบอทพูดกับคุณ หรือคุณใช้มันเพื่อบันทึกการโทร ข้อมูลทั้งหมดนั้นจะถูกบันทึกไว้อย่างเป็นระเบียบ

## สิ่งนี้หมายถึงอะไรสำหรับผู้ใช้
ตอนนี้คุณอาจสงสัยว่าสิ่งนี้หมายถึงอะไรสำหรับคุณ?

เริ่มต้นด้วย คุณสมบัติการถอดเสียงและการดาวน์โหลดเสียงใหม่ของเราจะไม่สามารถทำได้หากไม่มีการปรับปรุงแบ็กเอนด์เหล่านี้! ตอนนี้เรายังสามารถจัดเก็บข้อผิดพลาดที่ไม่คาดคิดที่คุณพบโดยอัตโนมัติ เพื่อให้ทีมพัฒนาของเราสามารถเริ่มแก้ไขปัญหาเหล่านี้ได้ก่อนที่คุณจะสังเกตเห็น นอกจากนี้ หากใครตัดสินใจว่าไม่ต้องการให้ข้อมูลของตนถูกจัดเก็บในระบบของเราอีกต่อไป การจัดระเบียบใหม่นี้ช่วยให้เราสามารถค้นหา ดึงข้อมูล และ/หรือลบข้อมูลใดๆ ได้อย่างรวดเร็วตามเซิร์ฟเวอร์ ช่อง ผู้ใช้ วันที่ ฯลฯ

ยิ่งไปกว่านั้น สิ่งนี้ยังเปิดประตูสู่คุณสมบัติใหม่ๆ เช่น การติดตามสถิติ การดูแลอัตโนมัติ และอื่นๆ อีกมากมาย ผู้ดูแลระบบ คุณต้องการให้แน่ใจว่ากฎของเซิร์ฟเวอร์ของคุณได้รับการปฏิบัติตาม หรือตรวจสอบว่าบอทถูกใช้บ่อยแค่ไหนในเซิร์ฟเวอร์ของคุณหรือไม่? บางทีคุณอาจต้องการดึงบทสนทนาที่ตลกขบขันที่คุณมีเมื่อสัปดาห์ที่แล้ว? ด้วยกรอบงานฐานข้อมูลที่มั่นคงและใช้งานอยู่ในบอทการผลิตแล้ว คุณสมบัติใหม่ๆ ที่หลากหลายจึงเข้าถึงได้ง่ายขึ้น

## ความเป็นส่วนตัวของข้อมูล

โดยธรรมชาติแล้ว เมื่อเราพูดถึงการบันทึกข้อมูลผู้ใช้ ย่อมมีคำถามเกี่ยวกับความเป็นส่วนตัวและความปลอดภัยของข้อมูล นี่คือประเด็นสำคัญบางประการเกี่ยวกับวิธีที่เราจัดการข้อมูลของคุณ:
- ข้อมูลผู้ใช้ทั้งหมดจะถูกเก็บไว้ในเซิร์ฟเวอร์ระยะไกลที่ปลอดภัย ซึ่งมีเพียงพนักงาน Seasalt.ai ที่ได้รับเลือกเท่านั้นที่สามารถเข้าถึงได้
- SeaVoice จะบันทึกเฉพาะข้อมูลที่ Discord จัดหาให้ ซึ่งผู้ใช้ให้ไว้เมื่อโต้ตอบกับบอท SeaVoice ซึ่งรวมถึง:
    - ชื่อและ ID ของเซิร์ฟเวอร์ ช่อง ผู้ใช้
    - ข้อความที่ป้อนในคำสั่ง \`/speak\`
    - เสียงที่พูดในช่องเสียงขณะที่บอทกำลังดำเนินการคำสั่ง \`/recognize\`
- ข้อมูลนี้จะถูกใช้โดย Seasalt.ai เพื่อปรับปรุงบริการเท่านั้น
- คุณสามารถขอให้ลบข้อมูลของคุณทั้งหมดหรือบางส่วนได้ตลอดเวลา

สำหรับรายละเอียดทั้งหมด โปรดดูที่ [นโยบายความเป็นส่วนตัวของ Seasalt.ai](https://seasalt.ai/privacy/)

## ทิศทางในอนาคต

การอัปเดตส่วนใหญ่จะไม่เป็นที่สังเกตเห็น แต่สำหรับเรา ส่วนที่ยากได้ผ่านพ้นไปแล้ว และตอนนี้เราสามารถเริ่มทำงานในโครงการที่ช่วยให้คุณปรับแต่งและใช้ SeaVoice Discord Bot ได้มากกว่าที่คุณคิด
คุณสมบัติหนึ่งที่กำลังจะมาถึงคือการกำหนดค่าเซิร์ฟเวอร์และ/หรือผู้ใช้ที่ปรับแต่งได้
ด้วยฐานข้อมูลที่พร้อมใช้งาน สิ่งนี้จะช่วยให้เราสามารถบันทึกการตั้งค่าในอนาคตได้ เช่น คุณต้องการให้เตือนว่ามีการบันทึกการสนทนาด้วยเสียงหรือไม่ ใครได้รับลิงก์ดาวน์โหลดการถอดเสียงการโทร หรือใครต้องการเลือกที่จะไม่ถูกบันทึก

มีแนวคิดใดบ้างที่คุณต้องการให้เพิ่มเข้ามาตอนนี้ที่เราสามารถบันทึกข้อมูลได้? อย่าลังเลที่จะส่งข้อเสนอแนะมาให้เราที่ [เซิร์ฟเวอร์ Discord อย่างเป็นทางการของ SeaVoice](https://discord.gg/dfAYfwBQ)!

<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## ลองใช้เลย!

และหากคุณยังไม่ได้ลองใช้ SeaVoice Bot เวอร์ชันล่าสุด ลองเลย! เชิญ [SeaVoice Discord Bot](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) ไปยังเซิร์ฟเวอร์ของคุณ
อย่าลังเลที่จะอ่าน [เอกสารประกอบของ SeaVoice Bot](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) เพื่อดูว่าคุณจะใช้บอทให้เหมาะสมกับความต้องการของชุมชนของคุณได้อย่างไร

โปรดติดตามการอัปเดตที่น่าตื่นเต้นที่จะมาถึง!

ขอบคุณ

ทีมงาน SeaVoice Bot
`;export{e as default};
