const e=`---
title: "SeaVoice STT/TTS Discord Bot: பின்தளம் மற்றும் நிலைத்தன்மை மேம்பாடுகள்"
metatitle: "SeaVoice STT/TTS Discord Bot: பின்தளம் மற்றும் நிலைத்தன்மை ம..."
date: 2022-12-13 11:58:34-08:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "சமீபத்திய வெளியீட்டில், SeaVoice Discord Bot ஆனது, போட் நிலைத்தன்மை மற்றும் எதிர்கால மேம்பாட்டை மேம்படுத்தும் பாரிய பின்தள மேம்பாடுகளை அறிமுகப்படுத்துகிறது."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/27-discord-backend-improvements/seavoice-discord-stt-tts-bot-backend-improvements.jpg
canonicalURL: /blog/seavoice-discord-backend-improvements/
url: /blog/seavoice-discord-backend-improvements/
---


*SeaVoice Discord Bot ஆனது Discord குரல் சேனல்களில் பேச்சை படியெடுப்பதற்கான சிறந்த விருப்பங்களில் ஒன்றாக பிரபலமடைந்து வருகிறது. சமீபத்திய வெளியீட்டில், போட் நிலைத்தன்மை மற்றும் எதிர்கால மேம்பாட்டை மேம்படுத்தும் பாரிய பின்தள மேம்பாடுகளை நாங்கள் அறிமுகப்படுத்துகிறோம்.*

# SeaVoice நினைவில் கொள்கிறது: தரவுத்தளம் ஆன்லைனில்!

அனைவருக்கும் வணக்கம், சமீபத்தில் SeaVoice Discord Bot க்காக திரைக்குப் பின்னால் சில வேலைகளைச் செய்து வருகிறோம், அதை உங்களுடன் பகிர்ந்து கொள்ள விரும்புகிறோம்!

எங்கள் முந்தைய வலைப்பதிவு இடுகையில் நீங்கள் பார்த்தது போல், எங்கள் புதிய அழைப்பு பதிவுகள் மற்றும் படியெடுத்தல் போன்ற பல அம்சங்களை SeaVoice Bot க்கு சேர்த்துள்ளோம். இந்த மேம்பாடுகளுடன், SeaVoice Discord Bot க்கு அது செய்ததை நினைவில் கொள்ளும் திறனை வழங்கியுள்ளோம்: கட்டளைகள் முதல் பிழை பதிவு வரை அனைத்தும். இப்போது நீங்கள் போட் உங்களுடன் பேசும்போது, அல்லது அழைப்பை பதிவு செய்ய அதைப் பயன்படுத்தும்போது, அந்த அனைத்து தகவல்களும் ஒழுங்கமைக்கப்பட்ட முறையில் சேமிக்கப்படும்.

## இது பயனர்களுக்கு என்ன அர்த்தம்
இப்போது இது உங்களுக்கு என்ன அர்த்தம் என்று நீங்கள் கேட்கலாம்?

சரி, தொடங்குவதற்கு, இந்த பின்தள மேம்பாடுகள் இல்லாமல் எங்கள் புதிய படியெடுத்தல் மற்றும் ஆடியோ பதிவிறக்க அம்சம் சாத்தியமில்லை! நீங்கள் அனுபவிக்கும் எந்த துரதிர்ஷ்டவசமான செயலிழப்புகளையும் நாங்கள் இப்போது தானாகவே சேமிக்க முடியும், இதனால் எங்கள் மேம்பாட்டுக் குழு நீங்கள் கவனிக்கும் முன்பே இந்த சிக்கல்களை சரிசெய்யத் தொடங்கலாம். கூடுதலாக, யாராவது தங்கள் தரவை எங்கள் கணினியில் சேமிக்க விரும்பவில்லை என்று முடிவு செய்தால், இந்த புதிய அமைப்பு சேவையகம், சேனல், பயனர், தேதி போன்றவற்றின் அடிப்படையில் எந்த தரவையும் விரைவாகக் கண்டறியவும், மீட்டெடுக்கவும் மற்றும்/அல்லது அகற்றவும் அனுமதிக்கிறது.

மேலும், இது புள்ளிவிவர கண்காணிப்பு, தானியங்கு மிதப்படுத்தல் மற்றும் பல புதிய அம்சங்களுக்கான கதவைத் திறக்கிறது. மதிப்பீட்டாளர்கள், உங்கள் சேவையக விதிகள் பின்பற்றப்படுகின்றன என்பதை உறுதிப்படுத்த விரும்புகிறீர்களா அல்லது உங்கள் சேவையகத்தில் போட் எவ்வளவு அடிக்கடி பயன்படுத்தப்படுகிறது என்பதை சரிபார்க்க விரும்புகிறீர்களா? ஒருவேளை நீங்கள் கடந்த வாரம் செய்த அந்த வேடிக்கையான உரையாடலை மீண்டும் பார்க்க விரும்புகிறீர்களா? தரவுத்தள கட்டமைப்பு இப்போது உறுதியாக நிறுவப்பட்டு உற்பத்தி போட்டில் பயன்படுத்தப்படுவதால், பலவிதமான புதிய அம்சங்கள் எளிதாக அடையக்கூடியவை.

## தரவு தனியுரிமை

இயற்கையாகவே, பயனர் தரவைச் சேமிப்பது பற்றி நாம் விவாதிக்கும் போதெல்லாம், தரவு தனியுரிமை மற்றும் பாதுகாப்பு பற்றிய கேள்வி எழுகிறது. உங்கள் தரவை நாங்கள் எவ்வாறு கையாளுகிறோம் என்பது பற்றிய சில முக்கிய குறிப்புகள் இங்கே:
- அனைத்து பயனர் தரவும் பாதுகாப்பான தொலைநிலை சேவையகத்தில் சேமிக்கப்படும், இதை சில தேர்ந்தெடுக்கப்பட்ட Seasalt.ai ஊழியர்கள் மட்டுமே அணுக முடியும்.
- SeaVoice போட் உடன் தொடர்பு கொள்ளும்போது பயனர்கள் வழங்கும் Discord தரவை மட்டுமே SeaVoice பதிவு செய்கிறது; இதில் அடங்கும்:
    - சேவையகம், சேனல், பயனர் பெயர் & ஐடி
    - \`/speak\` கட்டளையில் உள்ளிடப்பட்ட உரை
    - போட் \`/recognize\` கட்டளையைச் செய்யும்போது குரல் சேனலில் பேசப்படும் ஆடியோ
- இந்தத் தரவு Seasalt.ai ஆல் சேவைகளை மேம்படுத்த மட்டுமே பயன்படுத்தப்படும்.
- உங்கள் தரவு அனைத்தையும் அல்லது எதையும் எந்த நேரத்திலும் நீக்க நீங்கள் கோரலாம்.

முழு விவரங்களுக்கு, [Seasalt.ai தனியுரிமைக் கொள்கையைப்](https://seasalt.ai/privacy/) பார்க்கவும்.

## எதிர்கால திசைகள்

இந்த புதுப்பிப்பின் பெரும்பாலான பகுதி கவனிக்கப்படாது, ஆனால் எங்களுக்கு கடினமான பகுதி முடிந்துவிட்டது, இப்போது நீங்கள் SeaVoice Discord Bot ஐ நீங்கள் நினைத்ததை விட அதிகமாக தனிப்பயனாக்க மற்றும் பயன்படுத்த அனுமதிக்கும் திட்டங்களில் வேலை செய்யத் தொடங்கலாம்.
எதிர்காலத்தில் வரவிருக்கும் ஒரு அம்சம் தனிப்பயனாக்கக்கூடிய சேவையகம் மற்றும்/அல்லது பயனர் உள்ளமைவுகள் ஆகும்.
தரவுத்தளம் இருப்பதால், எதிர்காலத்தில் விருப்பத்தேர்வுகளைச் சேமிக்க இது உதவும், உதாரணமாக, குரல் அரட்டை பதிவு செய்யப்படுகிறது என்பதை உங்களுக்கு நினைவூட்ட வேண்டுமா, அழைப்பு படியெடுத்தல் பதிவிறக்க இணைப்பை யார் பெறுகிறார்கள், அல்லது யார் பதிவு செய்யப்படுவதைத் தவிர்க்க விரும்புகிறார்கள்.

நாங்கள் இப்போது தரவைச் சேமிக்க முடியும் என்பதால், நீங்கள் சேர்க்க விரும்பும் ஏதேனும் யோசனைகள் உள்ளதா? [அதிகாரப்பூர்வ SeaVoice Discord Server](https://discord.gg/dfAYfwBQ) இல் எங்களுக்கு சில பரிந்துரைகளை அனுப்ப தயங்க வேண்டாம்!

<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## இதை முயற்சிக்கவும்!

நீங்கள் இன்னும் SeaVoice Bot இன் சமீபத்திய வெளியீட்டை முயற்சிக்கவில்லை என்றால், அதை முயற்சிக்கவும்! [SeaVoice Discord Bot](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) ஐ உங்கள் சேவையகத்திற்கு அழைக்கவும்.
உங்கள் சமூகத்தின் தேவைகளுக்கு ஏற்ப போட்டை எவ்வாறு பயன்படுத்துவது என்பதைப் பார்க்க [SeaVoice Bot ஆவணங்களையும்](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) படிக்க தயங்க வேண்டாம்.

விரைவில் வரவிருக்கும் சில அற்புதமான புதுப்பிப்புகளுக்கு காத்திருங்கள்!

நன்றி,

SeaVoice போட் குழு.
`;export{e as default};
