const e=`---
title: "ربات دیسکورد SeaVoice STT/TTS: بهبودهای بک‌اند و پایداری"
metatitle: "ربات دیسکورد SeaVoice STT/TTS: بهبودهای بک‌اند و پایداری"
date: 2022-12-13 11:58:34-08:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Sydney Burgess, Kim Dodds, Drake Farmer, Jack Harvison, Dylan Strong, Cody Vernon
description: "با آخرین نسخه، ربات دیسکورد SeaVoice بهبودهای عظیمی در بک‌اند راه‌اندازی می‌کند که پایداری ربات و توسعه آینده را بهبود می‌بخشد."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/27-discord-backend-improvements/seavoice-discord-stt-tts-bot-backend-improvements.jpg
canonicalURL: /blog/seavoice-discord-backend-improvements/
url: /blog/seavoice-discord-backend-improvements/
---


*ربات دیسکورد SeaVoice به عنوان یکی از بهترین گزینه‌ها برای رونویسی گفتار در کانال‌های صوتی دیسکورد محبوبیت پیدا کرده است. با جدیدترین نسخه، ما بهبودهای عظیمی در بک‌اند راه‌اندازی می‌کنیم که پایداری ربات را بهبود می‌بخشد و به توسعه آینده کمک می‌کند.*

# SeaVoice به یاد می‌آورد: پایگاه داده آنلاین!

سلام به همه، اخیراً ما روی برخی چیزها در پشت صحنه برای ربات دیسکورد SeaVoice کار کرده‌ایم که می‌خواهیم به اشتراک بگذاریم!

همانطور که در پست وبلاگ قبلی ما دیدید، ما ویژگی‌های زیادی را برای ربات SeaVoice اضافه کردیم، مانند ضبط تماس‌های جدید و رونویسی. در کنار این پیشرفت‌ها، ما به ربات دیسکورد SeaVoice توانایی به خاطر سپردن کارهایی که انجام داده است را داده‌ایم: همه چیز از دستورات گرفته تا ثبت خطا. اکنون وقتی ربات با شما صحبت می‌کند، یا از آن برای ضبط تماس استفاده می‌کنید، تمام آن اطلاعات به صورت سازمان‌یافته ذخیره می‌شود.

## این به چه معناست برای کاربران
حالا ممکن است بپرسید این برای شما چه معنایی دارد؟

خب، برای شروع، قابلیت‌های جدید رونویسی و دانلود صوتی ما بدون این بهبودهای بک‌اند امکان‌پذیر نبود! ما همچنین می‌توانیم هرگونه خرابی ناگواری را که تجربه می‌کنید به طور خودکار ذخیره کنیم تا تیم توسعه ما بتواند قبل از اینکه شما متوجه شوید، این مشکلات را برطرف کند. علاوه بر این، اگر کسی تصمیم بگیرد که دیگر نمی‌خواهد داده‌هایش در سیستم ما ذخیره شود، این سازماندهی جدید به ما امکان می‌دهد تا هر داده‌ای را بر اساس سرور، کانال، کاربر، تاریخ و غیره به سرعت پیدا، بازیابی و/یا حذف کنیم.

علاوه بر این، این امر درهایی را برای ویژگی‌های جدیدی مانند ردیابی آمار، تعدیل خودکار و موارد دیگر باز می‌کند. مدیران، آیا می‌خواهید مطمئن شوید که قوانین سرور شما رعایت می‌شود یا بررسی کنید که ربات چند بار در سرور شما استفاده می‌شود؟ شاید می‌خواهید آن مکالمه خنده‌داری را که هفته گذشته داشتید، دوباره ببینید؟ با چارچوب پایگاه داده که اکنون به طور محکم در جای خود قرار گرفته و در ربات تولیدی استفاده می‌شود، طیف گسترده‌ای از ویژگی‌های جدید به راحتی در دسترس هستند.

## حریم خصوصی داده‌ها

طبیعتاً هر زمان که در مورد ذخیره داده‌های کاربر صحبت می‌کنیم، سوال حریم خصوصی و امنیت داده‌ها مطرح می‌شود. در اینجا چند نکته کلیدی در مورد نحوه مدیریت داده‌های شما آورده شده است:
- تمام داده‌های کاربر در یک سرور راه دور امن ذخیره می‌شوند که فقط تعداد محدودی از کارمندان Seasalt.ai می‌توانند به آن دسترسی داشته باشند.
- SeaVoice فقط داده‌های ارائه شده توسط Discord را که کاربران هنگام تعامل با ربات SeaVoice ارائه می‌دهند، ضبط می‌کند؛ این شامل موارد زیر است:
    - نام و شناسه سرور، کانال، کاربر
    - متن وارد شده در دستور \`/speak\`
    - صدای صحبت شده در یک کانال صوتی در حالی که ربات در حال اجرای دستور \`/recognize\` است
- این داده‌ها فقط توسط Seasalt.ai برای بهبود خدمات استفاده خواهند شد.
- شما می‌توانید در هر زمان درخواست حذف تمام یا بخشی از داده‌های خود را داشته باشید.

برای جزئیات کامل، لطفاً به [سیاست حفظ حریم خصوصی Seasalt.ai](https://seasalt.ai/privacy/) مراجعه کنید.

## مسیرهای آینده

بسیاری از این بخش از به‌روزرسانی قابل توجه نخواهد بود، اما برای ما قسمت سخت کار تمام شده است و اکنون می‌توانیم روی پروژه‌هایی کار کنیم که به شما امکان می‌دهند ربات دیسکورد SeaVoice را حتی بیشتر از آنچه فکر می‌کردید، سفارشی‌سازی و استفاده کنید.
یکی از ویژگی‌های در حال ظهور، پیکربندی‌های قابل تنظیم سرور و/یا کاربر است.
با وجود پایگاه داده، این امکان را به ما می‌دهد که در آینده تنظیمات برگزیده را ذخیره کنیم، مانند اینکه آیا می‌خواهید به شما یادآوری شود که یک چت صوتی در حال ضبط است، چه کسی لینک دانلود رونویسی تماس را دریافت می‌کند، یا چه کسی می‌خواهد از ضبط شدن انصراف دهد.

آیا ایده‌ای دارید که می‌خواهید اکنون که می‌توانیم داده‌ها را ذخیره کنیم، اضافه شود؟ در [سرور رسمی دیسکورد SeaVoice](https://discord.gg/dfAYfwBQ) پیشنهادات خود را برای ما ارسال کنید!

<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>

## آن را امتحان کنید!

و اگر هنوز آخرین نسخه ربات SeaVoice را امتحان نکرده‌اید، حتماً آن را امتحان کنید! [ربات دیسکورد SeaVoice](https://discord.com/oauth2/authorize?client_id=1001955060210749492&scope=bot) را به سرور خود دعوت کنید.
همچنین می‌توانید [مستندات ربات SeaVoice](https://wiki.seasalt.ai/seavoice/discord/discord-bot/) را مطالعه کنید تا ببینید چگونه می‌توانید از ربات برای بهترین تناسب با نیازهای جامعه خود استفاده کنید.

منتظر به‌روزرسانی‌های هیجان‌انگیز آینده باشید!

با تشکر،

تیم ربات SeaVoice.
`;export{e as default};
