const e=`---
title: "کاربر وب‌چت را ترک کرده است: از پیام‌رسانی نزدیک من برای ارسال پیام به او استفاده کنید!"
metatitle: "کاربر وب‌چت را ترک کرده است: با پیام‌رسانی نزدیک من با او در تماس باشید!"
date: 2022-12-25 12:48:52-08:00
modified_date: 2025-07-28T16:03:25.123456
draft: false
author: Xuchen Yao
description: "پیام‌رسانی نزدیک من یک مشکل وب‌چت را حل می‌کند: حتی *پس از* ترک مکالمه توسط کاربر، دوباره با او در تماس باشید."
weight: 1
tags:
  - NearMe
image: images/blog/28-use-near-me-messaging-to-recover-lost-webchat/near-me-messaging-google-business-messages-recover-webchat.png
canonicalURL: /blog/use-near-me-messaging-to-recover/
url: /blog/use-near-me-messaging-to-recover/
---

صبح کریسمس سال 2022، با چند پیام از کاربری به نام هنری از خواب بیدار شدم. وقتی به پیام‌ها رسیدم، هنری قبلاً رفته بود. تنها چیزی که به دست آوردم، پیام‌هایی بود که او از طریق وب‌چت ارسال کرده بود و نام او.

(بعداً مشخص شد که هنری در نیجریه مستقر است و در منطقه زمانی کاملاً متفاوتی قرار دارد. وقتی با او تماس تصویری گرفتم، به معنای واقعی کلمه می‌توانستم عرق را روی صورتش ببینم، در تضاد با هوای بسیار سرد سیاتل.)

خوشبختانه، وب‌چت در وب‌سایت Seasalt.ai از طریق پیام‌رسانی نزدیک من است (به‌روزرسانی: ما از آن زمان محصول را به یک سازنده چت‌بات همه‌کاناله تغییر داده‌ایم. اکنون [SeaChat](https://chat.seasalt.ai/?utm_source=blog) نامیده می‌شود!). بک‌اند توسط Google Business Messages پشتیبانی می‌شود، که به شما ویژگی خوبی برای ارسال پیام به تلفن کاربر در عرض 30 روز پس از اولین تماس او با شما را می‌دهد. در مقابل، فیس‌بوک تنها یک [پنجره 24 ساعته](https://developers.facebook.com/docs/messenger-platform/policy/policy-overview/) برای تماس با کاربر پس از شروع مکالمه با ربات مسنجر شما را می‌دهد.

برای کاربران کنجکاو از نظر فنی، این قابلیت توسط چارچوب Google Play Services که روی تلفن‌های کاربران نصب شده است، فعال می‌شود. بنابراین تا زمانی که Google را روی تلفن خود داشته باشند، همیشه می‌توانید با آنها در تماس باشید.

بنابراین حکم: پیام‌رسانی نزدیک من یک ویژگی عالی برای جذب مشتریان بالقوه از دست رفته ارائه می‌دهد.

چه هدیه کریسمس بهتری برای یک کسب‌وکار از یک مشتری بالقوه بازیابی شده و یک چت سرگرم‌کننده با او در قاره‌ای دیگر وجود دارد؟
`;export{e as default};
