const n=`---
title: "Discord இல் பேச்சு-க்கு-உரை: ஒரு STT Discord Bot Case Study"
metatitle: "Discord இல் பேச்சு-க்கு-உரை: ஒரு STT Discord Bot Case Study"
date: 2023-01-23 11:25:00-08:00
draft: false
author: Kim Dodds
description: "இந்த வலைப்பதிவில், பல வாரங்களாக உண்மையான பேச்சு-க்கு-உரை தரவை மதிப்பாய்வு செய்த பிறகு, உண்மையான Discord பயனர்கள் SeaVoice சேவைகளை எவ்வாறு பயன்படுத்துகிறார்கள் என்பது குறித்த எங்கள் கண்டுபிடிப்புகளைப் பற்றி விவாதிப்போம்."
weight: 1
tags:
  - SeaVoice
  - Discord
image: images/blog/30-stt-case-study/discord-stt-bot-case-study.jpg
canonicalURL: /blog/speech-to-text-discord-case-study/
url: /blog/speech-to-text-discord-case-study/
---

*Discord இல் வேகமான மற்றும் துல்லியமான உரை-க்கு-பேச்சு மற்றும் பேச்சு-க்கு-உரை போட்களில் ஒன்றான SeaVoice ஐ அறிமுகப்படுத்திய பிறகு, பயனர்கள் உண்மையில் சேவைகளுடன் எவ்வாறு தொடர்பு கொள்கிறார்கள் என்பதை நாங்கள் புரிந்துகொள்ள விரும்பினோம். இந்த வலைப்பதிவில், பல வாரங்களாக உண்மையான பேச்சு-க்கு-உரை பயனர் தரவை மதிப்பாய்வு செய்த பிறகு எங்கள் கண்டுபிடிப்புகளைப் பற்றி விவாதிப்போம்.*

# SeaVoice: ஒரு உரை-க்கு-பேச்சு & பேச்சு-க்கு-உரை Discord Bot

Discord, முதன்மையாக ஆடியோ மற்றும் உரை அடிப்படையிலான அரட்டையின் கலவையைப் பயன்படுத்தும் ஒரு தளமாக இருப்பதால், குரல் நுண்ணறிவு மற்றும் இயற்கை மொழி செயலாக்க சேவைகளுக்கான ஒரு அற்புதமான சோதனை மைதானமாகும். நாங்கள் SeaVoice Bot ஐ, உரை-க்கு-பேச்சு மற்றும் பேச்சு-க்கு-உரை கட்டளைகளுடன், ஆகஸ்ட் 2022 இல் Discord இல் பயன்படுத்தினோம். போட் எவ்வாறு செயல்படுகிறது என்பதைப் பற்றி மேலும் அறிய, அல்லது ஒரு குறுகிய வீடியோ டெமோவைப் பார்க்க, நீங்கள் [SeaVoice Bot wiki](https://wiki.seasalt.ai/seavoice/discord/1-intro-discord-bot/) ஐப் பார்வையிடலாம். அதே ஆண்டின் நவம்பரில், நாங்கள் ஒரு புதிய பதிப்பை குறிப்பிடத்தக்க பின்தள மேம்பாடுகளுடன் (எங்கள் வலைப்பதிவு இடுகையில் விவரிக்கப்பட்டுள்ளபடி: [SeaVoice Discord Bot: பின்தள & நிலைத்தன்மை மேம்பாடுகள்](https://seasalt.ai/blog/27-seavoice-discord-backend-improvements/)) வெளியிட்டோம், இது பயனர்கள் SeaVoice போட் உடன் எவ்வாறு தொடர்பு கொள்கிறார்கள் என்பது குறித்த அநாமதேய தரவை பதிவு செய்ய அனுமதிக்கிறது. எங்கள் கடைசி வலைப்பதிவில் ([TTS Discord Bot Case Study](https://seasalt.ai/blog/29-discord-tts-case-study/)) உரை-க்கு-பேச்சு கட்டளையிலிருந்து 1 மாத பயனர் தரவை நாங்கள் பகுப்பாய்வு செய்தோம். ஒரு தொடர்ச்சியாக, இந்த இடுகையில் நாங்கள் சுமார் 3 வார பேச்சு-க்கு-உரை பயனர் தரவைப் பார்ப்போம்.

## SeaVoice STT பயன்பாடு

எழுதும் நேரத்தில், SeaVoice Bot கிட்டத்தட்ட 900 சேவையகங்களில் சேர்க்கப்பட்டுள்ளது! சுமார் 260 சேவையகங்கள் மொத்தம் 600 க்கும் மேற்பட்ட பங்கேற்பாளர்களுடன் STT கட்டளையை ஒரு முறையாவது முயற்சி செய்துள்ளனர். கடந்த 3 வாரங்களில் நாங்கள் கிட்டத்தட்ட 1,800 STT அமர்வுகளை நடத்தியுள்ளோம் மற்றும் மொத்தம் **அரை மில்லியனுக்கும் அதிகமான டிரான்ஸ்கிரிப்ஷன் வரிகளை** வெளியிட்டுள்ளோம்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-sessions-per-day.png" alt="3 வாரங்களில் SeaVoice Discord Bot தினசரி பேச்சு-க்கு-உரை அமர்வுகள்."/>

*3 வாரங்களில் SeaVoice Discord Bot தினசரி பேச்சு-க்கு-உரை அமர்வுகள்.*
</center>

ஒரு நாளைக்கு மொத்த STT அமர்வுகளின் எண்ணிக்கையைப் பார்த்தால், அது 40 முதல் 140 க்கும் அதிகமாக (சராசரியாக சுமார் 70) ஏற்ற இறக்கமாக இருக்கலாம் என்று கண்டறிந்துள்ளோம். நாங்கள் உருவாக்கும் மொத்த டிரான்ஸ்கிரிப்ஷன் வரிகளின் எண்ணிக்கையையும் நாம் கருத்தில் கொள்ளலாம். மெதுவான நாளில், நாங்கள் 10 ஆயிரம் வரிகளை மட்டுமே உருவாக்குகிறோம், இருப்பினும், ஒரு பிஸியான நாளில் நாங்கள் 40 ஆயிரம் வரிகளுக்கு மேல் உருவாக்கியுள்ளோம். அதை ஒரு கண்ணோட்டத்தில் பார்த்தால், ஜனவரி 18 அன்று, நாங்கள் 102 STT அமர்வுகளை நடத்தினோம், மொத்தம் 30 ஆயிரம் டிரான்ஸ்கிரிப்ஷன் வரிகளுக்கு சற்று குறைவாக; இது கிட்டத்தட்ட 40 மணிநேர பதிவு நேரத்திற்கு சமம்.

பெரும்பாலான அமர்வுகள் குறுகிய உரையாடல்களுக்குப் பயன்படுத்தப்பட்டாலும் (ஒரு அமர்வுக்கு சராசரியாக 57 வரிகள்), ஒரு அமர்வுக்கு சராசரியாக 650 வரிகளை உயர்த்தும் மிக நீண்ட அமர்வுகள் கணிசமான எண்ணிக்கையில் இருப்பதையும் நாங்கள் கண்டறிந்தோம். எங்கள் மிக நீண்ட அமர்வு 30 ஆயிரத்துக்கும் மேற்பட்ட வரிகளைக் கொண்டிருந்தது, இது ஒரு சராசரி நாளின் மதிப்புக்கு மேல்! இறுதியாக, ஒவ்வொரு அமர்விலும் எத்தனை பயனர்கள் இருக்கிறார்கள் என்பதையும் நாங்கள் பார்த்தோம், மேலும் ஒவ்வொரு அமர்விலும் பொதுவாக 4 முதல் 5 பயனர்கள் இருப்பதை நாங்கள் கண்டறிந்தோம் - இருப்பினும், ஒருமுறை நாங்கள் 45 பங்கேற்பாளர்களைக் கொண்ட ஒரு மெய்நிகர் கருத்தரங்கில் நேரடி டிரான்ஸ்கிரிப்ஷனை ஆதரிக்க போட்டைப் பயன்படுத்தினோம்!

<center>
<img src="/images/blog/30-stt-case-study/discord-transcription-lines-per-day.png" alt="3 வாரங்களில் SeaVoice Discord Bot ஒரு நாளைக்கு டிரான்ஸ்கிரிப் செய்யப்பட்ட வரிகள்."/>

*3 வாரங்களில் SeaVoice Discord Bot ஒரு நாளைக்கு டிரான்ஸ்கிரிப் செய்யப்பட்ட வரிகள்.*
</center>

பெரும்பாலான சேவையகங்கள் STT அமர்வை சில முறைக்கு மேல் பயன்படுத்தவில்லை என்றாலும், இந்த சேவையை விரிவாகப் பயன்படுத்தும் சில சேவையகங்கள் உள்ளன. டிசம்பர் பிற்பகுதியில் STT பயன்பாட்டுத் தரவைப் பதிவு செய்யத் தொடங்கியதிலிருந்து, ஒரு சேவையகத்திற்கு சராசரி மொத்த அமர்வுகளின் எண்ணிக்கை சுமார் 7 ஆகும்; இருப்பினும், எங்கள் #1 சேவையகம் 131 அமர்வுகளைப் பதிவு செய்துள்ளது - இது ஒரு நாளைக்கு சராசரியாக 6 அமர்வுகளுக்கு மேல்! அதே சேவையகம் வெறும் 3 வாரங்களில் 150 ஆயிரத்துக்கும் மேற்பட்ட பேச்சு வரிகளை டிரான்ஸ்கிரிப் செய்துள்ளது! அதைவிடவும் சுவாரஸ்யமாக, எங்கள் #1 பயனர் அதே சேவையகத்தைச் சேர்ந்தவர் மற்றும் அவரது சொந்த பேச்சின் 60 ஆயிரத்துக்கும் மேற்பட்ட வரிகளை டிரான்ஸ்கிரிப் செய்துள்ளார்!

## அவதானிப்புகள்

### மக்கள் ஏன் பேச்சு-க்கு-உரையைப் பயன்படுத்துகிறார்கள்

<center>
<img src="/images/blog/30-stt-case-study/discord-audio-transcript-download-user-quote.jpg" alt="ஒரு SeaVoice Discord போட் பயனர் நிலைத்த ஆடியோ மற்றும் டிரான்ஸ்கிரிப்ஷன் கோப்புகள் குறித்து உற்சாகத்தை வெளிப்படுத்துகிறார்."/>

*ஒரு SeaVoice Discord போட் பயனர் நிலைத்த ஆடியோ மற்றும் டிரான்ஸ்கிரிப்ஷன் கோப்புகள் குறித்து உற்சாகத்தை வெளிப்படுத்துகிறார்.*
</center>

எனவே பயன்பாட்டுத் தரவைப் பார்த்த பிறகு எங்கள் முதல் கேள்வி: **அடிக்கடி பயன்படுத்தும் பயனர்கள் ஏன் முதலில் பேச்சு-க்கு-உரையைப் பயன்படுத்துகிறார்கள்?**

சில விளக்கங்களைக் கண்டறிய தரவுத்தளத்தைப் பார்த்தோம். இருப்பினும், பயனர்கள் TTS சேவையைப் பயன்படுத்துவதற்கு மாறாக STT சேவையைப் பயன்படுத்துவதற்கான உறுதியான விளக்கங்களைக் கண்டறிவது மிகவும் கடினமாக இருந்தது. வெளிப்படையாக, மக்கள் TTS ஐ ஏன் பயன்படுத்துகிறார்கள் என்பதை அரட்டையில் உள்ள மற்றவர்களுக்கு விளக்க வேண்டிய அவசியம் இருப்பதாக உணர்கிறார்கள், ஆனால் STT உடன் குறைவாகவே உணர்கிறார்கள். எதுவாக இருந்தாலும், பயனர்கள் STT சேவையைப் பயன்படுத்த ஏன் முடிவு செய்கிறார்கள் என்பது குறித்த சில நுண்ணறிவுகளை வழங்கிய சில சுவாரஸ்யமான டிரான்ஸ்கிரிப்ஷன்களை நான் கண்டேன்.

__*பயனர்கள் STT ஐ ஏன் பயன்படுத்துகிறார்கள்:*__

- “இதனால்தான் டிரான்ஸ்கிரிப்ட் பயன்படுத்தப்படுகிறது, ஏனென்றால் நான் தவறவிட்ட விஷயங்களைப் பார்க்க முடியும்.”
- “[பயனர்] காது கேளாதவர், எனவே அவர் அதை டிரான்ஸ்கிரிப் செய்யும் ஒரு போட்டைப் பெறுகிறார்”
- “[பயனர்] அவர்களுடன் ரெய்டு செய்கிறார், மேலும் அவர்கள் பொருட்களை டிரான்ஸ்கிரிப் செய்ய அதைப் பயன்படுத்துகிறார்கள், ஆனால் பின்னர் [பயனர்] ஓ, நாம் அதை ******* D மற்றும் D விஷயங்களுக்கும் பயன்படுத்தலாம்”
- “நான் பின்னர் இந்த டிரான்ஸ்கிரிப்டுகளில் சிலவற்றை மீண்டும் சென்று படிக்க காத்திருக்க முடியாது [...] நான் அந்த பதிவைக் கேட்கவும் அந்த டிரான்ஸ்கிரிப்டை மீண்டும் பார்க்கவும் விரும்புகிறேன்”
- “நாம் இங்கு எங்கள் சந்திப்புகளை நடத்தினால், சந்திப்பின் டிரான்ஸ்கிரிப்டை AI க்கு அனுப்பலாம்”
- “மக்களுடன் ஒரு சந்திப்பின் போது, ஒரு டிரான்ஸ்கிரிப்டை உண்மையில் பார்ப்பது அருமை”
- “[மக்கள்] அரட்டையில் இல்லாதவர்கள் அல்லது சமூகத்தில் உள்ளவர்கள், ஆனால் குரல் அரட்டையின் ஒரு பகுதியாக இல்லாதவர்கள், ஆனால் அவர்கள் பார்க்கவும் படிக்கவும் முடிவு செய்கிறார்கள்”

எனவே பொதுவாக, பெரும்பாலான பயனர்கள் நேரடி டிரான்ஸ்கிரிப்ஷனின் வசதியை அனுபவிப்பதாகத் தெரிகிறது, இது உரையாடலைக் கண்காணிக்கவும் அவர்கள் தவறவிட்ட இடைவெளிகளை நிரப்பவும் உதவும். இது குறிப்பாக செவித்திறன் குறைபாடு அல்லது ஆடியோ/இணைப்பு சிக்கல்கள் உள்ள பயனர்களுக்கு பொருந்தும். சில பயனர்களுக்கு மிகப்பெரிய நன்மை என்னவென்றால், அவர்களின் உரையாடலின் நிரந்தர ஆடியோ மற்றும் உரை பதிவை வைத்திருப்பது; இது Dungeons & Dragons அமர்வு பதிவை பராமரிப்பது அல்லது முக்கியமான சந்திப்புகளின் பதிவை வைத்திருப்பது போன்ற பயன்பாட்டு நிகழ்வுகளுக்கு குறிப்பாக பொருந்தும்.

பல பயனர்கள் STT சேவையைப் பயன்படுத்தியதற்கான காரணத்தை வெளிப்படையாகக் கூறாததால், போட்டைப் பயன்படுத்தும் போது அவர்கள் என்ன செய்கிறார்கள் என்பதைப் புரிந்துகொள்வதும் பயனுள்ளதாகத் தோன்றியது. பயனர்களிடமிருந்து டிரான்ஸ்கிரிப்ஷன்களை மதிப்பாய்வு செய்வது, டிரான்ஸ்கிரிப் செய்யும் போது அவர்கள் என்னென்ன செயல்பாடுகளைச் செய்கிறார்கள் என்பது குறித்த குறிப்புகளை எனக்கு அளித்தது:

__*பயனர்கள் STT ஐப் பயன்படுத்தும் போது என்ன செய்கிறார்கள்:*__

- சும்மா அரட்டை அடிப்பது
    - கேமிங்:
    - சாதாரண கேமிங்
    - மேம்பட்ட கேமிங் (எ.கா. குழு MMO, Massive Multiplayer Online, ரெய்டுகளை ஒருங்கிணைத்தல்)
- ரோல் பிளேயிங் கேம்கள் (Dungeons & Dragons)
- ஸ்ட்ரீமிங் / உள்ளடக்கத்தைப் பதிவு செய்தல்
- பள்ளி / தொழில்முறை / தன்னார்வப் பணிகளைப் பற்றி விவாதித்தல்

பெரும்பாலான டிரான்ஸ்கிரிப்ஷன்கள் “சும்மா அரட்டை அடிப்பது” மற்றும் “சாதாரண கேமிங்” வகைகளில் வருகின்றன. மேலே பார்த்தது போல, இந்த விஷயத்தில் பெரும்பாலான பயனர்கள் Discord குரல் சேனலின் அணுகலை மேம்படுத்தவும் மற்றும்/அல்லது உரையாடலில் அவர்கள் தவறவிட்ட இடைவெளிகளை நிரப்ப நேரடி டிரான்ஸ்கிரிப்ஷனைப் பார்ப்பதன் வசதியை அனுபவிக்கவும் போட்டைப் பயன்படுத்துகிறார்கள் என்று நான் நினைக்கிறேன். சில சந்தர்ப்பங்களில் (MMO ரெய்டுகளுக்குப் பயன்படுத்தப்படும் போது), கேமிங் விவாதங்கள் மிகவும் சிக்கலானவை மற்றும் பயனர்கள் நிகழ்நேரத்தில் ஒருவருக்கொருவர் ஒருங்கிணைக்கிறார்கள்; பயனர்கள் விளையாடும் போது டிரான்ஸ்கிரிப்டுகளைப் பார்க்க முடியும் என்பதால், நேரடி டிரான்ஸ்கிரிப்ஷன்கள் குழுவின் வெற்றிக்கு மிகவும் பயனுள்ளதாக இருக்கும்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-for-mmo-raid.jpg" alt="ஒரு MMO ரெய்டின் போது சிக்கலான விவாதத்தின் எடுத்துக்காட்டு."/>

*ஒரு MMO ரெய்டின் போது சிக்கலான விவாதத்தின் எடுத்துக்காட்டு.*
</center>

பள்ளி, தொழில்முறை மற்றும்/அல்லது தன்னார்வ சமூகக் கூட்டங்கள் போன்ற மிகவும் தீவிரமான உரையாடல்களை டிரான்ஸ்கிரிப் செய்ய பல பயனர்கள் போட்டைப் பயன்படுத்துவதாகவும் தெரிகிறது. நாங்கள் எங்கள் போட்டை ஒரு ஆன்லைன் தொழில்நுட்ப மாநாட்டையும், [UnTechCon](https://gfsc.studio/2022/11/14/announcing-untechcon.html) ஐயும் டிரான்ஸ்கிரிப் செய்யப் பயன்படுத்தினோம். இந்த சந்தர்ப்பங்களில், இறுதி பதிவு மற்றும் டிரான்ஸ்கிரிப்ஷன் கோப்புகள் சந்திப்புக்குப் பிறகு பயனர்களுக்கு மதிப்பாய்வு செய்ய மிகவும் உதவியாக இருக்கும். நான் கண்ட கடைசி சுவாரஸ்யமான எடுத்துக்காட்டு, ஒரு பயனர் தங்கள் ஸ்ட்ரீமிற்கான உள்ளடக்கத்தைப் பதிவு செய்வது. இறுதி டிரான்ஸ்கிரிப்ட் நேர முத்திரைகளுடன் வருவதால், பயனர்கள் தங்கள் பதிவு செய்யப்பட்ட ஆடியோ அல்லது வீடியோ உள்ளடக்கத்திற்கான துணைத்தலைப்புகளாக டிரான்ஸ்கிரிப்ட் கோப்பை பதிவேற்றலாம்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-accessibility-user-quote.jpg" alt="ஒரு SeaVoice பயனர் Discord குரல் சேனல்களை மேலும் அணுகக்கூடியதாக மாற்றியதற்கு நன்றி தெரிவிக்கிறார்."/>

*ஒரு SeaVoice பயனர் Discord குரல் சேனல்களை மேலும் அணுகக்கூடியதாக மாற்றியதற்கு நன்றி தெரிவிக்கிறார்.*
</center>

ஆனால் அவர்கள் STT சேவையைப் பயன்படுத்துவதற்கான சரியான காரணம் எதுவாக இருந்தாலும், பல பயனர்கள் குரல் சேனல் உரையாடல்களில் பங்கேற்க முடிந்ததால் உற்சாகத்தை வெளிப்படுத்தினர், இல்லையெனில் அவர்களால் முடியாது. STT சேவை Discord குரல் சேனல்களை மேலும் அணுகக்கூடியதாக ஆக்குகிறது என்று நாங்கள் நம்புகிறோம், மேலும் இது எங்கள் வழக்கமான பயனர்கள் சேவையைப் பயன்படுத்துவதற்கான முக்கிய காரணம்.

### SeaVoice Discord Bot பற்றிய கருத்து

பதிவுகளில் கண்டறியப்பட்ட மற்றொரு சுவாரஸ்யமான தலைப்பு, போட்டைப் பற்றிய கருத்து. அதிர்ஷ்டவசமாக, போட் மற்றும் அதன் செயல்திறன் குறித்து பல நேர்மறையான கருத்துக்களை நாங்கள் கண்டோம்.

<center>
<img src="/images/blog/30-stt-case-study/discord-seavoice-transcription-accuracy.png" alt="ஒரு SeaVoice பயனர் டிரான்ஸ்கிரிப்ஷன் துல்லியம் குறித்து கருத்து தெரிவிக்கிறார்."/>

*ஒரு SeaVoice பயனர் டிரான்ஸ்கிரிப்ஷன் துல்லியம் குறித்து கருத்து தெரிவிக்கிறார்.*
</center>

நாங்கள் சில ஆக்கபூர்வமான கருத்துக்களையும் கண்டறிந்தோம்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-accuracy-british-accent.png" alt="ஒரு SeaVoice பயனர் பிரிட்டிஷ் உச்சரிப்புகளுக்கான மேம்பாட்டை பரிந்துரைக்கிறார்."/>

*ஒரு SeaVoice பயனர் பிரிட்டிஷ் உச்சரிப்புகளுக்கான மேம்பாட்டை பரிந்துரைக்கிறார்.*
</center>

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-siri-accent-accuracy-comparison.png" alt="ஒரு பயனர் SeaVoice இன் உச்சரிப்பு ஆங்கிலத்தில் உள்ள செயல்திறனை Siri உடன் ஒப்பிடுகிறார்."/>

*ஒரு பயனர் SeaVoice இன் உச்சரிப்பு ஆங்கிலத்தில் உள்ள செயல்திறனை Siri உடன் ஒப்பிடுகிறார்.*
</center>

பெரும்பாலான ஆக்கபூர்வமான கருத்துக்கள், அமெரிக்கன் அல்லாத உச்சரிப்பு ஆங்கிலத்தில் போட் சரியாக செயல்படாததுடன் தொடர்புடையவை; குறிப்பாக பயனர்கள் பிரிட்டிஷ் மற்றும் ஸ்காட்டிஷ் உச்சரிப்புகளைக் குறிப்பிட்டனர். எங்கள் STT சேவைகளின் எதிர்காலத்திற்காக, பல்வேறு ஆங்கில உச்சரிப்புகளுக்கான எங்கள் பேச்சு அங்கீகாரத்தை மேம்படுத்துவதில் குறிப்பிடத்தக்க முயற்சி எடுக்கலாம். நிச்சயமாக, ஆங்கிலம் மட்டுமே எங்கள் பயனர்கள் பேசும் மொழி அல்ல, எனவே போட்டில் மேலும் மொழி ஆதரவைச் சேர்க்கவும் நாங்கள் திட்டமிட்டுள்ளோம். உண்மையில், நாங்கள் தற்போது எங்கள் தைவானிய மாண்டரின் STT மற்றும் TTS ஒருங்கிணைப்புகளை இறுதி செய்து வருகிறோம், மேலும் விரைவில் போட்டின் புதுப்பிக்கப்பட்ட பதிப்பை வெளியிடுவோம்.

## தனியுரிமை, தரவு உணர்திறன் மற்றும் சாத்தியமான புண்படுத்தும் உள்ளடக்கம்

AI வளர்ச்சி நெறிமுறை சிக்கல்களின் வெள்ளத்தால் சூழப்பட்டுள்ளது. எங்கள் மாதிரிகள் சிறப்பாக செயல்பட மிகப்பெரிய அளவிலான உண்மையான பயனர் தரவு தேவை, *ஆனால் எங்கள் பயனர்களின் தனியுரிமையை மதிக்கும் அதே வேளையில் அந்த தரவை எவ்வாறு நெறிமுறை ரீதியாக சேகரிப்பது?* மாதிரிகள் அவர்களுக்கு வழங்கப்பட்ட தரவின் அடிப்படையில் மட்டுமே கற்றுக்கொள்கின்றன, எனவே (சாத்தியமான எதிர்பாராத) சார்புகளைக் கொண்டுள்ளன; *எனவே எங்கள் மாதிரிகள் எங்கள் அனைத்து பயனர்களுக்கும் சமமாக சிறப்பாக சேவை செய்வதை எவ்வாறு உறுதிப்படுத்துவது?* மேலும், எங்கள் மாதிரிகளுக்கு சமூக ஏற்றுக்கொள்ளும் கருத்து இல்லை மற்றும் சில பயனர்கள் புண்படுத்தும் முடிவுகளை உருவாக்கலாம். எங்கள் பயனர்களில் ஒருவர் மிகவும் சரளமாக கூறியது போல்: *“போட் செய்தால் அது இனவெறியா என்பதுதான் கேள்வி”*.

<center>
<img src="/images/blog/30-stt-case-study/stt-accidental-racial-slur.png" alt="ஒரு SeaVoice பயனர் ஒரு சிக்கலான தவறான டிரான்ஸ்கிரிப்ஷனை சுட்டிக்காட்டுகிறார்."/>

*ஒரு SeaVoice பயனர் ஒரு சிக்கலான தவறான டிரான்ஸ்கிரிப்ஷனை சுட்டிக்காட்டுகிறார்.*
</center>

இந்த புள்ளிகளை நான் எழுப்புவதற்கான காரணம், பதிவுகளில் உள்ள சில கவலைக்குரிய டிரான்ஸ்கிரிப்ஷன்கள். முதல் சிக்கல் என்னவென்றால், போட் எப்போதாவது புண்படுத்தும் உள்ளடக்கத்தை டிரான்ஸ்கிரிப் செய்கிறது. மேலே உள்ள எடுத்துக்காட்டில், போட் ஒருவரின் பயனர்பெயரை இனவெறிச் சொல்லாக தற்செயலாக டிரான்ஸ்கிரிப் செய்தது. வெளிப்படையாக இது போட்டின் முடிவில் ஒரு பிழை, இது எங்கள் பயனர்களுக்கு புண்படுத்தும் மற்றும் விசாரிக்கப்பட வேண்டும். ஆனால் இது மேலும் கேள்விகளுக்கு வழிவகுக்கிறது: *புண்படுத்துவதற்கும் தீங்கு விளைவிப்பதற்கும் இடையில் நாம் எங்கு கோடு வரைய வேண்டும்?*

<center>
<img src="/images/blog/30-stt-case-study/discord-transcription-censor.png" alt="ஒரு SeaVoice பயனர் டிரான்ஸ்கிரிப்ஷனில் இருந்து சில வார்த்தைகளை தணிக்கை செய்ய முயற்சிப்பது குறித்து கருத்து தெரிவிக்கிறார்."/>

*ஒரு SeaVoice பயனர் டிரான்ஸ்கிரிப்ஷனில் இருந்து சில வார்த்தைகளை தணிக்கை செய்ய முயற்சிப்பது குறித்து கருத்து தெரிவிக்கிறார்.*
</center>

சரி, தொடங்குவதற்கு நாங்கள் அந்த அதிகாரத்தை பயனர்களுக்கு வழங்க முடிவு செய்துள்ளோம். நாங்கள் வேலை செய்யப் போகும் அடுத்த அம்சங்களில் ஒன்று TTS மற்றும் STT இன் உள்ளமைக்கக்கூடிய தணிக்கை ஆகும். இது சேவையகங்களுக்கு விருப்பமாக கெட்ட வார்த்தைகள், பாலியல் உள்ளடக்கம், இனவெறிச் சொற்கள் போன்றவற்றுக்கு தணிக்கைகளை பயன்படுத்த அனுமதிக்கும்.

<center>
<img src="/images/blog/30-stt-case-study/discord-careful-transcript-content.png" alt="ஒரு SeaVoice பயனர் மற்றொரு பங்கேற்பாளரை அவர்கள் சொல்வது டிரான்ஸ்கிரிப்டில் வரும் என்பதை கவனத்தில் கொள்ளுமாறு எச்சரிக்கிறார்."/>

*ஒரு SeaVoice பயனர் மற்றொரு பங்கேற்பாளரை அவர்கள் சொல்வது டிரான்ஸ்கிரிப்டில் வரும் என்பதை கவனத்தில் கொள்ளுமாறு எச்சரிக்கிறார்.*
</center>

சுவாரஸ்யமாக, நாங்கள் கண்ட மற்றொரு தொடர்புடைய சிக்கல் என்னவென்றால், பயனர்கள் டிரான்ஸ்கிரிப்டில் சில விஷயங்கள் தோன்றாமல் இருக்க தங்களைத் தாங்களே தணிக்கை செய்து கொண்டனர். இது ஆச்சரியமாக பொதுவானது, மேலும் பயனர்கள் தாங்கள் சொல்லப் போவதை போட் டிரான்ஸ்கிரிப் செய்ய விரும்பவில்லை என்று விளக்கிய பல சந்தர்ப்பங்களை நான் கண்டேன், எனவே அவர்கள் நிறுத்திவிட்டு STT ஐ மீண்டும் தொடங்கினர். இது பயனரின் முடிவில் முற்றிலும் சரியான கவலையாகும், எடுத்துக்காட்டாக, போட் சில முக்கியமான தகவல்களை டிரான்ஸ்கிரிப் செய்ய விரும்பவில்லை என்றால்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-pause-deafen.png" alt="போட்டை காது கேளாததாக்குவதன் மூலம் STT ஐ எவ்வாறு இடைநிறுத்துவது."/>

*போட்டை காது கேளாததாக்குவதன் மூலம் STT ஐ எவ்வாறு இடைநிறுத்துவது.*
</center>

இந்த விஷயத்தில் பயனர் அனுபவத்தை மேம்படுத்த எந்த வழியும் இல்லை என்று எனக்குத் தெரியவில்லை, ஆனால் பயனர்கள் போட் எந்த ஆடியோவையும் அனுப்பாமல் இருக்க தற்காலிகமாக போட்டை “காது கேளாததாக்கலாம்” என்று நான் அறிவுறுத்துகிறேன். இந்த விஷயத்தில், போட் “காது கேளாததாக்கப்படும்” வரை பூஜ்ஜிய ஆடியோ தரவைப் பெறும், எனவே பயனர் அடிப்படையில் ஒரு புதிய அமர்வை நிறுத்தாமல் மற்றும் தொடங்காமல் STT அமர்வை இடைநிறுத்தலாம்.

<center>
<img src="/images/blog/30-stt-case-study/discord-stt-opt-out-mute.jpg" alt="ஒரு SeaVoice பயனர் போட் உடன் மற்றொரு பங்கேற்பாளரின் அசௌகரியம் குறித்து கருத்து தெரிவிக்கிறார்."/>

*ஒரு SeaVoice பயனர் போட் உடன் மற்றொரு பங்கேற்பாளரின் அசௌகரியம் குறித்து கருத்து தெரிவிக்கிறார்.*
</center>

இறுதியாக, நாங்கள் கண்ட கடைசி சிக்கல் என்னவென்றால், சில பயனர்கள் போட் டிரான்ஸ்கிரிப் செய்வதில் மிகவும் அசௌகரியமாக உணர்கிறார்கள், அவர்கள் போட் இருக்கும்போது குரல் சேனலில் பேசுவதைத் தீவிரமாகத் தவிர்க்கிறார்கள். இது எங்கள் இலக்கிற்கு ***முற்றிலும் எதிரானது***, அதாவது Discord குரல் சேனல்களை அனைவருக்கும் மேலும் அணுகக்கூடியதாக மாற்றுவது. பயனர்கள் எங்கள் [தனியுரிமைக் கொள்கையை](https://seasalt.ai/privacy) ஏற்றுக்கொண்டு, அவர்களின் தரவை பொறுப்புடன் பயன்படுத்த எங்களை நம்புவார்கள் என்று நாங்கள் நம்புகிறோம், நாங்கள் நிச்சயமாக அனைவரின் தனியுரிமை உரிமையையும் மதிக்கிறோம். எனவே, **நாங்கள் செயல்படுத்தப் போகும் அடுத்த அம்சம் ஒரு STT விலகல் அமைப்பாகும்**. இது எந்தவொரு பயனரையும் STT பதிவு மற்றும் டிரான்ஸ்கிரிப்ஷனில் இருந்து விலக்க அனுமதிக்கும், மேலும் அவர்களின் ஆடியோ தரவு போட் மூலம் எந்த வகையிலும் அணுகப்படவோ அல்லது சேகரிக்கப்படவோ மாட்டாது.

இந்த திட்டமிடப்பட்ட அம்சங்கள், குரல் சேனல்களை அனைவருக்கும் மேலும் அணுகக்கூடியதாக மாற்றவும், பயனர்களுக்கு SeaVoice Bot உடன் அவர்கள் வசதியாக இருக்கும் மட்டத்தில் தொடர்பு கொள்ளும் திறனை வழங்கவும் உதவும் என்று நாங்கள் நம்புகிறோம். எதிர்காலத்தில், SeaVoice ஐ சிறந்ததாக மாற்ற இந்த சவாலான சிக்கல்களை முன்கூட்டியே தீர்க்க தொடர்ந்து முயற்சி செய்வோம்!

எங்கள் Discord Bot இல் உங்கள் ஆர்வத்திற்கு நன்றி மற்றும் உங்கள் தொடர்ச்சியான ஆதரவிற்காக எங்கள் பயனர்களுக்கு நன்றி! எங்கள் STT தயாரிப்பு பற்றி மேலும் அறிய எங்கள் [SeaVoice Speech-to-Text முகப்புப் பக்கம்](https://suite.seasalt.ai/tts) ஐப் பார்வையிடலாம். எங்கள் குரல் நுண்ணறிவு தயாரிப்புகளில் ஏதேனும் ஒன்றின் ஒருவருக்கு ஒருவர் டெமோவிற்கு, [டெமோ படிவத்தை பதிவு செய்யவும்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting).

நீங்கள் இன்னும் SeaVoice போட்டை முயற்சிக்கவில்லை என்றால், எங்கள் போட்டைப் பற்றி மேலும் அறியலாம் மற்றும் [SeaVoice Discord Bot Wiki](https://wiki.seasalt.ai/seavoice/discord/1-intro-discord-bot/) இலிருந்து உங்கள் சேவையகத்தில் சேர்க்கலாம். எங்கள் [அதிகாரப்பூர்வ SeaVoice Discord Server](https://discord.gg/dfAYfwBQ) இல் சேரவும் தயங்க வேண்டாம்.

<center>
<iframe src="https://discordapp.com/widget?id=919037515514654721&theme=dark" width="350" height="500" allowtransparency="true" frameborder="0" sandbox="allow-popups allow-popups-to-escape-sandbox allow-same-origin allow-scripts"></iframe>
</center>
`;export{n as default};
