const n=`---
title: "خدمة العملاء في الخطوط الجوية المتحدة: الجيد، السيئ، والقبيح"
metatitle: "تحليل خدمة العملاء في الخطوط الجوية المتحدة"
date: 2023-03-21 11:25:00-08:00
modified_date: 2025-07-28 16:56:53+00:00
draft: false
author: Xuchen Yao
description: "يشارك Xuchen Yao تجربته الأخيرة مع خدمة عملاء الخطوط الجوية المتحدة خلال تأخير وإلغاء الرحلات ويقترح حلولًا لمعالجة تحدي التوسع الديناميكي لدعم العملاء خلال ذروة حركة المرور."
weight: 1
tags:
  - SeaX
image: images/blog/31-cx-at-united-airlines/flight-delay-illustration.png
canonicalURL: /blog/customer-service-at-united-airlines/
url: /blog/customer-service-at-united-airlines/
---

*[Seasalt.ai](https://seasalt.ai) الرئيس التنفيذي، Xuchen Yao، يشارك تجربته الأخيرة مع خدمة عملاء الخطوط الجوية المتحدة بعد مواجهة تأخيرات وإلغاءات في الرحلات. دفعه ذلك إلى إدراك التحديات التي تواجهها خدمة عملاء شركات الطيران في التوسع الديناميكي للتعامل مع زيادة حركة المرور خلال مثل هذه المواقف. يتحدث Xuchen عن التحسينات المحتملة مثل تحويل حركة المرور التي يمكن خدمتها ذاتيًا بعيدًا عن الوكلاء البشريين، وتحسين كفاءة الوكلاء البشريين، وتطوير التكنولوجيا لتحديد المشكلات المحتملة وإزالة المخاطر بشكل استباقي.*

تمت كتابة هذه المدونة على متن الرحلة UA2 من سنغافورة إلى سان فرانسيسكو في 22/3/2023.

لقد استمتعت مؤخرًا برحلة UA1 من سان فرانسيسكو (SFO) إلى سنغافورة (SIN). سرعان ما تحولت المتعة إلى سوء حظ بسبب إلغاء الرحلة. إليك ما تعلمته عن خدمة عملاء يونايتد من منظور خبير تقني يبني مراكز اتصال.



# رحلة ذات تأخيرين: تأخير وإلغاء

كانت خطة الرحلة إلى سنغافورة من سياتل يوم الثلاثاء 14/3/2023 كالتالي:

<center>
<img src="/images/blog/31-cx-at-united-airlines/united-flights.png" alt="رحلاتي المخطط لها مع يونايتد"/>

*7:29 صباحًا – 09:42 صباحًا، من سياتل (SEA) إلى سان فرانسيسكو (SFO) على متن الرحلة UA2368. 11:50 صباحًا – 08:15 مساءً، من سان فرانسيسكو (SFO) إلى سنغافورة (SIN) على متن الرحلة UA29.*
</center>

للأسف، لم أستقل أيًا من الرحلتين.

تأخرت الرحلة الأولى لمدة 1.5 ساعة بسبب ازدحام في مطار سياتل (في الساعة 7 صباحًا!). مما قلل وقت انتقالي إلى 0 في SFO. تحدثت إلى خدمة العملاء الأرضية في SEA ووضعوني على متن رحلة ألاسكا من SEA إلى SFO. تأخرت رحلة ألاسكا أيضًا ولكنها وصلت إلى SFO في الساعة 11 صباحًا، مما أعطاني بالكاد وقتًا كافيًا للحاق بالرحلة التالية.

**الجيد**: سمحت لي يونايتد بتغيير رحلتي إلى ألاسكا مجانًا.

**الجيد**: كانت يونايتد استباقية للغاية بشأن التأخيرات عبر رمز قصير "26266". عندما حدث التأخير، عرضت حتى خيارات لإعادة حجز رحلاتي.

**السيئ**: خيار إعادة حجز الرحلة يقتصر فقط على رحلات يونايتد. لا توجد إعادة حجز بين شركات الطيران. كان علي التحدث إلى شخص لإعادة حجزي على رحلة مختلفة.

**القبيح**: لماذا كان مطار SEA مزدحمًا جدًا في الساعة 7 صباحًا؟!

<center>
<table>
  <tr>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-1.jpg" alt="دعم يونايتد عبر الرسائل النصية - 1"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-2.jpg" alt="دعم يونايتد عبر الرسائل النصية - 2"/></td>
  </tr>
 </table>

*نظام رسائل يونايتد إيرلاينز النصية في الوقت المناسب واستباقي.*
</center>


1. ما كان مثيرًا للاهتمام هو على متن الرحلة UA1. بقينا على الأرض لمدة 3 ساعات وفي النهاية تم إلغاء الرحلة بسبب الأحداث التالية:
2. أولاً، كانت سان فرانسيسكو تشهد رياحًا قوية جدًا أدت إلى توقف جميع الرحلات الجوية.
ثم عندما سُمح بالطيران، كانت جميع الطائرات تنتظر في طابور طويل جدًا للإقلاع.
3. أخيرًا، عندما كاد دورنا يأتي، قال الطيارون إنهم يعملون ساعات إضافية ووفقًا للوائح FAA، كان من غير القانوني لهم الاستمرار في الطيران. لأن الرحلة إلى سنغافورة كانت 17 ساعة وبالنظر إلى الوقت الذي قضوه على الأرض، لكانوا قد تجاوزوا الحد الأقصى بحلول وصولهم إلى سنغافورة.

للأسف، لم يكن هناك طيارون بديلون، لذلك تم إلغاء الرحلة بأكملها.

**القبيح**: خلال الساعات الثلاثة التي قضيناها على الأرض، قدمت يونايتد قطعتين من البسكويت. هذا كل شيء.

اندفع الجميع من الطائرة، يفكرون في كيفية تأثير ذلك على سفرهم. بما أن هذه رحلة دولية، لكان علينا أن نصل إلى سنغافورة في يوم مختلف. ليس في اليوم التالي، بل في الواقع بعد يومين: لأن سنغافورة تتقدم بـ 15 ساعة والرحلة تستغرق 17 ساعة.

ثم هرع حوالي 300 راكب إلى خدمة العملاء الأرضية في يونايتد. بحلول الوقت الذي وصلت فيه إلى خدمة عملاء يونايتد، كان هناك بالفعل حوالي 200 شخص في الطابور أمامي. تأثر الكثير منهم بسبب الطقس من رحلات أخرى تحملها يونايتد.

كان التحدث مع وكيل أرضي أمرًا ميؤوسًا منه بالنظر إلى مدى بطء حركة الطابور. أعلم أن هناك رحلة أخرى في الساعة 11 مساءً إلى سنغافورة في نفس اليوم، أيضًا من يونايتد. أملي هو إعادة الحجز على تلك الرحلة في الساعة 11 مساءً. ربما أراد الكثير من الناس من رحلتي فعل الشيء نفسه ولكنهم وقفوا جميعًا في الطابور مثلي.

إليك ما فعلته:

1. اتصلت بيونايتد عبر الهاتف: 800-864-8331
2. أرسلت رسالة نصية إلى وكيل يونايتد الافتراضي عبر الرمز القصير: 32050.
3. استخدمت موقع يونايتد الإلكتروني لمحاولة الدردشة المرئية مع الوكيل.
4. كنت أقف أيضًا في طابور وكيل أرضي.

كنت حرفيًا عميلًا **متعدد القنوات** عندما كنت بحاجة إلى حل مشكلة مهمة وعاجلة على الفور.


**الجيد**: قدمت يونايتد 4 طرق مختلفة للتواصل مع خدمة العملاء الخاصة بها.

**الجيد**: من خلال تأكيد رقم الرحلة، تمكنت يونايتد من سحب حالتها وعرفت أنها متأثرة، وعرضت خيارات إعادة الحجز/الإلغاء.

**السيئ**: تقدير وقت انتظار الهاتف كان خاطئًا تمامًا. أخبرني أن وقت الانتظار دقيقتان لكنني انتظرت 45 دقيقة للتحدث مع وكيل.

**السيئ**: روبوت الدردشة غبي جدًا. كان علي اتباع "قوائمه" بالضغط على 1/2/3/4 أو A/B/C/D/E كإجابات.

<center>
<table>
  <tr>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-3.jpg" alt="دعم يونايتد عبر الرسائل النصية - 3"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-4.jpg" alt="دعم يونايتد عبر الرسائل النصية - 4"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-5.jpg" alt="دعم يونايتد عبر الرسائل النصية - 5"/></td>
  </tr>
 </table>

*يستخدم روبوت الدردشة الخاص بيونايتد إيرلاينز تقنية الجيل الأخير التي تقدم بطاقة قائمة للحد من مدخلات الركاب.*
</center>


**القبيح**: كان هناك أقل من 10 وكلاء خدمة عملاء على الأرض للتعامل مع أكثر من 1000 راكب متأثر. وقد أدى ذلك إلى القلق والغضب والعجز والضغط على كل من العملاء والوكلاء. وذلك لأنه عندما تم إلغاء رحلتنا، أخبرت الخدمة الأرضية والمضيفون الجميع بالتحدث مع خدمة العملاء الأرضية. **توجيه كل راكب متأثر للتحدث إلى أقل من 10 وكلاء خدمة عملاء أرضيين أحدث هجوم "DDOS" ماديًا على خدمة عملاء يونايتد الأرضية.**

DDOS تعني "Distributed Denial of Service" (هجوم حجب الخدمة الموزع) عندما يوجه المتسللون حركة المرور من ملايين الأماكن إلى موقع ويب واحد لجعله غير مستجيب لأي خدمات.

**القبيح**: استخدمت 4 قنوات للتحدث مع يونايتد (نص، دردشة فيديو، مكالمة هاتفية، أرضي). استخدمت 4 أضعاف الموارد ويمكن لأي شخص آخر أن يفعل الشيء نفسه. أدى ذلك إلى زيادة مصطنعة في حركة المرور والضغط على خدمة عملاء يونايتد بمقدار 4 أضعاف. أفترض أن كل راكب آخر فعل ذلك لأن ذلك يفسر سبب تحول "وقت الانتظار دقيقتين" إلى 45 دقيقة في النهاية.

في النهاية، تمكنت من الاتصال عبر الهاتف، وقضى الوكيل حوالي 20 دقيقة لإعادة حجزي على رحلة لاحقة في الساعة 11 مساءً إلى سنغافورة في نفس اليوم. بحلول الوقت الذي انتهيت فيه، كنت لا أزال في طابور الدردشة المرئية، أتعامل مع روبوت الدردشة (من المفارقات أنه يسمى liveperson)، ومن الواضح أنني كنت في الطابور جسديًا.

أخبرت شابًا يقف خلفي من نفس الرحلة أن يتصل بيونايتد. قال: "مستحيل، سيستغرق الأمر إلى الأبد!". لكنني قلت: "لقد قمت للتو بإعادة الحجز عبر الهاتف. انظر، هناك 200 شخص أمامنا، كم تتوقع أن تنتظر في الطابور؟"

في وقت لاحق في الساعة 11 مساءً، التقيت بالشاب في رحلتي التي أعيد حجزها. كان سعيدًا جدًا برؤيتي ولم يتمكن من شكري بما فيه الكفاية على "نصيحة الهاتف". كان يرتدي قميص "تيك توك" وسماعات رأس عالية الجودة، لذلك اعتقدت أنه قد يكون خبيرًا في التكنولوجيا أو على الأقل جيدًا في التعامل مع أجهزة الكمبيوتر.

**القبيح**: كان تصور العميل "الخبير في التكنولوجيا" هو أن المكالمات الهاتفية لن تحل له شيئًا، بل يفضل الانتظار جسديًا في الطابور للتحدث مع شخص حقيقي بينما يمكنه بوضوح رؤية مدى طول الطابور. **يعكس هذا مدى سوء تفكير الجمهور العام في عدم جدوى الدعم عبر الهاتف.**

# دعم عملاء شركات الطيران: المشكلة الرئيسية هي قابلية التوسع الديناميكية

مع تجربة تأخير رحلة وإلغاء أخرى في نفس اليوم، والتحدث إلى خدمات العملاء عبر 4 قنوات مختلفة في مناسبتين، وفهم عميق لكيفية بناء مراكز الاتصال - أعتقد أن المشكلة الرئيسية لدعم عملاء شركات الطيران هي هذه:

**دعم عملاء شركات الطيران لا يمكنه التوسع ديناميكيًا. أو بعبارة أخرى في مصطلحات الحوسبة السحابية: دعم عملاء شركات الطيران ليس مرنًا.**

لم يحدث هذا مع يونايتد فقط. لقد مررت بتجارب مماثلة مع طيران كندا خلال جائحة كوفيد-19: استغرقت كل مكالمة هاتفية أكثر من ساعتين من وقت الانتظار.

لا أعتقد حتى أن روبوت الدردشة الغبي أو الوكيل البشري غير المتعاطف هو المشكلة الرئيسية. دعم العملاء له نمطه الفريد الذي يأتي في موجات: **عادةً عندما تتأثر رحلة ما، يحاول عشرات أو مئات الركاب الاتصال في نفس الوقت، أحيانًا بمضاعف 4 عبر القنوات المتقاطعة.**

هذا النوع من زيادة حركة المرور لا يتم التعامل معه بشكل جيد من قبل مراكز الاتصال الحديثة لشركات الطيران. وما يزيد الأمر سوءًا هو أن جميع هذه المشكلات هي "رمز أحمر": يجب حلها _فورًا_. آسف، لا يوجد دعم بريد إلكتروني غير متزامن يعتمد على Zendesk. _أحتاج للتحدث مع وكيل الآن_.

# دعم عملاء شركات الطيران: البشر لا يتوسعون

دعونا نفكر كيف يقوم موقع التجارة الإلكترونية بإعداد نفسه خلال ذروة حركة المرور مثل الجمعة السوداء:
1. **توقع** نوع حركة المرور التي سيحصل عليها في أي وقت.
2. **تخصيص مسبق** لموارد الخادم الكافية عن طريق الاتصال بمقدمي الخدمات السحابية أو زيادة حد مجموعات الخوادم الخاصة بهم.
3. **إنشاء ديناميكي** لمزيد من الخوادم عند زيادة حركة المرور.

هل يمكن لدعم عملاء شركات الطيران أن يفعل الشيء نفسه؟
1. **توقع**: هناك نماذج يمكننا استخدامها للتنبؤ بوقت تأثر الرحلة ولكن لا أعرف ما إذا كانوا يستخدمون أيًا منها. على سبيل المثال، يمكن للمرء أن يأخذ العوامل التالية في الاعتبار:
    * حركة المرور حول المطار - يمكن سحبها بسهولة من خرائط Google
    * الازدحام في المطار - بعض المطارات لديها تحديثات في الوقت الفعلي
    * الطقس المحلي
    * أنماط السفر المعتادة مثل العطلات
    * الأحداث المحلية التي تخلق تدفقًا كبيرًا للركاب مثل CES في لاس فيغاس
    * إشارات أخرى مثل ظروف الطائرة
    * حالات التاريخ
2. **تخصيص مسبق**: أعتقد أن هذا ما تفعله أو يجب أن تفعله كل شركة طيران خلال مواسم العطلات عن طريق توظيف المزيد من الوكلاء. آمل بالتأكيد أن يفعلوا ذلك. أعلم أن TurboTax يوظف المزيد من الأشخاص حول مواعيد تقديم الإقرارات الضريبية.
3. **إنشاء ديناميكي**: هذه هي الحالة الأكثر صعوبة. ببساطة لا توجد طريقة سهلة للقيام بذلك مع البشر، خاصة مع الوكلاء المدربين ذوي الخبرة.

# دعم عملاء شركات الطيران: كيفية التوسع

هدفنا الرئيسي هو التعامل مع زيادة حركة المرور عندما يحتاج الركاب إلى حل مشاكلهم على الفور، دون تأخير.
1. لا يبدو أن قنوات الخدمة الذاتية الرقمية قادرة على استبدال الوكلاء البشريين بالكامل لسببين:
قنوات الخدمة الذاتية الرقمية محدودة ولا توفر وصولاً كافيًا للمكاتب الخلفية كما يفعل الوكيل البشري.
2. يرغب الركاب نفسيًا في التحدث مع إنسان لأن الحلول الآلية تقليديًا لم تكن مفيدة، خاصة روبوتات الدردشة سيئة السمعة.

الحل ليس بهذه البساطة لأن البشر يصعب توسيعهم. ولكن كانت هناك أيضًا طرق لحلها:
1. لا يزال من الممكن حل الكثير من المشكلات عن طريق قنوات الخدمة الذاتية. نحتاج إلى تحديدها وتحويل حركة المرور التي يمكن خدمتها ذاتيًا بعيدًا عن الوكلاء البشريين.
    * على سبيل المثال، عندما تم إلغاء رحلتي - كل ما أردته هو إعادة حجز الرحلات. لكن يونايتد لم تقدم لي هذا الخيار وكان علي الاتصال. ومع ذلك، عندما تأخرت رحلتي، عرضت يونايتد بشكل استباقي خيار إعادة الحجز. حلول المشكلتين هي نفسها - لا أحتاج إلى التحدث مع وكيل عندما يتم إلغاء رحلتي أكثر مما أحتاج إليه عندما تتأخر رحلتي. لماذا لا أستطيع خدمة نفسي؟
2. يمكن أن يكون الوكلاء البشريون أكثر كفاءة عند الدردشة أو المكالمة.
    * استغرق وكيل خدمة العملاء حوالي 30 دقيقة لإعادة حجزي، مع حوالي 15 دقيقة وضعني على الانتظار بينما كانت تعمل على شيء ما.
    * الـ 15 دقيقة المتبقية عندما كانت تتحدث معي: نصف الوقت كانت تجمع المعلومات.
    * أشعر أنه مع التحسين، يمكن تقصير الـ 30 دقيقة إلى 5-10 دقائق إذا تم جمع المعلومات والأتمتة بشكل صحيح.

إذا كنت سأبني نظام مركز اتصال ليونايتد، فإليك ما سأفعله:
1. تقديم الدردشة والمكالمات الهاتفية كقنوات خدمة عملاء أساسية. لا تعيد توجيه طائرة كاملة من الركاب إلى خدمات العملاء الأرضية (لقد رأينا جميعًا مدى ازدحام أماكن تأجير السيارات بعد هبوط طائرة كبيرة في وجهة سياحية).
2. دمج العملاء متعددي القنوات في قناة واحدة. هذا يعني تحديد العملاء في أقرب وقت ممكن. سيؤدي ذلك إلى تقليل حجم قائمة الانتظار بشكل كبير وتوفير نطاق ترددي للوكيل.
3. إنتاج دعم دردشة أكثر ذكاءً. أصبح الجيل الحالي من روبوتات الدردشة قديمًا وغير شعبي للغاية بعد ظهور ChatGPT. دع ChatGPT يتعامل مع المحادثة - في تجربتنا، إنه أفضل من البشر!
4. التأكيد على كفاءة الوكلاء البشريين: إنجاز المهمة لا يكفي إذا استغرقت كل مكالمة 45 دقيقة؛ دعنا نساعدهم في حل المشكلات بسرعة من خلال تقديم:
    * اقتراحات "أفضل إجراء تالي"
    * "حلول ناجحة سابقة" بناءً على سجلات الدردشة أو المكالمات للوكلاء الآخرين
    * مساعد في الوقت الفعلي يساعد في التنفيذ لأنظمة المكاتب الخلفية عبر مكالمات API أو أتمتة RPA
5. بناء نموذج تنبؤي لمخاطر زيادة طلبات خدمة العملاء والعمل عليها بشكل استباقي.

لم يسبق لي أن تواصل معي وكيل خدمة عملاء بشكل استباقي لحل المشكلة. لقد كنت دائمًا أنا، الراكب، أنتظر وأتصل في الطابور وعلى الخط.

نحن في [Seasalt.ai](https://seasalt.ai/?utm_source=blog) يسعدنا بناء تقنية تشبه "تقرير الأقلية" لتحديد المشكلة قبل حدوثها، وإزالة المخاطر عن طريق التواصل الاستباقي مع الركاب المتأثرين، ومعالجة تحدي التوسع الديناميكي لمركز الاتصال مع البشر خلال ذروة حركة المرور.

إذا تلقيت في السنوات القليلة القادمة مكالمة هاتفية من شركة الطيران تخبرني بمشكلة محتملة قبل أن أحاول طلب المساعدة، فستكون هذه تجربة عملاء مذهلة حقًا ورحلة ممتعة حتى قبل أن أقوم بالرحلة. أي شركة طيران يمكنها فعل ذلك أولاً ستفوز بالعديد من المسافرين المخلصين.
`;export{n as default};
