const n=`---
title: "خدمات مشتری در یونایتد ایرلاینز: خوب، بد و زشت"
metatitle: "تحلیل خدمات مشتری در یونایتد ایرلاینز"
date: 2023-03-21 11:25:00-08:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Xuchen Yao
description: "Xuchen Yao تجربه اخیر خود را با خدمات مشتری یونایتد ایرلاینز در طول تأخیر و لغو پروازها به اشتراک می‌گذارد و راه‌حل‌هایی را برای مقابله با چالش مقیاس‌پذیری پویا پشتیبانی مشتری در طول ترافیک زیاد پیشنهاد می‌کند."
weight: 1
tags:
  - SeaX
image: images/blog/31-cx-at-united-airlines/flight-delay-illustration.png
canonicalURL: /blog/customer-service-at-united-airlines/
url: /blog/customer-service-at-united-airlines/
---

*مدیر عامل [Seasalt.ai](https://seasalt.ai)، Xuchen Yao، تجربه اخیر خود را با خدمات مشتری یونایتد ایرلاینز پس از مواجهه با تأخیر و لغو پروازها به اشتراک می‌گذارد. این امر او را به درک چالش‌های پیش روی پشتیبانی مشتری خطوط هوایی در مقیاس‌پذیری پویا برای مدیریت ترافیک زیاد در چنین شرایطی سوق داد. Xuchen در مورد بهبودهای احتمالی مانند هدایت ترافیک قابل خودخدمت از عوامل انسانی، بهبود کارایی عوامل انسانی و توسعه فناوری برای شناسایی فعال و کاهش ریسک مشکلات احتمالی صحبت می‌کند.*

این وبلاگ در تاریخ 22/3/2023 در پرواز UA2 از سنگاپور به سانفرانسیسکو نوشته شده است.

اخیراً از پرواز UA1 از سانفرانسیسکو (SFO) به سنگاپور (SIN) لذت بردم. این لذت به سرعت به دلیل لغو پرواز به بدبختی تبدیل شد. در اینجا درس‌هایی درباره خدمات مشتری یونایتد از دید یک فناور که مراکز تماس را می‌سازد، آورده شده است.



# پروازی با دو تأخیر: تأخیر و لغو

برنامه سفر به سنگاپور از سیاتل در سه‌شنبه 14/3/2023 به شرح زیر بود:

<center>
<img src="/images/blog/31-cx-at-united-airlines/united-flights.png" alt="پروازهای برنامه‌ریزی شده یونایتد من"/>

*7:29 صبح – 09:42 صبح، از سیاتل (SEA) به سانفرانسیسکو (SFO) با UA2368. 11:50 صبح – 08:15 عصر، از سانفرانسیسکو (SFO) به سنگاپور (SIN) با UA29.*
</center>

متأسفانه، من هیچ یک از پروازها را انجام ندادم.

پرواز اول به دلیل ترافیک در فرودگاه سیاتل (ساعت 7 صبح!) 1.5 ساعت تأخیر داشت. این باعث شد زمان انتقال من در SFO به 0 کاهش یابد. من با خدمات زمینی در SEA صحبت کردم و آنها مرا به پرواز آلاسکا از SEA به SFO منتقل کردند. آن پرواز آلاسکا نیز تأخیر داشت اما همچنان در ساعت 11 صبح به SFO رسید و به من به سختی زمان کافی برای رسیدن به پرواز بعدی را داد.

**نکته مثبت**: یونایتد به من اجازه داد پروازم را به آلاسکا به صورت رایگان تغییر دهم.

**نکته مثبت**: یونایتد از طریق کد کوتاه "26266" در مورد تأخیرها بسیار فعال بود. هنگامی که تأخیر رخ داد، حتی گزینه‌هایی برای تغییر رزرو پروازهای من ارائه داد.

**نکته منفی**: گزینه تغییر رزرو پرواز فقط به پروازهای یونایتد محدود بود. هیچ تغییر رزروی بین خطوط هوایی وجود نداشت. مجبور شدم با یک انسان صحبت کنم تا به پرواز دیگری منتقل شوم.

**نکته زشت**: چرا فرودگاه SEA در ساعت 7 صبح اینقدر شلوغ بود؟!

<center>
<table>
  <tr>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-1.jpg" alt="پشتیبانی پیام متنی یونایتد - 1"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-2.jpg" alt="پشتیبانی پیام متنی یونایتد - 2"/></td>
  </tr>
 </table>

*سیستم پیام‌رسانی کد کوتاه یونایتد ایرلاینز به موقع و فعال است.*
</center>


1. نکته جالب این بود که در پرواز UA1، ما 3 ساعت روی زمین ماندیم و در نهایت پرواز به دلیل اتفاقات زیر لغو شد:
2. ابتدا سانفرانسیسکو باد بسیار شدیدی داشت که تمام پروازها را زمین‌گیر کرد.
سپس وقتی اجازه پرواز داده شد، همه هواپیماها در صف بسیار طولانی منتظر بودند تا از زمین بلند شوند.
3. سرانجام وقتی تقریباً نوبت ما شد، خلبانان گفتند که اضافه کاری می‌کنند و طبق مقررات FAA، ادامه پرواز برای آنها غیرقانونی است. زیرا پرواز به سنگاپور 17 ساعت بود و با توجه به زمانی که روی زمین سپری کردند، تا زمان رسیدن به سنگاپور از حد مجاز فراتر می‌رفتند.

متأسفانه، خلبان جایگزینی وجود نداشت، بنابراین کل پرواز لغو شد.

**نکته زشت**: در تمام 3 ساعت توقف روی زمین، یونایتد 2 بیسکویت ارائه داد. همین.

همه با عجله از هواپیما خارج شدند و به این فکر می‌کردند که این اتفاق چگونه بر سفر آنها تأثیر می‌گذارد. از آنجایی که این یک پرواز بین‌المللی بود، ما در روز دیگری به سنگاپور می‌رسیدیم. نه روز بعد، بلکه در واقع دو روز بعد: زیرا سنگاپور 15 ساعت جلوتر است و پرواز 17 ساعت طول می‌کشد.

سپس حدود 300 مسافر به سمت خدمات مشتری زمینی یونایتد هجوم بردند. تا زمانی که من به خدمات مشتری یونایتد رسیدم، حدود 200 نفر در صف جلوی من بودند. بسیاری از آنها به دلیل آب و هوا از پروازهای دیگر یونایتد تحت تأثیر قرار گرفته بودند.

با توجه به کندی حرکت صف، صحبت با یک عامل زمینی بی‌فایده بود. می‌دانم که در همان روز پرواز دیگری در ساعت 11 شب به سنگاپور وجود دارد، که آن هم از یونایتد است. امید من این است که به آن پرواز ساعت 11 شب منتقل شوم. احتمالاً بسیاری از افراد پرواز من نیز همین کار را می‌خواستند انجام دهند، اما همه مانند من در صف ایستاده بودند.

این کاری بود که من انجام دادم:

1. با یونایتد از طریق تلفن تماس گرفتم: 800-864-8331
2. از طریق کد کوتاه: 32050 به عامل مجازی یونایتد پیامک زدم.
3. از وب‌سایت یونایتد برای چت تصویری با عامل استفاده کردم.
4. همچنین در صف عامل زمینی ایستاده بودم.

من به معنای واقعی کلمه یک مشتری **چند کاناله** بودم که نیاز به حل فوری یک مشکل مهم و اضطراری داشتم.


**نکته مثبت**: یونایتد 4 روش مختلف برای ارتباط با خدمات مشتری خود ارائه داد.

**نکته مثبت**: با تأیید شماره پرواز، یونایتد توانست وضعیت آن را بررسی کند و متوجه شد که تحت تأثیر قرار گرفته است، و گزینه‌های تغییر رزرو/لغو را ارائه داد.

**نکته منفی**: تخمین زمان انتظار تلفن بسیار اشتباه بود. به من گفتند زمان انتظار 2 دقیقه است اما من 45 دقیقه منتظر ماندم تا با یک عامل صحبت کنم.

**نکته منفی**: چت‌بات بسیار احمق است. مجبور بودم منوهای آن را با فشار دادن 1/2/3/4 یا A/B/C/D/E به عنوان پاسخ دنبال کنم.

<center>
<table>
  <tr>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-3.jpg" alt="پشتیبانی پیام متنی یونایتد - 3"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-4.jpg" alt="پشتیبانی پیام متنی یونایتد - 4"/></td>
    <td><img src="/images/blog/31-cx-at-united-airlines/united-text-support-5.jpg" alt="پشتیبانی پیام متنی یونایتد - 5"/></td>
  </tr>
 </table>

*چت‌بات یونایتد ایرلاینز از فناوری نسل گذشته استفاده می‌کند که یک کارت منو برای محدود کردن ورودی مسافران ارائه می‌دهد.*
</center>


**نکته زشت**: به معنای واقعی کلمه کمتر از 10 عامل خدمات مشتری در زمین برای رسیدگی به بیش از 1000 مسافر آسیب‌دیده وجود داشت. این امر باعث اضطراب، خشم، درماندگی و فشار بر مشتریان و عوامل شد. این به این دلیل است که وقتی پرواز ما لغو شد، خدمات زمینی و مهمانداران به همه گفتند که با خدمات مشتری زمینی خود صحبت کنند. **دستور دادن به هر مسافر آسیب‌دیده برای صحبت با کمتر از 10 عامل خدمات مشتری زمینی، یک حمله فیزیکی "DDOS" را به خدمات مشتری زمینی یونایتد ایجاد کرد.**

DDOS مخفف "Distributed Denial of Service" (حمله محروم‌سازی از سرویس توزیع‌شده) است که در آن هکرها ترافیک را از میلیون‌ها مکان به یک وب‌سایت واحد هدایت می‌کنند تا آن را نسبت به هر سرویسی غیرقابل پاسخگو کنند.

**نکته زشت**: من از 4 کانال برای صحبت با یونایتد استفاده کردم (متن، چت تصویری، تماس تلفنی، زمینی). من 4 برابر بیشتر از منابع استفاده کردم و هر کس دیگری نیز می‌توانست همین کار را انجام دهد. این امر به طور مصنوعی باعث افزایش 4 برابری ترافیک و فشار بر خدمات مشتری یونایتد شد. گمان می‌کنم هر مسافر دیگری نیز همین کار را انجام داد زیرا این امر توضیح می‌دهد که چرا "زمان انتظار 2 دقیقه" من در نهایت به 45 دقیقه تبدیل شد.

در نهایت، از طریق تلفن با من تماس گرفته شد و عامل حدود 20 دقیقه وقت صرف کرد تا من را به پرواز بعدی در ساعت 11 شب همان روز به سنگاپور منتقل کند. تا زمانی که کارم تمام شد، هنوز در صف چت تصویری بودم، با چت‌بات (به طعنه liveperson نامیده می‌شود) سروکار داشتم و البته به صورت فیزیکی در صف ایستاده بودم.

به مرد جوانی که از همان پرواز پشت سرم ایستاده بود گفتم با یونایتد تماس بگیرد. او گفت: "محال است، تا ابد طول می‌کشد!". اما من گفتم: "من همین الان از طریق تلفن رزرو کردم. ببین، 200 نفر جلوی ما هستند، فکر می‌کنی چقدر باید در صف منتظر بمانی؟"

بعداً ساعت 11 شب، در پرواز جدیدم با آن جوان روبرو شدم. او از دیدن من بسیار خوشحال بود و از من به خاطر "نکته تلفنی" بی‌نهایت تشکر کرد. او یک تی‌شرت "تیک‌تاک" و هدفون‌های گران‌قیمت به تن داشت، بنابراین فکر کردم شاید او از نظر فنی باهوش باشد یا حداقل در کار با کامپیوتر خوب باشد.

**نکته زشت**: تصور یک مشتری "فناور" این بود که تماس‌های تلفنی هیچ مشکلی را برای او حل نمی‌کند، او ترجیح می‌دهد به صورت فیزیکی در صف منتظر بماند تا با یک شخص واقعی صحبت کند در حالی که به وضوح می‌تواند طول صف را ببیند. **این نشان می‌دهد که عموم مردم چقدر بد در مورد بی‌فایده بودن پشتیبانی تلفنی فکر می‌کنند.**

# پشتیبانی مشتری خطوط هوایی: مشکل اصلی مقیاس‌پذیری پویا است

با تجربه تأخیر یک پرواز و لغو یک پرواز دیگر در همان روز، و صحبت با خدمات مشتری از طریق 4 کانال مختلف در دو نوبت، و درک عمیق از نحوه ساخت مراکز تماس - من فکر می‌کنم مشکل اصلی پشتیبانی مشتری خطوط هوایی این است:

**پشتیبانی مشتری خطوط هوایی نمی‌تواند به صورت پویا مقیاس‌پذیر باشد. یا به عبارت دیگر در اصطلاحات رایانش ابری: پشتیبانی مشتری خطوط هوایی الاستیک نیست.**

این اتفاق فقط با یونایتد رخ نداد. من تجربیات مشابهی با ایر کانادا در طول کووید-19 داشتم: هر تماس تلفنی بیش از 2 ساعت زمان انتظار داشت.

من حتی فکر نمی‌کنم یک چت‌بات بی‌فایده یا یک عامل انسانی بی‌احساس مشکل اصلی باشد. پشتیبانی مشتری الگوی منحصر به فرد خود را دارد که به صورت موجی می‌آید: **معمولاً وقتی پروازی تحت تأثیر قرار می‌گیرد، ده‌ها یا صدها مسافر همزمان سعی در تماس دارند، گاهی اوقات با ضریب 4 از طریق کانال‌های متقاطع.**

این نوع افزایش ترافیک توسط مراکز تماس مدرن خطوط هوایی به خوبی مدیریت نمی‌شود. آنچه اوضاع را بدتر می‌کند این است که همه این مسائل "کد قرمز" هستند: باید _فوراً_ حل شوند. متاسفم، پشتیبانی ایمیل ناهمزمان مبتنی بر Zendesk وجود ندارد. _من باید همین الان با یک عامل صحبت کنم_.

# پشتیبانی مشتری خطوط هوایی: انسان‌ها مقیاس‌پذیر نیستند

بیایید فکر کنیم که یک وب‌سایت تجارت الکترونیک چگونه خود را برای ترافیک اوج مانند جمعه سیاه آماده می‌کند:
1. **پیش‌بینی** می‌کند که چه نوع ترافیکی در چه زمانی دریافت خواهد کرد.
2. **پیش‌تخصیص** منابع سرور کافی با تماس با ارائه‌دهندگان ابری یا افزایش حد خوشه‌های سرور خود.
3. **به صورت پویا** سرورهای بیشتری را هنگام افزایش ترافیک **ایجاد می‌کند**.

آیا پشتیبانی مشتری خطوط هوایی می‌تواند همین کار را انجام دهد؟
1. **پیش‌بینی**: مدل‌هایی وجود دارد که می‌توانیم از آنها برای پیش‌بینی زمان تأثیرگذاری پرواز استفاده کنیم، اما نمی‌دانم آیا آنها از آنها استفاده می‌کنند یا خیر. به عنوان مثال، می‌توان عوامل زیر را در نظر گرفت:
    * ترافیک اطراف فرودگاه – به راحتی از Google Maps قابل استخراج است.
    * ازدحام در فرودگاه – برخی فرودگاه‌ها به‌روزرسانی‌های لحظه‌ای دارند.
    * آب و هوای محلی
    * الگوهای سفر معمول مانند تعطیلات
    * رویدادهای محلی که باعث ورود و خروج زیاد مسافران می‌شوند، مانند CES در لاس وگاس.
    * سایر سیگنال‌ها مانند وضعیت هواپیما.
    * وضعیت‌های تاریخی
2. **پیش‌تخصیص**: من معتقدم این کاری است که هر شرکت هواپیمایی در فصول تعطیلات با استخدام عوامل بیشتر انجام می‌دهد یا باید انجام دهد. من مطمئناً امیدوارم که آنها این کار را انجام دهند. می‌دانم که TurboTax در حوالی مهلت‌های اظهارنامه مالیاتی افراد بیشتری را استخدام می‌کند.
3. **ایجاد پویا**: این دشوارترین حالت است. به سادگی هیچ راه آسانی برای انجام آن با انسان‌ها وجود ندارد، به خصوص با عوامل آموزش‌دیده و باتجربه.

# پشتیبانی مشتری خطوط هوایی: چگونه مقیاس‌پذیر باشیم

هدف اصلی ما مقابله با افزایش ترافیک است، زمانی که مسافران باید مشکلات خود را در محل و بدون تأخیر حل کنند.
1. کانال‌های خودخدمت دیجیتال به دو دلیل زیر نمی‌توانند به طور کامل جایگزین عوامل انسانی شوند:
کانال‌های خودخدمت دیجیتال محدود هستند و دسترسی کافی به بخش پشتیبانی را که یک عامل انسانی دارد، فراهم نمی‌کنند.
2. مسافران از نظر روانی می‌خواهند با یک انسان صحبت کنند زیرا راه‌حل‌های خودکار به طور سنتی کمکی نمی‌کردند، به ویژه چت‌بات‌های بدنام.

راه حل به این سادگی نیست زیرا مقیاس‌پذیری انسان‌ها دشوار است. اما راه‌هایی برای حل آن نیز وجود داشت:
1. بسیاری از مشکلات هنوز هم می‌توانند از طریق کانال‌های خودخدمت حل شوند. ما باید آنها را شناسایی کرده و ترافیک قابل خودخدمت را از عوامل انسانی منحرف کنیم.
    * به عنوان مثال، وقتی پرواز من لغو شد - تنها چیزی که می‌خواستم این بود که پروازها را دوباره رزرو کنم. اما یونایتد این گزینه را به من ارائه نداد و مجبور شدم تماس بگیرم. با این حال، وقتی پرواز من تأخیر داشت، یونایتد به طور فعال گزینه تغییر رزرو را به من پیشنهاد داد. راه‌حل هر دو مشکل یکسان است - من نیازی به صحبت با یک عامل ندارم وقتی پرواز من لغو می‌شود، بیشتر از زمانی که پرواز من تأخیر دارد. چرا نمی‌توانم خودخدمت باشم؟
2. عوامل انسانی می‌توانند در چت یا تماس کارآمدتر باشند.
    * عامل خدمات مشتری حدود 30 دقیقه طول کشید تا من را دوباره رزرو کند، با حدود 15 دقیقه که من را در حالت انتظار نگه داشت در حالی که او روی چیزی کار می‌کرد.
    * 15 دقیقه باقی‌مانده که او با من صحبت می‌کرد: نیمی از زمان را صرف جمع‌آوری اطلاعات می‌کرد.
    * احساس می‌کنم با بهینه‌سازی، 30 دقیقه می‌تواند به 5-10 دقیقه کاهش یابد اگر جمع‌آوری اطلاعات و اتوماسیون به درستی انجام شود.

اگر قرار بود یک سیستم مرکز تماس برای یونایتد بسازم، کارهای زیر را انجام می‌دادم:
1. چت و تماس تلفنی را به عنوان کانال‌های اصلی خدمات مشتری ارائه دهید. یک هواپیما پر از مسافر را به خدمات مشتری زمینی هدایت نکنید (همه ما دیده‌ایم که پس از فرود یک هواپیمای بزرگ در یک مقصد گردشگری، مکان‌های اجاره خودرو چقدر شلوغ می‌شوند).
2. مشتریان چند کاناله را در یک کانال واحد ادغام کنید. این به معنای شناسایی مشتریان در اسرع وقت است. این امر به طور قابل توجهی اندازه صف را کاهش می‌دهد و پهنای باند عامل را ذخیره می‌کند.
3. پشتیبانی مبتنی بر چت هوشمندتری تولید کنید. نسل فعلی چت‌بات‌ها پس از انتشار ChatGPT منسوخ، قدیمی و بسیار نامحبوب شده‌اند. بگذارید ChatGPT مکالمه را مدیریت کند - در تجربه ما بهتر از انسان‌ها عمل می‌کند!
4. بر کارایی عوامل انسانی تأکید کنید: انجام کار کافی نیست اگر هر تماس 45 دقیقه طول بکشد؛ بیایید با ارائه موارد زیر به آنها کمک کنیم تا مشکلات را به سرعت حل کنند:
    * پیشنهادات "بهترین اقدام بعدی"
    * "راه‌حل‌های موفق قبلی" بر اساس گزارش‌های چت یا تماس سایر عوامل
    * کمک‌خلبان بلادرنگ که با اجرای سیستم‌های پشتیبانی از طریق تماس‌های API یا اتوماسیون‌های RPA کمک می‌کند.
5. یک مدل پیش‌بینی در مورد خطر افزایش درخواست‌های خدمات مشتری بسازید و به طور فعال روی آن کار کنید.

من هرگز یک عامل خدمات مشتری نداشتم که به طور فعال با من تماس بگیرد تا مشکل را حل کند. همیشه من، مسافر، با ناامیدی در صف و پشت خط منتظر و تماس می‌گرفتم.

ما در [Seasalt.ai](https://seasalt.ai/?utm_source=blog) خوشحالیم که فناوری‌ای شبیه به «گزارش اقلیت» را برای شناسایی مشکل قبل از وقوع آن، کاهش ریسک آن با تماس فعال با مسافران آسیب‌دیده، و مقابله با چالش مقیاس‌پذیری پویا یک مرکز تماس با انسان‌ها در طول ترافیک زیاد، می‌سازیم.

اگر در چند سال آینده، قبل از اینکه من بخواهم کمک بگیرم، تماسی از شرکت هواپیمایی دریافت کنم که مشکلی احتمالی را اطلاع می‌دهد، این یک تجربه مشتری واقعاً شگفت‌انگیز و سفری لذت‌بخش خواهد بود، حتی قبل از اینکه سفر را آغاز کنم. هر شرکت هواپیمایی که بتواند این کار را زودتر انجام دهد، بسیاری از مسافران وفادار را به دست خواهد آورد.
`;export{n as default};
