const n=`---
title: "고객 사례: 아시아 주요 은행이 다국어 및 개인 정보 보호 중심 고객 지원을 제공하도록 지원"
metatitle: "SeaX로 다국어 및 개인 지원을 제공하는 아시아 은행"
date: 2023-06-28 11:25:00-08:00
modified_date: 2025-07-27 00:00:00+00:00
draft: false
author: Jun Mao
description: "이 블로그는 옴니채널 컨택 센터 배포가 동남아시아의 주요 사설 은행의 고객 서비스 환경을 어떻게 혁신했는지 설명하며, 실시간 음성 전사, 데이터 기반 통찰력 및 강력한 데이터 개인 정보 보호 조치를 통해 에이전트 성능을 향상시켰습니다."
weight: 1
tags:
  - SeaX
  - Customer Story
image: images/blog/33-bank-seax/33-bank-seax.jpeg
canonicalURL: /blog/bank-seax/
url: /blog/bank-seax/
---

동남아시아 최대 사설 은행 중 한 곳의 옴니채널 컨택 센터 배포 성공 사례는 고급 기술과 고객 중심 접근 방식이 데이터 개인 정보 보호를 보장하면서 고객 서비스 환경을 어떻게 변화시킬 수 있는지 보여줍니다.

배포 전, 은행의 컨택 센터는 품질 보증과 관련된 문제에 직면했으며, 에이전트 성능을 평가하고 개선하는 데 필요한 도구가 부족했습니다. 또한, 전화 통화 녹음이나 음성 전사가 제공되지 않아 고객 상호 작용을 분석하고 고객 만족도 수준을 평가하기 어려웠습니다.

## 옴니채널 및 국제 솔루션

포괄적인 솔루션의 필요성을 인식한 은행은 고객 서비스 운영을 혁신하고 전반적인 고객 경험을 향상시킬 옴니채널 컨택 센터를 배포하기로 결정했습니다.

배포는 처음에 대만과 베트남의 두 가지 주요 시장에서 시작되었습니다. 현지화된 언어 지원을 통해 이 지역의 고객은 선호하는 언어로 컨택 센터와 원활하게 통신할 수 있었습니다.

## 실시간 전사 및 고객 통찰력
배포를 통해 얻은 가장 중요한 개선 사항 중 하나는 모든 전화 통화 녹음의 실시간 전사였습니다. 이 기술은 고객 상호 작용의 음성 콘텐츠를 캡처하고 전사하여 분석 및 품질 평가를 위한 귀중한 리소스를 제공했습니다.

은행은 이러한 전사를 활용하여 에이전트 성능을 포괄적으로 평가했습니다. 전사된 음성은 감정, 정서, 고객 만족도 등 다양한 요소를 고려하여 분석되었습니다. 이 평가 프레임워크를 통해 은행은 개선 영역을 식별하고, 에이전트를 효과적으로 코칭하며, 일관되고 고품질의 고객 상호 작용을 보장할 수 있었습니다.

## 개인 정보 보호: 고객 데이터의 PII 수정
개인 정보 보호는 배포 프로세스 전반에 걸쳐 주요 관심사였습니다. 이 솔루션은 클라이언트 정보를 보호하기 위해 강력한 개인 정보 보호 조치를 구현했습니다. 통화 기록에 있는 모든 개인 식별 정보(PII)는 수정되어 개인 정보 보호 규정 준수 및 고객 데이터 보호를 보장했습니다. 개인 정보 보호에 대한 이러한 약속은 고객과의 신뢰를 구축하고 유지하는 데 매우 중요했습니다.

또한, 배포는 추가 분석을 위해 데이터를 쉽게 액세스하고 이식할 수 있도록 하는 데 중점을 두었습니다. 통화 기록은 은행의 데이터 과학 팀이 데이터 분석을 용이하게 하는 방식으로 구조화되었습니다. 이를 통해 팀은 의미 있는 통찰력을 얻고, 보고서를 생성하며, 더 나은 의사 결정을 위해 이해 관계자에게 실행 가능한 정보를 제공할 수 있었습니다.

데이터 개인 정보 보호 및 분석에 대한 은행의 약속은 배포된 옴니채널 컨택 센터의 잠재력을 최대한 활용할 수 있도록 지원했습니다. 음성 전사를 활용하여 은행은 고객 선호도, 문제점 및 만족도 수준에 대한 귀중한 통찰력을 얻었습니다. 이러한 데이터 기반 접근 방식을 통해 고객 서비스 전략을 개선하고, 고객 여정을 향상시키며, 개인화되고 능동적인 지원을 제공할 수 있었습니다.

결론적으로, 동남아시아 최대 사설 은행 중 한 곳의 옴니채널 컨택 센터 배포 성공 사례는 고객 서비스 운영을 변화시켰습니다. 이 구현은 실시간 음성 전사, 포괄적인 에이전트 성능 평가 및 데이터 개인 정보 보호에 대한 강력한 초점을 포함하여 상당한 개선을 가져왔습니다. 이러한 발전을 통해 은행은 고객 상호 작용을 효과적으로 분석하고, 에이전트 성능을 향상시키며, 탁월한 고객 경험을 제공할 수 있었습니다. 이 배포는 데이터 개인 정보 보호 및 보호의 최고 표준을 보장하면서 지속적인 개선을 위해 기술과 데이터를 활용하려는 은행의 약속을 강조했습니다.

## 문의하기

SeaX에 대해 더 자세히 알고 싶으시면, [데모 예약 양식](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting)을 작성하여 SeaX 플랫폼을 직접 확인해 보세요. 언제든지 기꺼이 대화할 준비가 되어 있습니다!`;export{n as default};
