const e=`---
title: "டெமோவிலிருந்து வெற்றிக்கு: வன்பொருளுக்கு அப்பால் (5/5)"
metatitle: "டெமோவிலிருந்து வெற்றிக்கு (5/5): வன்பொருளுக்கு அப்பால்"
date: 2021-09-15 17:24:32-07:00
modified_date: 2025-07-28T16:56:53Z
draft: false
author: Cody Kim
description: "இந்த வலைப்பதிவுத் தொடரின் கடைசிப் பகுதியில், எங்கள் கூட்டு நவீன சந்திப்பு தீர்வான SeaMeet-ஐ உருவாக்குவதற்கான Seasalt.ai-யின் பயணத்தைப் பின்பற்றுங்கள்."
weight: 1
tags:
  - SeaMeet
image: images/blog/3-implementing-Microsoft-modern-meetings-and-beyond/SeaMeet animation.gif
canonicalURL: /blog/seameet-voice-hardware/
url: /blog/seameet-voice-hardware/
---

*இந்த வலைப்பதிவுத் தொடர் முழுவதும், Seasalt.ai-யின் ஒரு முழுமையான நவீன சந்திப்பு அனுபவத்தை உருவாக்குவதற்கான பயணத்தைப் பின்பற்றுங்கள், அதன் தாழ்மையான தொடக்கங்களிலிருந்து, வெவ்வேறு வன்பொருள் மற்றும் மாடல்களில் எங்கள் சேவையை மேம்படுத்துவது, அதிநவீன NLP அமைப்புகளை ஒருங்கிணைப்பது மற்றும் இறுதியாக எங்கள் கூட்டு நவீன சந்திப்பு தீர்வான SeaMeet-ஐ முழுமையாக உணர்ந்து கொள்வது வரை.*

## நவீன சந்திப்புகளுக்கு அப்பால்

இங்கு Seasalt.ai இல், இந்த தயாரிப்பின் Build 2019 டெமோவில் காட்டப்பட்ட தற்போதைய திறன்களை நாங்கள் பாராட்டினோம், ஆனால் இந்த தயாரிப்பு என்னவாக மாறக்கூடும், உரையாடல் படியெடுத்தலை வெறும் நகலெடுப்பதைத் தாண்டி எவ்வாறு கொண்டு செல்வது என்பதில் நாங்கள் அதிக ஆர்வம் காட்டுகிறோம். ஆனால் நீங்கள் போட்டியை வெல்வதற்கு முன், நீங்கள் விளையாடும் விளையாட்டை நீங்கள் நெருக்கமாகப் புரிந்து கொள்ள வேண்டும். அப்படித்தான் SeaMeet பிறந்தது. அதன் ஆரம்ப கட்டத்தில், ஒரு திடமான படியெடுத்தல் சேவையை உருவாக்குவதற்கான அடிப்படைகளைப் புரிந்துகொள்ள Azure ஐ ஒரு மாதிரியாகப் பார்த்தோம், மேலும் இந்த நிறுவப்பட்ட தொழில்நுட்பத்தைப் பயன்படுத்த Azure பேச்சு சேவைகளை எங்கள் பின்தளமாகப் பயன்படுத்தினோம்.

எந்தவொரு புதிய தயாரிப்பைப் போலவே, சவால்களும் உடனடியாக எழுந்தன. எங்கள் தயாரிப்பைத் தொடங்க ஆர்வமாக இருந்த நாங்கள், மைக்ரோசாஃப்ட் கைனெக்ட் டிகே மைக்ரோஃபோன் வரிசையைப் பயன்படுத்தத் தேர்ந்தெடுத்தோம், இது பேச்சு சேவைகளின் வன்பொருள்-இணைப்பாக விளம்பரப்படுத்தப்பட்டது மற்றும் Azure இன் தானியங்கி பேச்சு அங்கீகார மாதிரிகளிலிருந்து மிக உகந்த செயல்திறனைப் பெற வடிவமைக்கப்பட்டது. இது மறுக்க முடியாதபடி நன்கு கட்டமைக்கப்பட்ட, நன்கு வடிவமைக்கப்பட்ட சாதனமாக இருந்தாலும், இது ஒரு முழு அலுமினிய உறை, ஒரு அகல கோண லென்ஸ், ஒரு ஆழமான கேமரா மற்றும் 7 மைக்ரோஃபோன் வரிசையுடன் வருகிறது. இது கிட்டத்தட்ட $400 என்ற அதிக விலையையும் கொண்டுள்ளது. ஏப்ரல் 2021 முதல், கைனெக்ட் டிகே கடுமையான இருப்பு பற்றாக்குறை சிக்கலைக் கொண்டிருந்தது. செப்டம்பர் 2021 இல் இன்றுவரை இது இன்னும் இருப்பு இல்லை. இது கைனெக்ட் எங்களுக்கு சரியான சாதனம் அல்ல என்பதை மேலும் உறுதிப்படுத்தியது.

<center>
<img src="/images/blog/7-seameet-voice-intelligence-meeting-transcription-hardware/kinect_store_page.png"/>

*இந்த கட்டுரை வெளியிடப்பட்ட நேரத்தில் (2021/9) Azure Kinect DK 2021/4 முதல் இருப்பு இல்லை*
</center>

மைக்ரோஃபோன் வரிசை என்பது உரையாடல் படியெடுத்தல் பைப்லைனில் முதல் கூறு ஆகும். படியெடுத்தல் சேவையின் வழங்குநர்களாக, எங்கள் வன்பொருளை நிலையான மற்றும் நம்பகமான முறையில் பெற முடியும்.

சரியான மைக்ரோஃபோன் வரிசையைக் கண்டுபிடிப்பதற்கான எங்கள் பயணம் இரண்டு விருப்பங்களுக்கு வழிவகுத்தது: [Respeaker Array v2.0](https://www.seeedstudio.com/ReSpeaker-Mic-Array-v2-0.html) மற்றும் [Respeaker Core v2.0](https://www.seeedstudio.com/ReSpeaker-Core-v2-0.html). இந்த இரண்டு சாதனங்களும் வட்ட வரிசைகள், முறையே நான்கு மற்றும் ஆறு மைக்ரோஃபோன்கள், இது 360 டிகிரி மூல உள்ளூர்மயமாக்கலைச் செய்யக்கூடிய ஒரு முக்கியமான அம்சமாகும், மேலும் இந்த புதிய சாதனங்களை எங்கள் இருக்கும் அமைப்பில் எளிதாக ஒருங்கிணைக்க அனுமதிக்கிறது. இந்த சாதனங்களின் உண்மையான அழகு என்னவென்றால், அவை சத்தம் நீக்குதல், எதிரொலி ரத்துசெய்தல் மற்றும் பீம்ஃபார்மிங் உள்ளிட்ட உள்ளமைக்கப்பட்ட சிக்னல் செயலாக்க அல்காரிதம்களுடன் வருகின்றன, அவை மைக்ரோஃபோனின் பரிமாணங்களுக்கு சரியாக வடிவமைக்கப்பட்டுள்ளன.

<center>
<img src="/images/blog/7-seameet-voice-intelligence-meeting-transcription-hardware/respeaker_array.png" alt="Respeaker Array v2.0 VAD மற்றும் மூல உள்ளூர்மயமாக்கலை நிரூபிக்கிறது"/>

*Respeaker Array v2.0 VAD மற்றும் மூல உள்ளூர்மயமாக்கலை நிரூபிக்கிறது*
</center>

<center>
<img src="/images/blog/7-seameet-voice-intelligence-meeting-transcription-hardware/array_demo.jpg" alt="Respeaker Array v2.0 உடன் நேரடி சந்திப்பு டெமோ"/>

*Respeaker Array v2.0 உடன் நேரடி சந்திப்பு டெமோ*
</center>

நான்கு மைக்ரோஃபோன் வரிசை Array v2.0 க்கு, இது ஒரு USB போர்ட் மூலம் முழுமையாக இயக்கப்பட்டது, இதன் பொருள் பயனரின் கணினி சேவையகத்திற்கு ஆடியோவை ஸ்ட்ரீமிங் செய்வதில் மட்டுமே கவனம் செலுத்த வேண்டும். இது சிக்னல் செயலாக்கத்தை மைக்ரோஃபோன் வரிசைக்கு மாற்றுகிறது.


<center>
<img src="/images/blog/7-seameet-voice-intelligence-meeting-transcription-hardware/core_demo.png" alt="டெமோவுடன் Respeaker Core v2.0 படம்"/>

*டெமோவுடன் Respeaker Core v2.0 படம்*
</center>

ARM செயலி மற்றும் 1GB RAM உடன் பொருத்தப்பட்ட Core v2.0 இன்னும் கவர்ச்சிகரமானது. முழு லினக்ஸ் விநியோகத்தை இயக்கக்கூடியது மற்றும் எங்கள் கிளையன்ட் ஸ்கிரிப்டை இயக்க போதுமான செயலாக்க சக்தியுடன், இந்த சாதனத்துடன் பயனரின் கணினியிலிருந்து செயலாக்கத்தை நாங்கள் இறக்கியது மட்டுமல்லாமல், மைக்ரோஃபோனுடன் கணினியை இணைக்க வேண்டிய தேவையையும் முழுமையாக நீக்கிவிட்டோம். மைக்ரோஃபோன் வரிசைகள் இப்போது கனமான செயலாக்கத்தைச் செய்வதால், எங்கள் தயாரிப்பை இயக்கத் தேவையான வன்பொருள் தேவைகளை நாங்கள் குறைத்தோம், இதனால் SeaMeet இலிருந்து பயனடையக்கூடிய எங்கள் பார்வையாளர்களை திறம்பட அதிகரித்தோம்.

<center>
<img src="/images/blog/7-seameet-voice-intelligence-meeting-transcription-hardware/respeaker_core.png" alt="தனித்த மைக்ரோஃபோன் வைப்பதற்கான Core v2.0 எடுத்துக்காட்டு"/>

*தனித்த மைக்ரோஃபோன் வைப்பதற்கான Core v2.0 எடுத்துக்காட்டு*
</center>

இந்த மைக்ரோஃபோன் வரிசைகளின் மற்றொரு தனித்துவமான அம்சம் அவற்றின் உறை இல்லாதது. இரண்டும் மைக்குகள், சில்லுகள் மற்றும் போர்ட்கள் அனைத்தும் வெளிப்படும் வெற்று PCB களாக அனுப்பப்படுகின்றன. பலர் இதை ஒரு சிரமமாகப் பார்த்தாலும், இது சந்தேகத்திற்கு இடமின்றி Seasalt இன் தனித்துவமான சாதனத்தை உருவாக்கும் வாய்ப்பாக நாங்கள் பார்க்கிறோம்.

    இந்த சாதனங்கள் மூலம், எங்கள் புதிய, அதிநவீன சந்திப்பு படியெடுத்தல் சேவையான SeaMeet இன் எங்கள் முன்மாதிரியை நாங்கள் முடித்துவிட்டோம். இதன் மூலம், எங்கள் ஐந்து பகுதித் தொடரை நாங்கள் முடிக்கிறோம், Microsoft டெமோவால் ஈர்க்கப்பட்ட ஒரு விதை மட்டுமே SeaMeet ஆக இருந்தபோது தொடங்கி, முழுமையாக சுதந்திரமான தயாரிப்புடன் முடிந்தது. அதன் ஆரம்ப கட்டங்களில் இருந்தாலும், SeaMeet அதன் டயரிசேஷன் அமைப்பு, சந்திப்பு உணர்வு மற்றும் மொழி மாதிரிகளை நாங்கள் தொடர்ந்து மெருகூட்டுவதால் ஒரு அற்புதமான பயணத்தை முன்னால் கொண்டுள்ளது. Seasalt.ai குழு உலக வணிகத்தை நடத்தும் விதத்தில் தொடர்ந்து புரட்சியை ஏற்படுத்த ஆர்வமாக உள்ளது.
`;export{e as default};
