const n=`---
title: "Автоматизация контакт-центра с ИИ: сотрудничество виртуальных агентов с CRM"
metatitle: "SeaX Contact Center: автоматизация виртуальных агентов с CRM"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: "В этом блоге мы рассмотрим интеграцию CRM, такой как HubSpot, в Seax Contact Center, что позволит вам получить прямой доступ ко всей информации и инструментам."
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## Интеграция HubSpot с SeaX

Легкий и бесшовный доступ к интерфейсу контакт-центра и данным клиентов в CRM жизненно важен для эффективной поддержки клиентов. В SeaX, совместном продукте контакт-центра от Seasalt.ai, вы можете реализовать это, интегрируя CRM, такую как HubSpot, непосредственно в интерфейс контакт-центра, получая прямой доступ ко всей информации и инструментам.

Многие компании не используют мощную автоматизацию, которую обеспечивает интеграция этих платформ. Виртуальные агенты с ИИ упрощают рабочий процесс и используют ваши данные в HubSpot.

### Расширьте возможности виртуальных агентов

Omni-channel поддержка SeaX позволяет взаимодействовать с клиентами на различных платформах в одном интерфейсе. Виртуальные агенты, подключенные к платформе Twilio, могут связываться с вашими клиентами по разным каналам, предоставляя базовую поддержку 24/7. Эти виртуальные агенты выполняют рутинные задачи и отвечают на вопросы, освобождая ваших живых агентов для более сложных звонков и задач. В настоящее время SeaX поддерживает следующие каналы:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

Интеграция HubSpot дает вашим виртуальным агентам доступ к той же информации о клиентах, что и у живых агентов. Знания виртуального агента о клиентах растут в реальном времени по мере записи информации о клиентах в HubSpot.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="Интерфейс HubSpot может быть интегрирован непосредственно в SeaX Collaborative Contact Center от Seasalt.ai"/>

*Интерфейс HubSpot может быть интегрирован непосредственно в SeaX Collaborative Contact Center.*
</center>

### Оптимизация рабочего процесса с помощью автоматизации

Многие рутинные задачи и взаимодействия с клиентами ежедневно выполняются вашими живыми агентами. В HubSpot есть инструменты для отслеживания всех ваших задач и даже автоматизации некоторых процессов, таких как отправка маркетинговых писем.

Omni-channel поддержка SeaX позволяет автоматизировать отправку сообщений на SMS, голосовые вызовы, Facebook Messenger, WhatsApp и другие каналы. В сочетании с HubSpot Webhooks API, который отслеживает изменения в объектах HubSpot, вы можете отправлять сообщения клиентам на любом канале простым действием, например, нажатием кнопки или перемещением тикета поддержки. Кроме того, виртуальный агент может обработать ответ клиента, поэтому живому агенту нужно только начать разговор.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="Перемещение тикета в pipeline HubSpot автоматически инициирует звонок клиенту"/>

*Перемещение тикета в pipeline HubSpot (слева) автоматически инициирует звонок клиенту (справа).*
</center>

### Используйте свои данные везде

Интеграция SeaX и HubSpot дает вам прямой доступ к данным клиентов в интерфейсе контакт-центра. Она также позволяет автоматизации и виртуальным агентам взаимодействовать с этими данными и дополнять их.

После завершения разговора с клиентом в SeaX автоматизация может напрямую добавить взаимодействие к контакту клиента в HubSpot, чтобы живой агент не тратил время на написание отчета. Виртуальные агенты также могут добавлять свои взаимодействия, а также обновлять контактную информацию или время встречи клиента на основе разговора.
`;export{n as default};
