const n=`---
title: "اتوماسیون مرکز تماس مبتنی بر هوش مصنوعی: همکاری نماینده مجازی با CRM"
metatitle: "مرکز تماس SeaX: اتوماسیون نماینده مجازی با CRM"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: "در این بلاگ، ادغام یک CRM مانند HubSpot با مرکز تماس Seax را بررسی می‌کنیم که دسترسی مستقیم به تمام اطلاعات و ابزارهایتان را فراهم می‌کند."
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## ادغام HubSpot با SeaX

دسترسی آسان و بدون وقفه به رابط مرکز تماس و داده‌های مشتریان در CRM برای پشتیبانی مؤثر مشتریان حیاتی است. در SeaX، محصول مرکز تماس مشارکتی Seasalt.ai، می‌توانید با ادغام یک CRM مانند HubSpot به طور مستقیم در رابط مرکز تماس، به تمام اطلاعات و ابزارهایتان دسترسی مستقیم داشته باشید.

بسیاری از کسب‌وکارها از اتوماسیون قدرتمندی که با ادغام این پلتفرم‌ها ممکن می‌شود، بهره نمی‌برند. نمایندگان مجازی مبتنی بر هوش مصنوعی، جریان کاری شما را ساده‌تر کرده و از داده‌های شما در HubSpot استفاده می‌کنند.

### توانمندسازی نمایندگان مجازی

پشتیبانی چندکاناله SeaX به شما امکان می‌دهد با مشتریان خود در پلتفرم‌های مختلف، همه در یک رابط، تعامل داشته باشید. نمایندگان مجازی متصل به پلتفرم Twilio می‌توانند با مشتریان شما در کانال‌های مختلف ارتباط برقرار کنند و پشتیبانی پایه را به صورت ۲۴ ساعته ارائه دهند. این نمایندگان مجازی وظایف و پرسش‌های روتین را مدیریت می‌کنند تا نمایندگان زنده بتوانند روی تماس‌ها و وظایف پیچیده‌تر تمرکز کنند. SeaX در حال حاضر از کانال‌های زیر پشتیبانی می‌کند:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

ادغام HubSpot به نمایندگان مجازی شما دسترسی به همان اطلاعات مشتریان را می‌دهد که نمایندگان زنده دارند. دانش نماینده مجازی شما درباره مشتریان در زمان واقعی با ثبت اطلاعات مشتریان در HubSpot رشد می‌کند.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="رابط HubSpot می‌تواند مستقیماً در مرکز تماس مشارکتی SeaX ادغام شود"/>

*رابط HubSpot می‌تواند مستقیماً در مرکز تماس مشارکتی SeaX ادغام شود.*
</center>

### ساده‌سازی جریان کاری با اتوماسیون

وظایف و تعاملات روتین زیادی وجود دارد که نمایندگان زنده شما هر روز مدیریت می‌کنند. HubSpot ابزارهایی برای پیگیری همه وظایف شما و حتی اتوماسیون برخی امور مانند ارسال ایمیل‌های بازاریابی دارد.

پشتیبانی چندکاناله SeaX امکان اتوماسیون پیام‌ها به SMS، تماس صوتی، Facebook Messenger، WhatsApp و موارد دیگر را فراهم می‌کند. همراه با API وب‌هوک HubSpot که به شما امکان پیگیری تغییرات در اشیاء HubSpot را می‌دهد، می‌توانید با یک اقدام ساده مانند کلیک روی دکمه یا جابجایی تیکت پشتیبانی، به مشتریان در هر کانالی پیام ارسال کنید. علاوه بر این، نماینده مجازی می‌تواند پاسخ مشتری را مدیریت کند تا نماینده زنده فقط مکالمه را آغاز کند.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="جابجایی تیکت در پایپ‌لاین HubSpot به طور خودکار تماس با مشتری را آغاز می‌کند"/>

*جابجایی تیکت در پایپ‌لاین HubSpot (چپ) به طور خودکار تماس با مشتری را آغاز می‌کند (راست).*
</center>

### داده‌های خود را همه‌جا به کار بگیرید

ادغام SeaX و HubSpot به شما امکان دسترسی مستقیم به داده‌های مشتریان در رابط مرکز تماس را می‌دهد. همچنین به اتوماسیون و نمایندگان مجازی شما امکان تعامل و افزودن به آن پایگاه داده را می‌دهد.

پس از پایان مکالمه با مشتری در SeaX، اتوماسیون می‌تواند تعامل را مستقیماً به مخاطب مشتری در HubSpot اضافه کند تا نماینده زنده وقت خود را صرف نوشتن گزارش نکند. نمایندگان مجازی نیز می‌توانند تعاملات خود را اضافه کرده و اطلاعات تماس یا زمان قرار را بر اساس مکالمه به‌روزرسانی کنند.
`;export{n as default};
