const n=`---
title: "AI-ஐ பயன்படுத்தி தொடர்பு மைய தானியக்கம்: CRM உடன் виртуல் ஏஜென்ட் ஒத்துழைப்பு"
metatitle: "SeaX Contact Center: CRM உடன் виртуல் ஏஜென்ட் தானியக்கம்"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: "இந்த வலைப்பதிவில், HubSpot போன்ற CRM-ஐ Seax Contact Center-இல் ஒருங்கிணைப்பது குறித்து ஆராய்வோம், இது உங்கள் அனைத்து தகவல்களையும் கருவிகளையும் நேரடியாக அணுக அனுமதிக்கிறது."
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## HubSpot-ஐ SeaX-இல் ஒருங்கிணைத்தல்

உங்கள் தொடர்பு மைய இடைமுகம் மற்றும் CRM-இல் உள்ள வாடிக்கையாளர் தரவுகளுக்கு எளிதாகவும் தடையில்லாமல் அணுகுவது திறமையான வாடிக்கையாளர் ஆதரவுக்குத் தேவையானது. Seasalt.ai-யின் SeaX கூட்டுறவு தொடர்பு மைய தயாரிப்பில், HubSpot போன்ற CRM-ஐ நேரடியாக உங்கள் தொடர்பு மைய இடைமுகத்தில் ஒருங்கிணைப்பதன் மூலம், உங்கள் அனைத்து தகவல்களையும் கருவிகளையும் நேரடியாக அணுக முடியும்.

இந்த தளங்களை ஒருங்கிணைப்பதன் மூலம் கிடைக்கும் சக்திவாய்ந்த தானியக்கத்தை பல நிறுவனங்கள் பயன்படுத்தவில்லை. AI-ஐ பயன்படுத்தும் виртуல் ஏஜென்ட்கள் உங்கள் பணிப்பாய்வை எளிதாக்கி, HubSpot-இல் உள்ள உங்கள் தரவுகளை பயன்படுத்துகின்றன.

### உங்கள் виртуல் ஏஜென்ட்களை வலுப்படுத்துங்கள்

SeaX-இன் omni-channel ஆதரவு மூலம், பல்வேறு தளங்களில் உள்ள வாடிக்கையாளர்களுடன் ஒரே இடைமுகத்தில் தொடர்பு கொள்ள முடியும். Twilio பிளாட்பாரத்தில் இணைக்கப்பட்ட виртуல் ஏஜென்ட்கள் பல சேனல்களில் உங்கள் வாடிக்கையாளர்களை தொடர்பு கொண்டு, 24/7 அடிப்படை ஆதரவை வழங்குகின்றன. இந்த виртуல் ஏஜென்ட்கள் வழக்கமான பணிகள் மற்றும் கேள்விகளை கையாளுகின்றன, உங்கள் நேரடி ஏஜென்ட்கள் சிக்கலான அழைப்புகள் மற்றும் பணிகளில் கவனம் செலுத்த முடியும். தற்போது SeaX கீழ்காணும் சேனல்களை ஆதரிக்கிறது:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

HubSpot-ஐ ஒருங்கிணைப்பதால், உங்கள் виртуல் ஏஜென்ட்கள் உங்கள் நேரடி ஏஜென்ட்கள் போலவே வாடிக்கையாளர் தகவல்களை அணுக முடியும். HubSpot-இல் வாடிக்கையாளர் தகவலை பதிவு செய்யும் போது, உங்கள் виртуல் ஏஜென்ட்களின் அறிவு நேரடியாக வளர்கிறது.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="HubSpot இடைமுகம் Seasalt.ai-யின் SeaX கூட்டுறவு தொடர்பு மையத்தில் நேரடியாக ஒருங்கிணைக்க முடியும்"/>

*HubSpot இடைமுகம் SeaX கூட்டுறவு தொடர்பு மையத்தில் நேரடியாக ஒருங்கிணைக்க முடியும்.*
</center>

### தானியக்கங்களுடன் பணிப்பாய்வை எளிதாக்குங்கள்

உங்கள் நேரடி ஏஜென்ட்கள் தினமும் பல வழக்கமான பணிகள் மற்றும் வாடிக்கையாளர் தொடர்புகளை கையாளுகின்றனர். HubSpot-இல் அனைத்து பணிகளை கண்காணிக்கவும், மார்க்கெட்டிங் மின்னஞ்சல்களை அனுப்புவது போன்ற சில விஷயங்களை தானாக செய்யவும் கருவிகள் உள்ளன.

SeaX-இன் omni-channel ஆதரவு மூலம், SMS, வாய் அழைப்புகள், Facebook Messenger, WhatsApp மற்றும் பல சேனல்களுக்கு செய்திகளை தானாக அனுப்ப முடியும். HubSpot Webhooks API-யுடன் இணைந்து, HubSpot பொருட்களில் மாற்றங்களை கண்காணிக்க முடியும், ஒரு பட்டனை கிளிக் செய்வது அல்லது ஆதரவு டிக்கெட்டை நகர்த்துவது போன்ற எளிய செயல்பாடுகள் மூலம் எந்த சேனலிலும் வாடிக்கையாளர்களுக்கு செய்தி அனுப்ப முடியும். மேலும், виртуல் ஏஜென்ட் வாடிக்கையாளர் பதிலைக் கையாள முடியும், எனவே நேரடி ஏஜென்ட் உரையாடலைத் தொடங்க வேண்டும்.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="HubSpot pipeline-இல் டிக்கெட்டை நகர்த்துவது வாடிக்கையாளருக்கு தானாக ஒரு அழைப்பைத் தொடங்கும்"/>

*HubSpot pipeline-இல் டிக்கெட்டை நகர்த்துவது (இடது) வாடிக்கையாளருக்கு தானாக ஒரு அழைப்பைத் தொடங்கும் (வலது).* 
</center>

### உங்கள் தரவை எங்கும் பயன்படுத்துங்கள்

SeaX மற்றும் HubSpot-ஐ ஒருங்கிணைப்பதால், உங்கள் தொடர்பு மைய இடைமுகத்தில் வாடிக்கையாளர் தரவுகளை நேரடியாக அணுக முடியும். இது தானியக்கங்களுக்கும் உங்கள் виртуல் ஏஜென்ட்களுக்கும் அந்த தரவுடன் தொடர்பு கொள்ளவும், புதுப்பிக்கவும் அனுமதிக்கிறது.

SeaX-இல் வாடிக்கையாளருடன் உரையாடலை முடித்ததும், தானியக்கம் அந்த தொடர்பை HubSpot-இல் உள்ள வாடிக்கையாளர் தொடர்பில் நேரடியாக சேர்க்க முடியும், எனவே நேரடி ஏஜென்ட் உரையாடலை எழுத நேரம் வீணாக்க வேண்டியதில்லை. виртуல் ஏஜென்ட்கள் தங்களது தொடர்புகளை வாடிக்கையாளர் தகவலில் சேர்க்கவும், உரையாடலின் அடிப்படையில் தொடர்பு தகவல் அல்லது சந்திப்பு நேரத்தை புதுப்பிக்கவும் முடியும்.
`;export{n as default};
