const t=`---
title: "एआई-सक्षम संपर्क केंद्र स्वचालन: वर्चुअल एजेंट और सीआरएम का सहयोग"
metatitle: "SeaX Contact Center: वर्चुअल एजेंट स्वचालन और सीआरएम"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: "इस ब्लॉग में, हम HubSpot जैसे CRM को Seax Contact Center में एकीकृत करने की प्रक्रिया को देखेंगे, जिससे आपको अपनी सभी जानकारी और टूल्स तक सीधा पहुंच मिलेगी।"
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## SeaX में HubSpot का एकीकरण

अपने संपर्क केंद्र इंटरफ़ेस और CRM में ग्राहक डेटा तक आसान और निर्बाध पहुंच कुशल ग्राहक सहायता के लिए आवश्यक है। Seasalt.ai के SeaX सहयोगी संपर्क केंद्र उत्पाद में, आप HubSpot जैसे CRM को सीधे अपने संपर्क केंद्र इंटरफ़ेस में एकीकृत कर सकते हैं, जिससे आपको अपनी सभी जानकारी और टूल्स तक सीधा पहुंच मिलती है।

कई व्यवसाय इन प्लेटफार्मों के एकीकरण से संभव शक्तिशाली स्वचालन का लाभ नहीं उठा रहे हैं। एआई-सक्षम वर्चुअल एजेंट आपके वर्कफ़्लो को सरल बनाते हैं और HubSpot में आपके डेटा का उपयोग करते हैं।

### अपने वर्चुअल एजेंट्स को सशक्त बनाएं

SeaX का ओमनी-चैनल समर्थन आपको कई प्लेटफार्मों पर अपने ग्राहकों के साथ एक ही इंटरफ़ेस में बातचीत करने की सुविधा देता है। Twilio प्लेटफार्म से जुड़े वर्चुअल एजेंट आपके ग्राहकों से विभिन्न चैनलों पर संपर्क कर सकते हैं और 24/7 बेसिक सपोर्ट प्रदान कर सकते हैं। ये वर्चुअल एजेंट नियमित कार्य और प्रश्नों को संभालते हैं, जिससे आपके लाइव एजेंट जटिल कॉल्स और अन्य कार्यों पर ध्यान केंद्रित कर सकते हैं। वर्तमान में SeaX निम्नलिखित चैनलों का समर्थन करता है:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

HubSpot के एकीकरण से आपके वर्चुअल एजेंट्स को वही ग्राहक जानकारी मिलती है जो आपके लाइव एजेंट्स के पास होती है। जैसे-जैसे आप HubSpot में ग्राहक जानकारी रिकॉर्ड करते हैं, आपके वर्चुअल एजेंट्स का ज्ञान वास्तविक समय में बढ़ता है।

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="HubSpot इंटरफ़ेस को Seasalt.ai के SeaX सहयोगी संपर्क केंद्र में सीधे एकीकृत किया जा सकता है"/>

*HubSpot इंटरफ़ेस को SeaX सहयोगी संपर्क केंद्र में सीधे एकीकृत किया जा सकता है।*
</center>

### स्वचालन के साथ वर्कफ़्लो को सुव्यवस्थित करें

कई नियमित कार्य और ग्राहक इंटरैक्शन आपके लाइव एजेंट्स रोज़ाना संभालते हैं। HubSpot में आपके सभी कार्यों को ट्रैक करने और मार्केटिंग ईमेल भेजने जैसी चीजों को स्वचालित करने के लिए टूल्स हैं।

SeaX का ओमनी-चैनल समर्थन आपको SMS, वॉयस कॉल, Facebook Messenger, WhatsApp आदि पर संदेशों को स्वचालित करने की सुविधा देता है। HubSpot Webhooks API के साथ मिलकर, जो आपके HubSpot ऑब्जेक्ट्स में बदलाव को ट्रैक करता है, आप एक बटन क्लिक या सपोर्ट टिकट को मूव करने जैसी सरल क्रिया से किसी भी चैनल पर ग्राहकों को संदेश भेज सकते हैं। इसके अलावा, वर्चुअल एजेंट ग्राहक की प्रतिक्रिया को संभाल सकते हैं, जिससे लाइव एजेंट को केवल बातचीत शुरू करनी होती है।

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="HubSpot पाइपलाइन में टिकट को मूव करने से ग्राहक को स्वतः कॉल जाता है"/>

*HubSpot पाइपलाइन (बाएँ) में टिकट को मूव करने से ग्राहक को स्वतः कॉल जाता है (दाएँ)।*
</center>

### अपने डेटा का हर जगह लाभ उठाएं

SeaX और HubSpot का एकीकरण आपको अपने संपर्क केंद्र इंटरफ़ेस में सीधे ग्राहक डेटा तक पहुंच देता है। यह स्वचालन और आपके वर्चुअल एजेंट्स को उस डेटा के साथ इंटरैक्ट करने और उसमें जोड़ने की सुविधा भी देता है।

जब आप SeaX में ग्राहक के साथ बातचीत समाप्त करते हैं, तो स्वचालन सीधे HubSpot में ग्राहक के संपर्क में इंटरैक्शन जोड़ सकता है, जिससे लाइव एजेंट को बातचीत का विवरण लिखने में समय बर्बाद नहीं करना पड़ता। वर्चुअल एजेंट भी अपनी इंटरैक्शन जोड़ सकते हैं और बातचीत के आधार पर ग्राहक की संपर्क जानकारी या अपॉइंटमेंट समय अपडेट कर सकते हैं।
`;export{t as default};
