const t=`---
title: "ศูนย์บริการลูกค้าอัตโนมัติด้วย AI: การทำงานร่วมกันของเอเจนต์เสมือนกับ CRM"
metatitle: "SeaX Contact Center: ระบบอัตโนมัติของเอเจนต์เสมือนกับ CRM"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: ในบล็อกนี้ เราจะสำรวจการผสานรวม CRM เช่น HubSpot เข้ากับ Seax Contact Center เพื่อให้คุณเข้าถึงข้อมูลและเครื่องมือทั้งหมดได้โดยตรง
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## การผสานรวม HubSpot กับ SeaX

การเข้าถึงอินเทอร์เฟซศูนย์บริการลูกค้าและข้อมูลลูกค้าใน CRM อย่างง่ายและไร้รอยต่อเป็นสิ่งสำคัญสำหรับการสนับสนุนลูกค้าที่มีประสิทธิภาพ ใน SeaX ผลิตภัณฑ์ศูนย์บริการลูกค้าแบบร่วมมือของ Seasalt.ai คุณสามารถทำสิ่งนี้ได้โดยการผสานรวม CRM เช่น HubSpot เข้ากับอินเทอร์เฟซศูนย์บริการลูกค้าโดยตรง เพื่อให้คุณเข้าถึงข้อมูลและเครื่องมือทั้งหมดได้โดยตรง

หลายธุรกิจยังไม่ได้ใช้ประโยชน์จากระบบอัตโนมัติที่ทรงพลังซึ่งเป็นไปได้จากการผสานรวมแพลตฟอร์มเหล่านี้ เอเจนต์เสมือนที่ขับเคลื่อนด้วย AI จะช่วยให้เวิร์กโฟลว์ของคุณง่ายขึ้นและใช้ข้อมูลใน HubSpot ได้อย่างเต็มที่

### เพิ่มศักยภาพให้เอเจนต์เสมือนของคุณ

SeaX รองรับหลายช่องทาง หมายความว่าคุณสามารถสื่อสารกับลูกค้าผ่านหลายแพลตฟอร์มในอินเทอร์เฟซเดียว เอเจนต์เสมือนที่เชื่อมต่อกับแพลตฟอร์ม Twilio สามารถติดต่อกับลูกค้าของคุณผ่านช่องทางต่าง ๆ ให้บริการพื้นฐานตลอด 24 ชั่วโมง เอเจนต์เสมือนเหล่านี้จะจัดการงานและคำถามที่เป็นกิจวัตร ปล่อยให้เอเจนต์สดของคุณมีเวลาจัดการสายที่ซับซ้อนและงานอื่น ๆ ปัจจุบัน SeaX รองรับช่องทางดังต่อไปนี้:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

การผสานรวม HubSpot จะช่วยให้เอเจนต์เสมือนของคุณเข้าถึงข้อมูลลูกค้าเดียวกับที่เอเจนต์สดมี ความรู้ของเอเจนต์เสมือนเกี่ยวกับลูกค้าจะเติบโตแบบเรียลไทม์เมื่อคุณบันทึกข้อมูลลูกค้าใน HubSpot

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="อินเทอร์เฟซ HubSpot สามารถผสานรวมเข้ากับ SeaX Collaborative Contact Center ของ Seasalt.ai ได้โดยตรง"/>

*อินเทอร์เฟซ HubSpot สามารถผสานรวมเข้ากับ SeaX Collaborative Contact Center ได้โดยตรง*
</center>

### ปรับปรุงเวิร์กโฟลว์ด้วยระบบอัตโนมัติ

มีงานและการติดต่อกับลูกค้าหลายอย่างที่เอเจนต์สดของคุณต้องจัดการทุกวัน HubSpot มีเครื่องมือสำหรับติดตามงานทั้งหมดของคุณ และแม้แต่การทำงานอัตโนมัติ เช่น การส่งอีเมลการตลาด

SeaX รองรับหลายช่องทางและเพิ่มความสามารถในการส่งข้อความอัตโนมัติไปยัง SMS, โทรศัพท์, Facebook Messenger, WhatsApp และอื่น ๆ เมื่อรวมกับ HubSpot Webhooks API ซึ่งช่วยให้คุณติดตามการเปลี่ยนแปลงใน HubSpot objects คุณสามารถส่งข้อความถึงลูกค้าบนทุกช่องทางด้วยการกระทำง่าย ๆ เช่น คลิกปุ่มหรือย้ายตั๋วสนับสนุน นอกจากนี้ เอเจนต์เสมือนยังสามารถจัดการการตอบกลับของลูกค้าได้ด้วย ดังนั้นเอเจนต์สดจึงต้องเริ่มต้นการสนทนาเท่านั้น

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="การย้ายตั๋วใน HubSpot pipeline จะเรียกโทรศัพท์ไปยังลูกค้าโดยอัตโนมัติ"/>

*การย้ายตั๋วใน HubSpot pipeline (ซ้าย) จะเรียกโทรศัพท์ไปยังลูกค้าโดยอัตโนมัติ (ขวา)*
</center>

### ใช้ข้อมูลของคุณได้ทุกที่

การผสานรวม SeaX และ HubSpot จะช่วยให้คุณเข้าถึงข้อมูลลูกค้าได้โดยตรงในอินเทอร์เฟซศูนย์บริการลูกค้า และยังช่วยให้ระบบอัตโนมัติและเอเจนต์เสมือนของคุณสามารถโต้ตอบและเพิ่มข้อมูลในฐานข้อมูลนั้นได้ด้วย

เมื่อคุณจบบทสนทนากับลูกค้าใน SeaX ระบบอัตโนมัติสามารถเพิ่มการติดต่อโดยตรงไปยังข้อมูลลูกค้าใน HubSpot ได้ทันที ดังนั้นเอเจนต์สดไม่ต้องเสียเวลาบันทึกการสนทนา เอเจนต์เสมือนก็สามารถเพิ่มการติดต่อและอัปเดตข้อมูลลูกค้าหรือเวลานัดหมายตามการสนทนาได้เช่นกัน
`;export{t as default};
