const n=`---
title: "أتمتة مركز الاتصال المدعومة بالذكاء الاصطناعي: تعاون الوكيل الافتراضي مع نظام إدارة علاقات العملاء"
metatitle: "مركز اتصال SeaX: أتمتة الوكيل الافتراضي مع نظام إدارة علاقات العملاء"
date: 2022-01-26 18:21:40+00:00
draft: false
author: Sarah Reid
description: "في هذه المدونة، سنستكشف دمج نظام إدارة علاقات العملاء مثل HubSpot في مركز الاتصال Seax، مما يمنحك وصولاً مباشراً إلى جميع معلوماتك وأدواتك."
weight: 1
tags:
  - HubSpot
  - SeaX
image: images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/flex-hubspot.png
canonicalURL: /blog/hubspot-crm-integration-automation-with-twilio-flex/
url: /blog/hubspot-crm-integration-automation-with-twilio-flex/
---

## دمج HubSpot مع SeaX

الوصول السهل والسلس إلى واجهة مركز الاتصال وبيانات العملاء في نظام إدارة علاقات العملاء أمر بالغ الأهمية لدعم العملاء بكفاءة. في SeaX، منتج مركز الاتصال التعاوني من Seasalt.ai، يمكنك تحقيق ذلك من خلال دمج نظام إدارة علاقات العملاء مثل HubSpot مباشرة في واجهة مركز الاتصال، مما يمنحك وصولاً مباشراً إلى جميع معلوماتك وأدواتك.

العديد من الشركات لا تستفيد من الأتمتة القوية التي توفرها هذه المنصات. الوكلاء الافتراضيون المدعومون بالذكاء الاصطناعي يبسطون سير العمل ويستفيدون من بياناتك في HubSpot.

### تمكين وكلائك الافتراضيين

دعم SeaX متعدد القنوات يعني أنه يمكنك التفاعل مع عملائك عبر العديد من المنصات في واجهة واحدة. يمكن للوكلاء الافتراضيين المتصلين بمنصة Twilio التواصل مع عملائك عبر القنوات المختلفة، وتقديم الدعم الأساسي على مدار الساعة. يتولى هؤلاء الوكلاء الافتراضيون المهام الروتينية والاستفسارات، مما يتيح للوكلاء المباشرين التركيز على المكالمات الأكثر تعقيداً والمهام الأخرى. حالياً يدعم SeaX القنوات التالية:

- Discord
- SMS
- Webchat
- WhatsApp
- Facebook Messenger
- Google Business Messages
- Line

دمج HubSpot يمنح وكلائك الافتراضيين الوصول إلى نفس معلومات العملاء التي يمتلكها الوكلاء المباشرون. تنمو معرفة وكيلك الافتراضي بعملائك في الوقت الفعلي أثناء تسجيل معلومات العملاء في HubSpot.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/hubspot.png" alt="يمكن دمج واجهة HubSpot مباشرة في مركز الاتصال التعاوني SeaX من Seasalt.ai"/>

*يمكن دمج واجهة HubSpot مباشرة في مركز الاتصال التعاوني SeaX.*
</center>

### تبسيط سير العمل باستخدام الأتمتة

هناك العديد من المهام الروتينية والتفاعلات مع العملاء التي يتعامل معها وكلاؤك المباشرون يومياً. لدى HubSpot أدوات لتتبع جميع مهامك وحتى أتمتة بعض الأمور مثل إرسال رسائل البريد الإلكتروني التسويقية.

دعم SeaX متعدد القنوات يضيف القدرة على أتمتة الرسائل إلى SMS والمكالمات الصوتية وFacebook Messenger وWhatsApp والمزيد. جنباً إلى جنب مع واجهة HubSpot Webhooks API، التي تتيح لك تتبع التغييرات في كائنات HubSpot، يمكنك إرسال رسالة إلى العملاء على أي قناة من خلال إجراء بسيط مثل النقر على زر أو نقل تذكرة دعم. بالإضافة إلى ذلك، يمكن للوكيل الافتراضي التعامل مع رد العميل، بحيث يحتاج الوكيل المباشر فقط إلى بدء المحادثة.

<center>
<img src="/images/blog/8-hubspot-crm-integration-automation-with-twilio-flex-contact-center/ticket-auto.gif" alt="نقل تذكرة في خط أنابيب HubSpot يؤدي تلقائياً إلى إجراء مكالمة هاتفية للعميل"/>

*نقل تذكرة في خط أنابيب HubSpot (يسار) يؤدي تلقائياً إلى إجراء مكالمة هاتفية للعميل (يمين).*
</center>

### استفد من بياناتك في كل مكان

دمج SeaX وHubSpot يمنحك وصولاً مباشراً إلى بيانات العملاء في واجهة مركز الاتصال الخاصة بك. كما يمنح الأتمتة ووكلائك الافتراضيين القدرة على التفاعل مع تلك البيانات وإضافتها.

عند الانتهاء من المحادثة مع العميل في SeaX، يمكن للأتمتة إضافة التفاعل مباشرة إلى جهة اتصال العميل في HubSpot، بحيث لا يحتاج الوكيل المباشر إلى إضاعة الوقت في كتابة تفاصيل المحادثة. يمكن للوكلاء الافتراضيين أيضاً إضافة تفاعلاتهم إلى معلومات العميل وتحديث بيانات الاتصال أو موعد العميل بناءً على المحادثة.
`;export{n as default};
