const a=`---
title: "Как развернуть чат-бота с ИИ на вашем сайте Wix с помощью SeaChat"
metatitle: "Как развернуть чат-бота с ИИ на вашем сайте Wix с помощью SeaChat"
date: 2024-04-09 00:22:19-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Xuchen Yao
description: "Расширьте возможности своего сайта Wix с помощью SeaChat - легко интегрируйте поддержку клиентов как на веб-странице Wix, так и в WhatsApp. Легко повышайте вовлеченность!"
weight: 1
tags:
  - SeaChat
  - Wix
  - WhatsApp
  - Интеграции
image: /images/blog/89-whatsapp-chatbot-wix-customer-service/89-whatsapp-chatbot-wix-customer-service.png
canonicalURL: /blog/whatsapp-chatbot-wix-customer-service/
url: /blog/whatsapp-chatbot-wix-customer-service/
---

Включение чат-бота WhatsApp AI от SeaChat в ваш сайт Wix не только повышает уровень обслуживания клиентов, но и выводит ваш бизнес на передний план технологических инноваций. Примите будущее взаимодействия с клиентами с помощью SeaChat.

В современном цифровом ландшафте эффективное обслуживание клиентов и вовлеченность пользователей имеют решающее значение для процветания бизнеса. [Wix](https://www.wix.com/), популярный конструктор веб-сайтов, предлагает различные инструменты для связи с клиентами, включая Wix Chat. Однако для более надежных и интеллектуальных взаимодействий рассмотрите возможность интеграции SeaChat — чат-бота на базе ИИ — в ваш сайт Wix. Давайте рассмотрим, как SeaChat улучшает ваше общение с клиентами.

# Введение: Wix Chat и WhatsApp

## Wix Chat: Удобный вариант

Wix Chat позволяет вам управлять разговорами непосредственно на вашем веб-сайте. Это полезный инструмент для взаимодействия с посетителями и решения их вопросов. Однако есть ограничение: ему не хватает сложности ИИ-агента. Хотя Wix Chat обеспечивает связь в реальном времени, вам все равно может потребоваться решение на базе ИИ для обработки запросов клиентов 24/7.

# Представляем SeaChat: Ваш ИИ-помощник
[SeaChat](https://chat.seasalt.ai/?utm_source=blog) устраняет этот пробел, предлагая ИИ-агента, который может беспрепятственно обрабатывать разговоры. Будь то ответы на распространенные вопросы, предоставление информации о продуктах или помощь в устранении неполадок, SeaChat всегда доступен. Но вот что самое интересное: вы можете интегрировать SeaChat не только напрямую с вашим виджетом веб-чата, но и с WhatsApp.

## Используйте SeaChat как виджет веб-чата на Wix

С SeaChat вам не нужно выбирать между веб-чатом и WhatsApp. Вы можете использовать SeaChat для обоих одновременно. Вот как:

1. **Создайте учетную запись SeaChat**: Если вы еще этого не сделали, зарегистрируйтесь для получения учетной записи SeaChat на веб-сайте [SeaChat](https://chat.seasalt.ai/?utm_source=blog). Создайте своего ИИ-агента для выполнения различных задач.

<center>
<img width="100%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/1-sign-up-seachat-account-for-free.jpeg" alt="Зарегистрироваться в SeaChat">
</center>

2. **Перейдите на панель управления Wix**: Войдите в свою панель управления Wix для соответствующего веб-сайта. Нажмите «Дизайн сайта», чтобы получить доступ к редактору сайта.

<center>
<img width="100%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-seachat-integration-step1.png" alt="Перейдите на панель управления Wix и нажмите «Дизайн сайта» в правом верхнем меню.">
</center>

3. **Добавить элементы**: В меню боковой панели выберите «Добавить элементы».

<center>
<img width="50%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-seachat-integration-step2.png" alt="Нажмите «Добавить элементы» на Wix">
</center>

4. **Встроить код SeaChat**: Выберите «Встроить код», затем «Встроить HTML». Получите фрагмент кода SeaChat из своей рабочей области (Конфигурация агента -> Каналы -> Канал Wix) и вставьте его в поле кода. Не забудьте нажать «Обновить».

<center>
<img width="90%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-seachat-integration-step4.png" alt="Вставьте фрагмент кода SeaChat в текстовое поле HEADER. Не забудьте нажать СОХРАНИТЬ.">
</center>

5. Настройте размер виджета чата: Используйте инструмент изменения размера, чтобы настроить размеры виджета чата. Перетащите виджет в нужное место (обычно в правый нижний угол).

<center>
<img width="80%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-seachat-integration-step5.png" alt="Настроить размер виджета чата">
</center>

6. Исправить расположение виджета SeaChat

Вам нужно будет зафиксировать расположение виджета, чтобы он не перемещался, когда посетители прокручивают страницу вниз. Выберите компонент > Щелкните правой кнопкой мыши > Выберите «Закрепить на экране». Тогда этот компонент будет зафиксирован в углу и будет плавать.

<center>
<img width="60%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-pin-to-screen.png" alt="Настроить расположение виджета чата">
</center>

Вы можете настроить поля/смещение. Мы рекомендуем 20 для вертикальных и горизонтальных настроек.

<center>
<img width="60%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-offset-margin.png" alt="Настроить расположение виджета чата">
</center>

7. Сохранить и просмотреть: Используйте функцию «Просмотр», чтобы протестировать своего ИИ-агента. Запустите веб-сайт, когда будете готовы.

<center>
<img width="60%" style="border-radius: 0.4rem" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/wix-seachat-integration-step6.png" alt="Просмотр агента SeaChat на веб-сайте">
</center>\`\`

Следуя приведенным выше шагам, вы легко интегрировали SeaChat в свой сайт Wix. Теперь ваши посетители могут взаимодействовать с ИИ-агентом, который понимает их запросы и разумно отвечает. Вы можете просмотреть полную версию руководства по интеграции канала Wix на SeaChat [здесь](https://wiki.seasalt.ai/seachat/seachat-manual/05-integrations/04-seachat-wix-integration/?utm_source=blog).

## Используйте SeaChat в WhatsApp

После входа в SeaChat перейдите в «Конфигурация агента» -> «Каналы» -> «WhatsApp», чтобы добавить интеграцию. С помощью SeaChat вы можете автоматизировать ответы на сообщения пользователей в WhatsApp, улучшая поддержку клиентов. Вот подробное руководство по подключению SeaChat к WhatsApp. У нас также есть видеоурок:

<iframe width="100%" height="400" src="https://www.youtube.com/embed/?v=qpNlWtGP9jw&list=PL8K7_LTqly44LeOocjDOpXH0svonxa0T0" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen style="border-radius: 30px;"></iframe>

После интеграции WhatsApp с SeaChat вы можете общаться с клиентами в WhatsApp, как показано на этом снимке экрана.

<center>
<img height="60%" width="100%" src="/images/blog/89-whatsapp-chatbot-wix-customer-service/seachat-whatsapp-1.png" alt="ИИ-агент в SeaChat-WhatsApp">

*Агент чата службы поддержки клиентов WhatsApp*
</center>


# Совместная работа: Интеграция SeaChat

Тот же ИИ-агент SeaChat теперь может одновременно обслуживать разговоры виджета вашего веб-сайта на сайтах Wix и запросы WhatsApp.

# Заключение
Wix Chat — отличная отправная точка, но SeaChat выводит его на новый уровень. Бесшовно объедините веб-чат и WhatsApp, и пусть ваш ИИ-агент обрабатывает разговоры круглосуточно. Независимо от того, посещают ли ваши клиенты ваш веб-сайт или отправляют вам сообщения в WhatsApp, SeaChat обеспечивает последовательное и интеллектуальное взаимодействие. Попробуйте и повысьте вовлеченность пользователей! 🚀

# Ссылки

- [Руководство по интеграции SeaChat Wix](https://wiki.seasalt.ai/seachat/seachat-manual/05-integrations/04-seachat-wix-integration/?utm_source=blog)
- [Руководство по интеграции SeaChat WhatsApp](https://wiki.seasalt.ai/seachat/seachat-manual/04-channels/04-seachat-whatsapp-integration/)
- [Руководство по интеграции SeaChat WhatsApp - Интеграция ИИ-агента с бизнес-сообщениями WhatsApp](https://www.youtube.com/watch?v=qpNlWtGP9jw&list=PL8K7_LTqly44LeOocjDOpXH0svonxa0T0)

### >> Откройте для себя [SeaChat](https://chat.seasalt.ai/?utm_source=blog) сегодня и начните свое путешествие в ИИ с уверенностью!
`;export{a as default};
