const n=`---
title: "Владельцы бизнеса: Не пропустите сообщения клиентов на Google Картах!"
metatitle: "Не пропустите сообщения клиентов на Google Картах!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "В этой статье мы расскажем вам о профиле компании в Google, его функции чата и способе избежать пропуска сообщений клиентов."
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*В этой статье мы расскажем вам о профиле компании в Google, его функции чата и способе избежать пропуска сообщений клиентов.*


Один из лучших способов выделиться для вашего бизнеса — это обеспечить превосходное обслуживание клиентов, которое включает в себя доступность для существующих и потенциальных клиентов, когда им нужна помощь, и предоставление актуальной информации о вашем бизнесе. Отличное обслуживание клиентов означает большее удовлетворение клиентов, безупречную репутацию и больше потенциальных клиентов. В этой статье мы расскажем вам о профиле компании в Google и его функции чата, которая может помочь вам построить отношения с клиентами.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="Пример списка компаний, который появляется на Google Картах"/>

*Пример списка компаний, который появляется на Google Картах.*
</center>

Профиль компании в Google — это инструмент, который позволяет компаниям создавать бесплатный профиль или список компаний, который будет отображаться в сервисах Google, таких как Google Поиск и Google Карты. Вы можете обратиться к ресурсам Google о том, [как добавить или заявить права на свой профиль компании в Google](https://support.google.com/business/answer/2911778?hl=ru&co=GENIE.Platform%3DDesktop). Преимущества наличия списка профиля компании в Google включают:

- Привлекайте клиентов и получайте больше видимости через Google Поиск и Google Карты
- Предоставляйте актуальную информацию о вашем бизнесе, такую как часы работы и атрибуты
- Создавайте репутацию через звездный рейтинг и отзывы
- Получайте информацию о производительности вашего поиска в сервисах Google

Однако создания профиля компании в Google недостаточно для удовлетворения постоянно растущих потребностей клиентов. Чтобы оптимизировать свой список профиля компании в Google, вы также можете активировать функцию чата профиля компании в Google, бесплатную услугу, доступную вашим клиентам прямо из вашего списка профиля компании в Google. Знаете ли вы, что [61% клиентов порекомендовали бы друзьям обратиться в другие компании с общением в реальном времени](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software)?


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="Как выглядит функция чата в списке компаний в приложении Google Карты"/>

*Как выглядит функция чата в списке компаний в приложении Google Карты.*
</center>

Вот почему мы считаем, что функция чата — отличный способ быть доступным для клиентов. Включив функцию чата для своего бизнеса, вы можете обеспечить общение в реальном времени, которого жаждут ваши клиенты. Вы можете обратиться к ресурсам Google о том, [как работает функция чата](https://support.google.com/business/answer/9114771?hl=ru&co=GENIE.Platform%3DAndroid#zippy=). Вы можете активировать функцию чата всего за 3 простых шага:

### Шаг 1. Войдите в свой аккаунт профиля компании в Google.

Посетите [домашнюю страницу профиля компании в Google](https://www.google.com/business/) и войдите в свой список компаний.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="Страница профиля компании в Google после входа владельца бизнеса"/>

*Страница профиля компании в Google после входа владельца бизнеса.*
</center>

### Шаг 2. Перейдите на вкладку «Сообщения».

Следующий шаг — нажать вкладку *«Сообщения»* в левой части страницы.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Интерфейс вкладки «Сообщения» в профиле компании в Google"/>

*Интерфейс вкладки «Сообщения».*
</center>

### Шаг 3. Активируйте функцию «Чат» в своем списке.

Нажмите кнопку *«Включить чат»*, как показано ниже.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "Нажатие кнопки «Включить чат» активирует функцию чата"/>

*Нажмите кнопку «Включить чат», чтобы активировать функцию чата.*
</center>

Как только вы нажмете кнопку *«Включить чат»*, появится всплывающее окно, уведомляющее вас о том, что ваш чат активирован. Google также отправит вам уведомление по электронной почте о вашей недавно активированной функции чата.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="Сообщение с подтверждением успешной активации чата профиля компании в Google"/>

*Всплывающая страница, уведомляющая владельца бизнеса о том, что функция чата активирована.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Уведомление по электронной почте от Google о недавно активированной функции «Чат» на Google Картах"/>

*Уведомление по электронной почте от Google о недавно активированной функции «Чат».*
</center>


После активации службы обмена сообщениями профиля компании в Google вы сможете увидеть кнопку чата в своем списке, и клиенты смогут связаться с вашей компанией по любым вопросам, которые у них могут возникнуть. Имейте в виду, что при использовании этой функции вы должны убедиться, что вы будете доступны для ответа на запросы. Клиенты могут видеть ваше среднее время ответа и могут быть обескуражены, чтобы связаться с вами, если они увидят более длительное время ответа. Крайне важно, чтобы вы отвечали на сообщения своих клиентов в течение 24 часов. Согласно [странице часто задаваемых вопросов профиля компании в Google](https://support.google.com/business/answer/9114771?hl=ru&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google), Google может удалить кнопку «Чат» из вашего списка, если вы не ответите в течение дня.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="Время ответа отображается в функции чата на Google Картах, когда клиенты собираются ввести вопросы"/>

*Время ответа отображается в функции чата на Google Картах,
когда клиенты собираются ввести вопросы.*
</center>

Но не волнуйтесь, Google предоставляет вам еще один способ уведомлять вас, когда клиенты отправляют сообщения вашему бизнесу через кнопку чата. Google отправит вам электронное письмо о пропущенных сообщениях. Или, как это произошло с некоторыми клиентами, вы можете активировать SMS-оповещения, чтобы получать уведомления о пропущенных сообщениях. Согласно этой статье, SMS-оповещения раньше были основной функцией обмена сообщениями в профиле компании в Google. Однако эта функция была заменена мобильным приложением и веб-интерфейсом. Похоже, Google возвращает эту функцию для профиля компании в Google. Мы рекомендуем, чтобы после активации функции чата вы дождались появления уведомления о новой функции SMS-оповещений на вашем телефоне. По нашему опыту, из 5 компаний, которыми мы управляем, только 2 получили уведомление об этой функции.


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="Всплывающее уведомление о новой функции SMS-оповещений в профиле Google Карт"/>

*Всплывающее уведомление о новой функции SMS-оповещений.*
</center>

Затем введите номер телефона, который вы хотите использовать для получения уведомлений, и включите *«Получать SMS-уведомления, когда клиенты отправляют сообщение»*.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="Поле номера мобильного телефона, указывающее, куда будут приходить уведомления чата профиля компании в Google"/>

*Страница настроек уведомлений для включения функции SMS-оповещений.*
</center>

Google отправит вам код подтверждения на ваш номер телефона. Введите код подтверждения, и все готово! 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="Поле кода подтверждения для включения текстовых уведомлений из чата профиля компании в Google"/>

*Появится всплывающая страница, на которой вы сможете ввести код подтверждения, отправленный Google на ваш номер телефона.*
</center>

Теперь, когда вы знаете, как активировать кнопку чата в своем списке и ее преимущества, как вы убедитесь, что ваш бизнес сможет справляться с растущим числом запросов клиентов? Ответы на повторяющиеся чаты требуют много времени и денег. Ознакомьтесь с нашей следующей статьей о Google Business Messages и о том, как это может помочь вам сэкономить время и деньги при предоставлении отличного обслуживания клиентов.

[Закажите демонстрацию у нас](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) и будьте первыми, кто получит бесплатную пробную версию нашего продукта!
`;export{n as default};
