const e=`---
title: "வணிக உரிமையாளர்கள்: Google Maps இல் வாடிக்கையாளர் செய்திகளைத் தவறவிடாதீர்கள்!"
metatitle: "Google Maps இல் வாடிக்கையாளர் செய்திகளைத் தவறவிடாதீர்கள்!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "இந்தக் கட்டுரையில், Google Business Profile, அதன் அரட்டை அம்சம் மற்றும் வாடிக்கையாளர் செய்திகளைத் தவறவிடுவதைத் தவிர்க்கும் வழியைப் பற்றி உங்களுக்கு விளக்குவோம்."
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*இந்தக் கட்டுரையில், Google Business Profile, அதன் அரட்டை அம்சம் மற்றும் வாடிக்கையாளர் செய்திகளைத் தவறவிடுவதைத் தவிர்க்கும் வழியைப் பற்றி உங்களுக்கு விளக்குவோம்.*


உங்கள் வணிகம் தனித்து நிற்க சிறந்த வழிகளில் ஒன்று சிறந்த வாடிக்கையாளர் சேவையை வழங்குவதாகும், இதில் ஏற்கனவே உள்ள மற்றும் வருங்கால வாடிக்கையாளர்களுக்கு அவர்கள் உதவி தேவைப்படும் போதெல்லாம் கிடைப்பது மற்றும் உங்கள் வணிகம் பற்றிய புதுப்பித்த தகவல்களை வழங்குவது ஆகியவை அடங்கும். சிறந்த வாடிக்கையாளர் சேவை என்பது அதிக வாடிக்கையாளர் திருப்தி, சிறந்த நற்பெயர் மற்றும் அதிக வருங்கால வாடிக்கையாளர்கள் என்று பொருள். இந்தக் கட்டுரையில், Google Business Profile மற்றும் அதன் அரட்டை அம்சத்தைப் பற்றி உங்களுக்கு விளக்குவோம், இது வாடிக்கையாளர் உறவுகளை உருவாக்க உதவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="Google Maps இல் தோன்றும் வணிகப் பட்டியலின் எடுத்துக்காட்டு"/>

*Google Maps இல் தோன்றும் வணிகப் பட்டியலின் எடுத்துக்காட்டு.*
</center>

Google Business Profile என்பது வணிகங்களுக்கு ஒரு இலவச வணிக சுயவிவரம் அல்லது பட்டியலை உருவாக்க உதவும் ஒரு கருவியாகும், இது Google Search மற்றும் Google Maps போன்ற Google சேவைகளில் தோன்றும். [Google இல் உங்கள் வணிக சுயவிவரத்தை எவ்வாறு சேர்ப்பது அல்லது உரிமை கோருவது](https://support.google.com/business/answer/2911778?hl=en&co=GENIE.Platform%3DDesktop) என்பது பற்றிய Google இன் ஆதாரங்களைப் பார்க்கலாம். Google Business Profile பட்டியலை வைத்திருப்பதன் நன்மை:

- Google Search மற்றும் Google Maps மூலம் வாடிக்கையாளர்களை ஈர்க்கவும் மற்றும் அதிக தெரிவுநிலையைப் பெறவும்
- வணிக நேரம் மற்றும் பண்புக்கூறுகள் போன்ற உங்கள் வணிகம் பற்றிய புதுப்பித்த தகவல்களை வழங்கவும்
- நட்சத்திர மதிப்பீடு மற்றும் மதிப்புரைகள் மூலம் நற்பெயரை உருவாக்கவும்
- Google சேவைகள் முழுவதும் உங்கள் தேடல் செயல்திறன் பற்றிய நுண்ணறிவுகளைப் பெறவும்

இருப்பினும், வாடிக்கையாளர்களின் எப்போதும் வளர்ந்து வரும் தேவைகளைப் பூர்த்தி செய்ய Google Business Profile ஐ உருவாக்குவது மட்டும் போதாது. உங்கள் Google Business Profile பட்டியலை மேம்படுத்த, உங்கள் Google Business Profile இன் அரட்டை அம்சத்தையும் நீங்கள் செயல்படுத்தலாம், இது உங்கள் Google Business Profile பட்டியலிலிருந்து நேரடியாக உங்கள் வாடிக்கையாளர்களுக்கு அணுகக்கூடிய ஒரு இலவச சேவையாகும். [61% வாடிக்கையாளர்கள் நிகழ்நேர தொடர்பு கொண்ட பிற வணிகங்களுக்கு நண்பர்களை பரிந்துரைப்பார்கள்](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software) என்பது உங்களுக்குத் தெரியுமா?


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="Google Maps பயன்பாட்டிலிருந்து ஒரு வணிகப் பட்டியலில் அரட்டை அம்சம் எப்படி இருக்கும்"/>

*Google Maps பயன்பாட்டிலிருந்து ஒரு வணிகப் பட்டியலில் அரட்டை அம்சம் எப்படி இருக்கும்.*
</center>

அதனால்தான் அரட்டை அம்சம் வாடிக்கையாளர்களுக்குக் கிடைக்க ஒரு சிறந்த வழி என்று நாங்கள் நினைக்கிறோம். உங்கள் வணிகத்திற்கான அரட்டை அம்சத்தை இயக்குவதன் மூலம், உங்கள் வாடிக்கையாளர்கள் விரும்பும் நிகழ்நேர தொடர்புகளை நீங்கள் வழங்க முடியும். [அரட்டை அம்சம் எவ்வாறு செயல்படுகிறது](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=) என்பது பற்றிய Google இன் ஆதாரங்களைப் பார்க்கலாம். கீழே உள்ள 3 எளிய படிகளில் உங்கள் அரட்டை அம்சத்தை நீங்கள் செயல்படுத்தலாம்:

### படி 1. உங்கள் Google Business Profile கணக்கில் உள்நுழையவும்.

[Google Business Profile முகப்புப் பக்கத்தைப்](https://www.google.com/business/) பார்வையிடவும், மேலும் உங்கள் வணிகப் பட்டியலில் உள்நுழையவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="ஒரு வணிக உரிமையாளர் உள்நுழைந்தவுடன் Google Business Profile பக்கம்"/>

*ஒரு வணிக உரிமையாளர் உள்நுழைந்தவுடன் Google Business Profile பக்கம்.*
</center>

### படி 2. செய்திகள் தாவலுக்குச் செல்லவும்.

அடுத்த படி, பக்கத்தின் இடது பக்கத்தில் உள்ள *"செய்திகள்"* தாவலைக் கிளிக் செய்யவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Google Business Profile இல் உள்ள செய்திகள் தாவலின் இடைமுகம்"/>

*செய்திகள் தாவலின் இடைமுகம்.*
</center>

### படி 3. உங்கள் பட்டியலில் ‘அரட்டை’ அம்சத்தை செயல்படுத்தவும்.

கீழே காட்டப்பட்டுள்ளபடி *"அரட்டையை இயக்கவும்"* பொத்தானைக் கிளிக் செய்யவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "அரட்டையை இயக்கு பொத்தானைக் கிளிக் செய்வதன் மூலம் அரட்டை அம்சம் செயல்படுத்தப்படும்"/>

*அரட்டையை இயக்கு பொத்தானைக் கிளிக் செய்வதன் மூலம் அரட்டை அம்சம் செயல்படுத்தப்படும்.*
</center>

நீங்கள் *"அரட்டையை இயக்கு"* பொத்தானைக் கிளிக் செய்தவுடன், உங்கள் அரட்டை செயல்படுத்தப்பட்டது என்பதை உங்களுக்குத் தெரிவிக்க ஒரு பாப்-அப் தோன்றும். Google உங்கள் புதிதாக செயல்படுத்தப்பட்ட அரட்டை அம்சம் பற்றி உங்களுக்கு ஒரு மின்னஞ்சல் அறிவிப்பையும் அனுப்பும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="Google Business Profile அரட்டை வெற்றிகரமாக செயல்படுத்தப்பட்டதைக் காட்டும் உறுதிப்படுத்தல் செய்தி"/>

*அரட்டை அம்சம் செயல்படுத்தப்பட்டது என்று வணிக உரிமையாளருக்கு அறிவிக்கும் ஒரு பாப்-அப் பக்கம்.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Google Maps இல் புதிதாக செயல்படுத்தப்பட்ட “அரட்டை” அம்சம் பற்றிய Google இலிருந்து மின்னஞ்சல் அறிவிப்பு"/>

*Google இலிருந்து புதிதாக செயல்படுத்தப்பட்ட “அரட்டை” அம்சம் பற்றிய மின்னஞ்சல் அறிவிப்பு.*
</center>


நீங்கள் Google Business Profile Messaging சேவையைச் செயல்படுத்தியவுடன், உங்கள் பட்டியலில் ஒரு அரட்டை பொத்தானைக் காணலாம், மேலும் வாடிக்கையாளர்கள் தங்கள் கேள்விகளுடன் உங்கள் வணிகத்தை அணுக முடியும். இந்த அம்சத்தைப் பயன்படுத்தும் போது, நீங்கள் கேள்விகளுக்குப் பதிலளிக்கக் கிடைக்கும் என்பதை உறுதிப்படுத்த வேண்டும் என்பதை நினைவில் கொள்ளுங்கள். வாடிக்கையாளர்கள் உங்கள் சராசரி பதிலளிப்பு நேரத்தைப் பார்க்கலாம், மேலும் நீண்ட பதிலளிப்பு நேரத்தைக் கண்டால் உங்களைத் தொடர்புகொள்வதில் ஊக்கமடையலாம். உங்கள் வாடிக்கையாளர் செய்திகளுக்கு 24 மணி நேரத்திற்குள் பதிலளிப்பது மிக முக்கியம். Google [Business Profile FAQ பக்கத்தின்](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google) படி, நீங்கள் ஒரு நாளுக்குள் பதிலளிக்கவில்லை என்றால் Google உங்கள் பட்டியலில் உள்ள "அரட்டை" பொத்தானை அகற்றலாம்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="வாடிக்கையாளர்கள் கேள்விகளைத் தட்டச்சு செய்யும்போது Google Maps இல் உள்ள அரட்டை அம்சத்தில் பதிலளிப்பு நேரம் காட்டப்படும்"/>

*வாடிக்கையாளர்கள் கேள்விகளைத் தட்டச்சு செய்யும்போது Google Maps இல் உள்ள அரட்டை அம்சத்தில் பதிலளிப்பு நேரம் காட்டப்படும்.*
</center>

ஆனால் கவலைப்பட வேண்டாம், வாடிக்கையாளர்கள் அரட்டை பொத்தான் மூலம் உங்கள் வணிகத்திற்கு செய்தி அனுப்பும்போது உங்களுக்குத் தெரிவிக்க Google மற்றொரு வழியை வழங்குகிறது. Google தவறவிட்ட செய்திகளுக்கு உங்களுக்கு ஒரு மின்னஞ்சலை அனுப்பும். அல்லது சில வாடிக்கையாளர்களுக்கு நடந்தது போல, தவறவிட்ட செய்திகளின் அறிவிப்புகளைப் பெற நீங்கள் SMS விழிப்பூட்டல்களைச் செயல்படுத்தலாம். இந்தக் கட்டுரையின்படி, SMS விழிப்பூட்டல்கள் Google Business Profile இல் முதன்மை செய்தியிடல் அம்சமாக இருந்தன. இருப்பினும், இந்த அம்சம் மொபைல் பயன்பாடு மற்றும் வலை இடைமுகத்தால் மாற்றப்பட்டது. Google இந்த அம்சத்தை Google Business Profile க்காக மீண்டும் கொண்டு வருகிறது என்று தெரிகிறது. உங்கள் அரட்டை அம்சத்தை நீங்கள் செயல்படுத்தியவுடன், உங்கள் தொலைபேசியில் புதிய SMS விழிப்பூட்டல்கள் அம்சம் பற்றிய அறிவிப்பு தோன்றும் வரை காத்திருக்க பரிந்துரைக்கிறோம். எங்கள் அனுபவத்தில், நாங்கள் நிர்வகிக்கும் 5 வணிகங்களில், 2 வணிகங்கள் மட்டுமே இந்த அம்சம் பற்றிய அறிவிப்பைப் பெற்றன.


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="Google Maps Profile இல் புதிய SMS விழிப்பூட்டல்கள் அம்சம் பற்றிய ஒரு பாப்-அப் அறிவிப்பு"/>

*புதிய SMS விழிப்பூட்டல்கள் அம்சம் பற்றிய ஒரு பாப்-அப் அறிவிப்பு.*
</center>

பின்னர், அறிவிப்புகளைப் பெற நீங்கள் பயன்படுத்த விரும்பும் தொலைபேசி எண்ணை உள்ளிட்டு, *"வாடிக்கையாளர்கள் செய்தி அனுப்பும்போது SMS அறிவிப்புகளைப் பெறுங்கள்."* என்பதை இயக்கவும்.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="Google Business Profile அரட்டை அறிவிப்புகள் எங்கு பெறப்படும் என்பதைக் குறிக்கும் மொபைல் எண் புலம்"/>

*SMS விழிப்பூட்டல்கள் அம்சத்தை இயக்க அறிவிப்பு அமைப்புகள் பக்கம்.*
</center>

Google உங்கள் தொலைபேசி எண்ணுக்கு ஒரு சரிபார்ப்புக் குறியீட்டை அனுப்பும். சரிபார்ப்புக் குறியீட்டை உள்ளிடவும், நீங்கள் தயாராக உள்ளீர்கள்! 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="Google Business Profile அரட்டை தொடர்புகளிலிருந்து உரை அறிவிப்புகளை இயக்க சரிபார்ப்புக் குறியீடு புலம்"/>

*Google உங்கள் தொலைபேசி எண்ணுக்கு அனுப்பிய சரிபார்ப்புக் குறியீட்டை நீங்கள் உள்ளிடக்கூடிய ஒரு பாப்-அப் பக்கம் தோன்றும்.*
</center>

இப்போது உங்கள் பட்டியலில் ஒரு அரட்டை பொத்தானை எவ்வாறு செயல்படுத்துவது மற்றும் அதன் நன்மைகள் உங்களுக்குத் தெரியும், வாடிக்கையாளர் கேள்விகளின் அதிகரித்து வரும் எண்ணிக்கையை உங்கள் வணிகம் எவ்வாறு சமாளிக்கும் என்பதை நீங்கள் எவ்வாறு உறுதிப்படுத்துவீர்கள்? மீண்டும் மீண்டும் வரும் அரட்டைகளுக்கு பதிலளிக்க நிறைய நேரமும் பணமும் தேவை. Google Business Messages பற்றிய எங்கள் அடுத்த இடுகையைப் பாருங்கள், மேலும் சிறந்த வாடிக்கையாளர் சேவையை வழங்குவதில் இது உங்களுக்கு எவ்வாறு நேரத்தையும் பணத்தையும் மிச்சப்படுத்த உதவும்.

[எங்களுடன் ஒரு டெமோவை முன்பதிவு செய்யுங்கள்](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) மற்றும் எங்கள் தயாரிப்பின் இலவச சோதனையைப் பெறும் முதல் நபராக இருங்கள்!
`;export{e as default};
