const n=`---
title: "أصحاب الأعمال: لا تفوتوا رسائل العملاء على خرائط Google!"
metatitle: "لا تفوتوا رسائل العملاء على خرائط Google!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "في هذه المقالة، سنرشدك عبر ملف تعريف نشاطي التجاري على Google، وميزة الدردشة الخاصة به، وطريقة لتجنب تفويت رسائل العملاء."
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*في هذه المقالة، سنرشدك عبر ملف تعريف نشاطي التجاري على Google، وميزة الدردشة الخاصة به، وطريقة لتجنب تفويت رسائل العملاء.*


إحدى أفضل الطرق التي يمكن لعملك أن يبرز بها هي تقديم خدمة عملاء ممتازة، والتي تتضمن توفيرها للعملاء الحاليين والمحتملين كلما احتاجوا إلى المساعدة وتقديم معلومات محدثة حول عملك. تعني خدمة العملاء الممتازة رضا العملاء الأكبر، وسمعة ممتازة، والمزيد من العملاء المحتملين. في هذه المقالة، سنرشدك عبر ملف تعريف نشاطي التجاري على Google وميزة الدردشة الخاصة به التي يمكن أن تساعدك في بناء علاقات مع العملاء.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="مثال على قائمة أعمال تظهر على خرائط Google"/>

*مثال على قائمة أعمال تظهر على خرائط Google.*
</center>

ملف تعريف نشاطي التجاري على Google هو أداة تمكن الشركات من إنشاء ملف تعريف أو قائمة أعمال مجانية ستظهر عبر خدمات Google مثل بحث Google وخرائط Google. يمكنك الرجوع إلى موارد Google حول [كيفية إضافة أو المطالبة بملف تعريف نشاطك التجاري على Google](https://support.google.com/business/answer/2911778?hl=en&co=GENIE.Platform%3DDesktop). تشمل ميزة وجود قائمة ملف تعريف نشاطي التجاري على Google ما يلي:

- جذب العملاء واكتساب المزيد من الظهور من خلال بحث Google وخرائط Google
- توفير معلومات محدثة حول عملك مثل ساعات العمل والسمات
- بناء سمعة من خلال تقييم النجوم والمراجعات
- الحصول على رؤى حول أداء البحث الخاص بك عبر خدمات Google

ومع ذلك، فإن إنشاء ملف تعريف نشاطي التجاري على Google لا يكفي لتلبية متطلبات العملاء المتزايدة باستمرار. لتحسين قائمة ملف تعريف نشاطي التجاري على Google، يمكنك أيضًا تنشيط ميزة الدردشة في ملف تعريف نشاطي التجاري على Google، وهي خدمة مجانية يمكن لعملائك الوصول إليها مباشرة من قائمة ملف تعريف نشاطي التجاري على Google. هل تعلم أن [61% من العملاء سيوصون الأصدقاء بالتحول إلى شركات أخرى ذات اتصال في الوقت الفعلي](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software)؟


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="كيف تبدو ميزة الدردشة في قائمة الأعمال من تطبيق خرائط Google"/>

*كيف تبدو ميزة الدردشة في قائمة الأعمال من تطبيق خرائط Google.*
</center>

لهذا السبب نعتقد أن ميزة الدردشة هي طريقة رائعة لتكون متاحًا للعملاء. من خلال تمكين ميزة الدردشة لعملك، يمكنك توفير اتصال في الوقت الفعلي الذي يرغب فيه عملاؤك. يمكنك الرجوع إلى موارد Google حول [كيف تعمل ميزة الدردشة](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=). يمكنك تنشيط ميزة الدردشة الخاصة بك في 3 خطوات سهلة فقط أدناه:

### الخطوة 1. قم بتسجيل الدخول إلى حساب ملف تعريف نشاطي التجاري على Google الخاص بك.

قم بزيارة [الصفحة الرئيسية لملف تعريف نشاطي التجاري على Google](https://www.google.com/business/)، وقم بتسجيل الدخول إلى قائمة أعمالك.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="صفحة ملف تعريف نشاطي التجاري على Google بمجرد تسجيل دخول صاحب العمل"/>

*صفحة ملف تعريف نشاطي التجاري على Google بمجرد تسجيل دخول صاحب العمل.*
</center>

### الخطوة 2. توجه إلى علامة التبويب "الرسائل".

الخطوة التالية هي النقر على علامة التبويب *"الرسائل"* على الجانب الأيسر من الصفحة.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="واجهة علامة التبويب الرسائل في ملف تعريف نشاطي التجاري على Google"/>

*واجهة علامة التبويب الرسائل.*
</center>

### الخطوة 3. قم بتنشيط ميزة "الدردشة" في قائمتك.

انقر على زر *"تشغيل الدردشة"* كما هو موضح أدناه.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "النقر على زر تشغيل الدردشة سيؤدي إلى تنشيط ميزة الدردشة"/>

*انقر على زر تشغيل الدردشة لتنشيط ميزة الدردشة.*
</center>

بمجرد النقر على زر *"تشغيل الدردشة"*، ستظهر نافذة منبثقة لإعلامك بأنه تم تنشيط الدردشة الخاصة بك. سترسل لك Google أيضًا إشعارًا عبر البريد الإلكتروني حول ميزة الدردشة التي تم تنشيطها حديثًا.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="رسالة تأكيد توضح التنشيط الناجح لدردشة ملف تعريف نشاطي التجاري على Google"/>

*صفحة منبثقة تخبر صاحب العمل بأنه تم تنشيط ميزة الدردشة.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="إشعار بالبريد الإلكتروني من Google حول ميزة "الدردشة" التي تم تنشيطها حديثًا على خرائط Google"/>

*إشعار بالبريد الإلكتروني من Google حول ميزة "الدردشة" التي تم تنشيطها حديثًا.*
</center>


بمجرد تنشيط خدمة رسائل ملف تعريف نشاطي التجاري على Google، يمكنك رؤية زر الدردشة في قائمتك وسيتمكن العملاء من التواصل مع عملك بأي استفسارات قد تكون لديهم. ضع في اعتبارك أنه عند استخدام هذه الميزة، يجب عليك التأكد من أنك ستكون متاحًا للرد على الاستفسارات. يمكن للعملاء رؤية متوسط وقت استجابتك وقد يثبطون عزيمتهم عن الاتصال بك إذا رأوا وقت استجابة أطول. من الأهمية بمكان أن ترد على رسائل عملائك في غضون 24 ساعة. وفقًا لصفحة [الأسئلة الشائعة لملف تعريف نشاطي التجاري على Google](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google)، قد تزيل Google زر "الدردشة" من قائمتك إذا لم ترد في غضون يوم واحد.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="يظهر وقت الاستجابة في ميزة الدردشة على خرائط Google عندما يكون العملاء على وشك كتابة الأسئلة"/>

*يظهر وقت الاستجابة في ميزة الدردشة على خرائط Google
عندما يكون العملاء على وشك كتابة الأسئلة.*
</center>

ولكن لا تقلق، تمنحك Google طريقة أخرى لإعلامك عندما يرسل العملاء رسالة إلى عملك عبر زر الدردشة. سترسل لك Google بريدًا إلكترونيًا للرسائل الفائتة. أو كما حدث لبعض العملاء، يمكنك تنشيط تنبيهات الرسائل القصيرة لتلقي إشعارات بالرسائل الفائتة. وفقًا لهذه المقالة، كانت تنبيهات الرسائل القصيرة هي ميزة المراسلة الأساسية في ملف تعريف نشاطي التجاري على Google. ومع ذلك، تم استبدال هذه الميزة بتطبيق الهاتف المحمول وواجهة الويب. يبدو أن Google تعيد هذه الميزة لملف تعريف نشاطي التجاري على Google. نقترح أنه بمجرد تنشيط ميزة الدردشة الخاصة بك، انتظر إشعارًا حول ميزة تنبيهات الرسائل القصيرة الجديدة لتظهر على هاتفك. في تجربتنا، من بين 5 شركات نديرها، تلقى اثنان فقط إشعارًا حول هذه الميزة.


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="إشعار منبثق حول ميزة تنبيهات الرسائل القصيرة الجديدة في ملف تعريف خرائط Google"/>

*إشعار منبثق حول ميزة تنبيهات الرسائل القصيرة الجديدة.*
</center>

ثم، أدخل رقم الهاتف الذي تريد استخدامه لتلقي الإشعارات وقم بتشغيل *"تلقي إشعارات الرسائل القصيرة عندما يرسل العملاء رسالة."*.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="حقل رقم الهاتف المحمول يشير إلى مكان تلقي إشعارات دردشة ملف تعريف نشاطي التجاري على Google"/>

*صفحة إعدادات الإشعارات لتشغيل ميزة تنبيهات الرسائل القصيرة.*
</center>

سترسل لك Google رمز تحقق إلى رقم هاتفك. أدخل رمز التحقق وأنت جاهز!

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="حقل رمز التحقق لتمكين إشعارات النص من تفاعلات دردشة ملف تعريف نشاطي التجاري على Google"/>

*ستظهر صفحة منبثقة حيث يمكنك إدخال رمز التحقق الذي أرسلته Google إلى رقم هاتفك.*
</center>

الآن بعد أن عرفت كيفية تنشيط زر الدردشة في قائمتك وفوائده، كيف تتأكد من أن عملك يمكنه مواكبة العدد المتزايد من استفسارات العملاء؟ يستغرق الرد على الدردشات المتكررة الكثير من الوقت والمال. تحقق من منشورنا التالي حول رسائل Google Business وكيف يمكن أن يساعدك ذلك في توفير الوقت والمال في تقديم خدمة عملاء ممتازة.

[احجز عرضًا توضيحيًا معنا](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) وكن أول من يتلقى نسخة تجريبية مجانية من منتجنا!
`;export{n as default};
