const e=`---
title: "व्यवसाय के मालिक: Google Maps पर ग्राहकों के संदेशों को न छोड़ें!"
metatitle: "Google Maps पर ग्राहकों के संदेशों को न छोड़ें!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "इस लेख में, हम आपको Google Business Profile, इसकी चैट सुविधा, और ग्राहकों के संदेशों को छूटने से बचने के तरीके के बारे में बताएंगे।"
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*इस लेख में, हम आपको Google Business Profile, इसकी चैट सुविधा, और ग्राहकों के संदेशों को छूटने से बचने के तरीके के बारे में बताएंगे।*


आपके व्यवसाय को अलग दिखाने का एक सबसे अच्छा तरीका उत्कृष्ट ग्राहक सेवा प्रदान करना है, जिसमें मौजूदा और संभावित ग्राहकों के लिए जब भी उन्हें सहायता की आवश्यकता हो, उपलब्ध रहना और आपके व्यवसाय के बारे में अद्यतन जानकारी प्रदान करना शामिल है। उत्कृष्ट ग्राहक सेवा का अर्थ है अधिक ग्राहक संतुष्टि, एक शानदार प्रतिष्ठा, और अधिक संभावित ग्राहक। इस लेख में, हम आपको Google Business Profile और इसकी चैट सुविधा के बारे में बताएंगे जो आपको ग्राहक संबंध बनाने में मदद कर सकती है।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="Google Maps पर दिखाई देने वाली व्यावसायिक सूची का उदाहरण"/>

*Google Maps पर दिखाई देने वाली व्यावसायिक सूची का उदाहरण।*
</center>

Google Business Profile एक ऐसा टूल है जो व्यवसायों को एक मुफ्त व्यावसायिक प्रोफ़ाइल या सूची बनाने में सक्षम बनाता है जो Google Search और Google Maps जैसी Google सेवाओं में दिखाई देगी। आप Google के संसाधनों को [Google पर अपनी व्यावसायिक प्रोफ़ाइल कैसे जोड़ें या दावा करें](https://support.google.com/business/answer/2911778?hl=hi&co=GENIE.Platform%3DDesktop) के बारे में देख सकते हैं। Google Business Profile सूची होने का लाभ इसमें शामिल है:

- Google Search और Google Maps के माध्यम से ग्राहकों को आकर्षित करें और अधिक दृश्यता प्राप्त करें
- अपने व्यवसाय के बारे में अद्यतन जानकारी प्रदान करें जैसे व्यावसायिक घंटे और विशेषताएँ
- स्टार रेटिंग और समीक्षाओं के माध्यम से प्रतिष्ठा बनाएं
- Google सेवाओं में अपने खोज प्रदर्शन के बारे में जानकारी प्राप्त करें

हालांकि, Google Business Profile बनाना ग्राहकों की बढ़ती मांगों को पूरा करने के लिए पर्याप्त नहीं है। अपनी Google Business Profile सूची को अनुकूलित करने के लिए, आप अपनी Google Business Profile की चैट सुविधा को भी सक्रिय कर सकते हैं, जो आपके ग्राहकों के लिए आपकी Google Business Profile सूची से सीधे सुलभ एक मुफ्त सेवा है। क्या आप जानते हैं कि [61% ग्राहक वास्तविक समय संचार वाले अन्य व्यवसायों को दोस्तों को सुझाएंगे](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software)?


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="Google Maps ऐप से व्यावसायिक सूची पर चैट सुविधा कैसी दिखती है"/>

*Google Maps ऐप से व्यावसायिक सूची पर चैट सुविधा कैसी दिखती है।*
</center>

यही कारण है कि हम सोचते हैं कि चैट सुविधा ग्राहकों के लिए उपलब्ध होने का एक शानदार तरीका है। अपने व्यवसाय के लिए चैट सुविधा को सक्षम करके, आप वास्तविक समय संचार प्रदान कर सकते हैं जिसकी आपके ग्राहक इच्छा रखते हैं। आप [चैट सुविधा कैसे काम करती है](https://support.google.com/business/answer/9114771?hl=hi&co=GENIE.Platform%3DAndroid#zippy=) पर Google के संसाधनों को देख सकते हैं। आप नीचे दिए गए केवल 3 आसान चरणों में अपनी चैट सुविधा को सक्रिय कर सकते हैं:

### चरण 1. अपने Google Business Profile खाते में साइन इन करें।

[Google Business Profile होमपेज](https://www.google.com/business/) पर जाएं, और अपनी व्यावसायिक सूची में साइन इन करें।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="व्यवसाय के मालिक के साइन इन करने के बाद Google Business Profile पेज"/>

*व्यवसाय के मालिक के साइन इन करने के बाद Google Business Profile पेज।*
</center>

### चरण 2. मैसेजिंग टैब पर जाएं।

अगला चरण पृष्ठ के बाईं ओर *"संदेश"* टैब पर क्लिक करना है।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="Google Business Profile पर संदेश टैब का इंटरफ़ेस"/>

*संदेश टैब का इंटरफ़ेस।*
</center>

### चरण 3. अपनी सूची में ‘चैट’ सुविधा को सक्रिय करें।

नीचे दिखाए अनुसार *"चैट चालू करें"* बटन पर क्लिक करें।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "चैट चालू करें बटन पर क्लिक करने से चैट सुविधा सक्रिय हो जाएगी"/>

*चैट सुविधा को सक्रिय करने के लिए चैट चालू करें बटन पर क्लिक करें।*
</center>

जैसे ही आप *"चैट चालू करें"* बटन पर क्लिक करते हैं, एक पॉप-अप दिखाई देगा जो आपको सूचित करेगा कि आपकी चैट सक्रिय हो गई है। Google आपको आपकी नई सक्रिय चैट सुविधा के बारे में एक ईमेल सूचना भी भेजेगा।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="Google Business Profile चैट के सफल सक्रियण को दर्शाने वाला पुष्टिकरण संदेश"/>

*एक पॉप-अप पेज जो व्यवसाय के मालिक को सूचित करता है कि चैट सुविधा सक्रिय हो गई है।*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="Google Maps पर नई सक्रिय “चैट” सुविधा के बारे में Google से ईमेल सूचना"/>

*Google से नई सक्रिय “चैट” सुविधा के बारे में ईमेल सूचना।*
</center>


एक बार जब आप Google Business Profile मैसेजिंग सेवा को सक्रिय कर लेते हैं, तो आप अपनी सूची में एक चैट बटन देख सकते हैं और ग्राहक आपके व्यवसाय से किसी भी प्रश्न के साथ संपर्क कर पाएंगे। ध्यान रखें कि जब आप इस सुविधा का उपयोग कर रहे हों, तो आपको यह सुनिश्चित करना होगा कि आप प्रश्नों का जवाब देने के लिए उपलब्ध होंगे। ग्राहक आपके औसत प्रतिक्रिया समय को देख सकते हैं और यदि वे लंबा प्रतिक्रिया समय देखते हैं तो आपसे संपर्क करने से हतोत्साहित हो सकते हैं। यह महत्वपूर्ण है कि आप अपने ग्राहक संदेशों का 24 घंटे के भीतर जवाब दें। Google [Business Profile FAQ पेज](https://support.google.com/business/answer/9114771?hl=hi&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google) के अनुसार, यदि आप एक दिन के भीतर जवाब नहीं देते हैं तो Google आपकी सूची से "चैट" बटन हटा सकता है।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="जब ग्राहक प्रश्न टाइप करने वाले होते हैं तो Google Maps पर चैट सुविधा पर प्रतिक्रिया समय दिखाया जाता है"/>

*जब ग्राहक प्रश्न टाइप करने वाले होते हैं तो Google Maps पर चैट सुविधा पर प्रतिक्रिया समय दिखाया जाता है।*
</center>

लेकिन चिंता न करें, Google आपको सूचित करने का एक और तरीका देता है जब ग्राहक चैट बटन के माध्यम से आपके व्यवसाय को संदेश भेजते हैं। Google आपको छूटे हुए संदेशों के लिए एक ईमेल भेजेगा। या जैसा कि कुछ ग्राहकों के साथ हुआ, आप छूटे हुए संदेशों की सूचनाएं प्राप्त करने के लिए एसएमएस अलर्ट सक्रिय कर सकते हैं। इस लेख के अनुसार, एसएमएस अलर्ट Google Business Profile पर प्राथमिक मैसेजिंग सुविधा हुआ करते थे। हालांकि, इस सुविधा को मोबाइल ऐप और वेब इंटरफ़ेस द्वारा बदल दिया गया था। ऐसा लगता है कि Google Google Business Profile के लिए इस सुविधा को वापस ला रहा है। हम सुझाव देते हैं कि एक बार जब आप अपनी चैट सुविधा को सक्रिय कर लेते हैं, तो अपने फोन पर नई एसएमएस अलर्ट सुविधा के बारे में एक सूचना के पॉप अप होने की प्रतीक्षा करें। हमारे अनुभव में, हमने जिन 5 व्यवसायों का प्रबंधन किया, उनमें से केवल 2 को इस सुविधा के बारे में सूचना मिली।


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="Google Maps Profile पर नई एसएमएस अलर्ट सुविधा के बारे में एक पॉप-अप सूचना"/>

*नई एसएमएस अलर्ट सुविधा के बारे में एक पॉप-अप सूचना।*
</center>

फिर, वह फ़ोन नंबर दर्ज करें जिसका आप सूचनाएं प्राप्त करने के लिए उपयोग करना चाहते हैं और *"जब ग्राहक संदेश भेजें तो एसएमएस सूचनाएं प्राप्त करें।"* चालू करें।

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="मोबाइल नंबर फ़ील्ड यह दर्शाता है कि Google Business Profile चैट सूचनाएं कहाँ प्राप्त होंगी"/>

*एसएमएस अलर्ट सुविधा चालू करने के लिए सूचनाएं सेटिंग पेज।*
</center>

Google आपके फ़ोन नंबर पर एक सत्यापन कोड भेजेगा। सत्यापन कोड दर्ज करें और आप पूरी तरह तैयार हैं! 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="Google Business Profile चैट इंटरैक्शन से टेक्स्ट सूचनाएं सक्षम करने के लिए सत्यापन कोड फ़ील्ड"/>

*एक पॉप-अप पेज दिखाई देगा जहां आप Google द्वारा आपके फ़ोन नंबर पर भेजे गए सत्यापन कोड को दर्ज कर सकते हैं।*
</center>

अब जब आप जानते हैं कि अपनी सूची में चैट बटन को कैसे सक्रिय करें और इसके क्या लाभ हैं, तो आप यह कैसे सुनिश्चित करते हैं कि आपका व्यवसाय ग्राहकों के प्रश्नों की बढ़ती संख्या को बनाए रख सके? दोहराए जाने वाले चैट का जवाब देने में बहुत समय और पैसा लगता है। Google Business Messages पर हमारी अगली पोस्ट देखें और यह आपको उत्कृष्ट ग्राहक सेवा प्रदान करने में समय और पैसा बचाने में कैसे मदद कर सकता है।

[हमारे साथ एक डेमो बुक करें](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) और हमारे उत्पाद का मुफ्त परीक्षण प्राप्त करने वाले पहले व्यक्ति बनें!
`;export{e as default};
