const n=`---
title: "صاحبان کسب‌وکار: پیام‌های مشتریان را در Google Maps از دست ندهید!"
metatitle: "پیام‌های مشتریان را در Google Maps از دست ندهید!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "در این مقاله، ما شما را با نمایه کسب‌وکار Google، ویژگی چت آن و راهی برای جلوگیری از از دست دادن پیام‌های مشتریان آشنا خواهیم کرد."
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*در این مقاله، ما شما را با نمایه کسب‌وکار Google، ویژگی چت آن و راهی برای جلوگیری از از دست دادن پیام‌های مشتریان آشنا خواهیم کرد.*


یکی از بهترین راه‌هایی که کسب‌وکار شما می‌تواند برجسته شود، ارائه خدمات عالی به مشتریان است که شامل در دسترس بودن برای مشتریان فعلی و بالقوه در هر زمان که به کمک نیاز دارند و ارائه اطلاعات به‌روز در مورد کسب‌وکار شما می‌شود. خدمات عالی به مشتریان به معنای رضایت بیشتر مشتری، شهرت عالی و مشتریان بالقوه بیشتر است. در این مقاله، ما شما را با نمایه کسب‌وکار Google و ویژگی چت آن آشنا خواهیم کرد که می‌تواند به شما در ایجاد روابط با مشتریان کمک کند.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="نمونه‌ای از فهرست کسب‌وکار که در Google Maps ظاهر می‌شود"/>

*نمونه‌ای از فهرست کسب‌وکار که در Google Maps ظاهر می‌شود.*
</center>

نمایه کسب‌وکار Google ابزاری است که به کسب‌وکارها امکان می‌دهد یک نمایه یا فهرست کسب‌وکار رایگان ایجاد کنند که در خدمات Google مانند جستجوی Google و Google Maps ظاهر می‌شود. می‌توانید برای کسب اطلاعات بیشتر در مورد [نحوه افزودن یا ادعای نمایه کسب‌وکار خود در Google](https://support.google.com/business/answer/2911778?hl=fa&co=GENIE.Platform%3DDesktop) به منابع Google مراجعه کنید. مزایای داشتن فهرست نمایه کسب‌وکار Google عبارتند از:

- جذب مشتری و افزایش دید از طریق جستجوی Google و Google Maps
- ارائه اطلاعات به‌روز در مورد کسب‌وکار شما مانند ساعات کاری و ویژگی‌ها
- ایجاد شهرت از طریق رتبه‌بندی ستاره‌ای و نظرات
- کسب بینش در مورد عملکرد جستجوی شما در سراسر خدمات Google

با این حال، ایجاد یک نمایه کسب‌وکار Google برای برآورده کردن خواسته‌های روزافزون مشتریان کافی نیست. برای بهینه‌سازی فهرست نمایه کسب‌وکار Google خود، می‌توانید ویژگی چت نمایه کسب‌وکار Google خود را نیز فعال کنید، یک سرویس رایگان که مستقیماً از فهرست نمایه کسب‌وکار Google شما برای مشتریان شما قابل دسترسی است. آیا می‌دانستید که [61% از مشتریان به دوستان خود توصیه می‌کنند که به کسب‌وکارهای دیگری با ارتباط بلادرنگ مراجعه کنند](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software)؟


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="نحوه نمایش ویژگی چت در فهرست کسب‌وکار از برنامه Google Maps"/>

*نحوه نمایش ویژگی چت در فهرست کسب‌وکار از برنامه Google Maps.*
</center>

به همین دلیل است که ما فکر می‌کنیم ویژگی چت راهی عالی برای در دسترس بودن برای مشتریان است. با فعال کردن ویژگی چت برای کسب‌وکار خود، می‌توانید ارتباط بلادرنگی را که مشتریان شما می‌خواهند، فراهم کنید. می‌توانید برای کسب اطلاعات بیشتر در مورد [نحوه عملکرد ویژگی چت](https://support.google.com/business/answer/9114771?hl=fa&co=GENIE.Platform%3DAndroid#zippy=) به منابع Google مراجعه کنید. می‌توانید ویژگی چت خود را تنها در 3 مرحله آسان زیر فعال کنید:

### مرحله 1. وارد حساب نمایه کسب‌وکار Google خود شوید.

از [صفحه اصلی نمایه کسب‌وکار Google](https://www.google.com/business/) بازدید کنید و وارد فهرست کسب‌وکار خود شوید.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="صفحه نمایه کسب‌وکار Google پس از ورود صاحب کسب‌وکار"/>

*صفحه نمایه کسب‌وکار Google پس از ورود صاحب کسب‌وکار.*
</center>

### مرحله 2. به تب پیام‌ها بروید.

مرحله بعدی، کلیک بر روی تب *«پیام‌ها»* در سمت چپ صفحه است.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="رابط کاربری تب پیام‌ها در نمایه کسب‌وکار Google"/>

*رابط کاربری تب پیام‌ها.*
</center>

### مرحله 3. ویژگی «چت» را در فهرست خود فعال کنید.

روی دکمه *«روشن کردن چت»* که در زیر نشان داده شده است، کلیک کنید.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "با کلیک بر روی دکمه روشن کردن چت، ویژگی چت فعال می‌شود"/>

*روی دکمه روشن کردن چت کلیک کنید تا ویژگی چت فعال شود.*
</center>

به محض اینکه روی دکمه *«روشن کردن چت»* کلیک کنید، یک پنجره بازشو ظاهر می‌شود تا به شما اطلاع دهد که چت شما فعال شده است. Google همچنین یک اعلان ایمیلی در مورد ویژگی چت تازه فعال شده شما برای شما ارسال خواهد کرد.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="پیام تأیید نشان‌دهنده فعال‌سازی موفقیت‌آمیز چت نمایه کسب‌وکار Google"/>

*یک صفحه بازشو که به صاحب کسب‌وکار اطلاع می‌دهد که ویژگی چت فعال شده است.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="اعلان ایمیلی از Google در مورد ویژگی «چت» تازه فعال شده در Google Maps"/>

*اعلان ایمیلی از Google در مورد ویژگی «چت» تازه فعال شده.*
</center>


هنگامی که سرویس پیام‌رسانی نمایه کسب‌وکار Google را فعال می‌کنید، می‌توانید دکمه چت را در فهرست خود مشاهده کنید و مشتریان می‌توانند با کسب‌وکار شما برای هرگونه پرسش احتمالی تماس بگیرند. به خاطر داشته باشید که هنگام استفاده از این ویژگی، باید اطمینان حاصل کنید که برای پاسخگویی به پرسش‌ها در دسترس خواهید بود. مشتریان می‌توانند میانگین زمان پاسخگویی شما را مشاهده کنند و اگر زمان پاسخگویی طولانی‌تری را مشاهده کنند، ممکن است از تماس با شما منصرف شوند. بسیار مهم است که در عرض 24 ساعت به پیام‌های مشتریان خود پاسخ دهید. طبق [صفحه پرسش‌های متداول نمایه کسب‌وکار Google](https://support.google.com/business/answer/9114771?hl=fa&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google)، اگر در عرض یک روز پاسخ ندهید، Google ممکن است دکمه «چت» را از فهرست شما حذف کند.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="زمان پاسخگویی در ویژگی چت در Google Maps هنگام تایپ سوالات توسط مشتریان نمایش داده می‌شود"/>

*زمان پاسخگویی در ویژگی چت در Google Maps
هنگام تایپ سوالات توسط مشتریان نمایش داده می‌شود.*
</center>

اما نگران نباشید، Google راه دیگری برای اطلاع‌رسانی به شما در مورد پیام‌های مشتریان از طریق دکمه چت ارائه می‌دهد. Google برای پیام‌های از دست رفته برای شما ایمیل ارسال می‌کند. یا همانطور که برای برخی از مشتریان اتفاق افتاد، می‌توانید هشدارهای پیامکی را فعال کنید تا اعلان‌های پیام‌های از دست رفته را دریافت کنید. طبق این مقاله، هشدارهای پیامکی قبلاً ویژگی اصلی پیام‌رسانی در نمایه کسب‌وکار Google بودند. با این حال، این ویژگی با برنامه تلفن همراه و رابط وب جایگزین شد. به نظر می‌رسد Google در حال بازگرداندن این ویژگی برای نمایه کسب‌وکار Google است. ما پیشنهاد می‌کنیم که پس از فعال کردن ویژگی چت خود، منتظر اعلان مربوط به ویژگی هشدارهای پیامکی جدید باشید تا در تلفن شما ظاهر شود. در تجربه ما، از 5 کسب‌وکاری که مدیریت می‌کنیم، تنها 2 مورد اعلان مربوط به این ویژگی را دریافت کردند.


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="یک اعلان بازشو در مورد ویژگی هشدارهای پیامکی جدید در نمایه Google Maps"/>

*یک اعلان بازشو در مورد ویژگی هشدارهای پیامکی جدید.*
</center>

سپس، شماره تلفنی را که می‌خواهید برای دریافت اعلان‌ها استفاده کنید، وارد کرده و *«دریافت اعلان‌های پیامکی هنگام ارسال پیام توسط مشتریان»* را روشن کنید.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="فیلد شماره موبایل که نشان می‌دهد اعلان‌های چت نمایه کسب‌وکار Google در کجا دریافت می‌شوند"/>

*صفحه تنظیمات اعلان‌ها برای روشن کردن ویژگی هشدارهای پیامکی.*
</center>

Google یک کد تأیید به شماره تلفن شما ارسال خواهد کرد. کد تأیید را وارد کنید و همه چیز آماده است! 

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="فیلد کد تأیید برای فعال کردن اعلان‌های متنی از تعاملات چت نمایه کسب‌وکار Google"/>

*یک صفحه بازشو ظاهر می‌شود که در آن می‌توانید کد تأیید ارسال شده توسط Google به شماره تلفن خود را وارد کنید.*
</center>

اکنون که می‌دانید چگونه دکمه چت را در فهرست خود فعال کنید و مزایای آن چیست، چگونه مطمئن می‌شوید که کسب‌وکار شما می‌تواند با تعداد فزاینده پرسش‌های مشتریان همگام شود؟ پاسخ دادن به چت‌های تکراری زمان و هزینه زیادی می‌برد. پست بعدی ما را در مورد پیام‌های کسب‌وکار Google و اینکه چگونه می‌تواند به شما در صرفه‌جویی در زمان و هزینه در ارائه خدمات عالی به مشتریان کمک کند، بررسی کنید.

[یک دمو با ما رزرو کنید](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) و اولین نفری باشید که یک آزمایش رایگان از محصول ما دریافت می‌کنید!
`;export{n as default};
