const e=`---
title: "เจ้าของธุรกิจ: อย่าพลาดข้อความจากลูกค้าบน Google Maps!"
metatitle: "อย่าพลาดข้อความจากลูกค้าบน Google Maps!"
date: 2022-03-23 11:25:33-07:00
modified_date: 2025-07-29 20:45:17+00:00
draft: false
author: Ruli Setiawati
description: "ในบทความนี้ เราจะแนะนำคุณเกี่ยวกับ Google Business Profile คุณสมบัติการแชท และวิธีหลีกเลี่ยงการพลาดข้อความจากลูกค้า"
weight: 1
tags:
  - NearMe
image: images/blog/9-enable-chat-on-Google-Maps/chat_activated_thumbnail.png
canonicalURL: /blog/enable-chat-on-google-maps/
url: /blog/enable-chat-on-google-maps/
---

*ในบทความนี้ เราจะแนะนำคุณเกี่ยวกับ Google Business Profile คุณสมบัติการแชท และวิธีหลีกเลี่ยงการพลาดข้อความจากลูกค้า*


หนึ่งในวิธีที่ดีที่สุดที่ธุรกิจของคุณจะโดดเด่นคือการให้บริการลูกค้าที่เป็นเลิศ ซึ่งรวมถึงการพร้อมให้บริการลูกค้าปัจจุบันและลูกค้าเป้าหมายเมื่อใดก็ตามที่พวกเขาต้องการความช่วยเหลือ และการให้ข้อมูลล่าสุดเกี่ยวกับธุรกิจของคุณ การบริการลูกค้าที่เป็นเลิศหมายถึงความพึงพอใจของลูกค้าที่มากขึ้น ชื่อเสียงที่โดดเด่น และลูกค้าที่มีศักยภาพมากขึ้น ในบทความนี้ เราจะแนะนำคุณเกี่ยวกับ Google Business Profile และคุณสมบัติการแชทที่สามารถช่วยคุณสร้างความสัมพันธ์กับลูกค้าได้

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/andante.png" alt="ตัวอย่างรายชื่อธุรกิจที่ปรากฏบน Google Maps"/>

*ตัวอย่างรายชื่อธุรกิจที่ปรากฏบน Google Maps.*
</center>

Google Business Profile เป็นเครื่องมือที่ช่วยให้ธุรกิจสามารถสร้างโปรไฟล์ธุรกิจหรือรายชื่อฟรีที่จะปรากฏในบริการต่างๆ ของ Google เช่น Google Search และ Google Maps คุณสามารถอ้างอิงแหล่งข้อมูลของ Google เกี่ยวกับ [วิธีเพิ่มหรือยืนยัน Business Profile ของคุณบน Google](https://support.google.com/business/answer/2911778?hl=en&co=GENIE.Platform%3DDesktop) ข้อดีของการมีรายชื่อ Google Business Profile ได้แก่:

- ดึงดูดลูกค้าและเพิ่มการมองเห็นผ่าน Google Search และ Google Maps
- ให้ข้อมูลล่าสุดเกี่ยวกับธุรกิจของคุณ เช่น เวลาทำการและคุณสมบัติ
- สร้างชื่อเสียงผ่านการให้คะแนนดาวและรีวิว
- รับข้อมูลเชิงลึกเกี่ยวกับประสิทธิภาพการค้นหาของคุณในบริการต่างๆ ของ Google

อย่างไรก็ตาม การสร้าง Google Business Profile เพียงอย่างเดียวไม่เพียงพอที่จะตอบสนองความต้องการของลูกค้าที่เพิ่มขึ้นเรื่อยๆ เพื่อเพิ่มประสิทธิภาพรายชื่อ Google Business Profile ของคุณ คุณยังสามารถเปิดใช้งานคุณสมบัติการแชทของ Google Business Profile ซึ่งเป็นบริการฟรีที่ลูกค้าของคุณสามารถเข้าถึงได้โดยตรงจากรายชื่อ Google Business Profile ของคุณ คุณรู้หรือไม่ว่า [61% ของลูกค้าจะแนะนำเพื่อนให้หันไปหาธุรกิจอื่นที่มีการสื่อสารแบบเรียลไทม์](https://blog.avochato.com/index.php/2019/12/12/business-to-customer-communication-text-message-software)?


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_on_gmaps.png" alt="ลักษณะของฟีเจอร์แชทในรายชื่อธุรกิจจากแอป Google Maps"/>

*ลักษณะของฟีเจอร์แชทในรายชื่อธุรกิจจากแอป Google Maps.*
</center>

นั่นคือเหตุผลที่เราคิดว่าคุณสมบัติการแชทเป็นวิธีที่ยอดเยี่ยมในการพร้อมให้บริการลูกค้า ด้วยการเปิดใช้งานคุณสมบัติการแชทสำหรับธุรกิจของคุณ คุณสามารถให้การสื่อสารแบบเรียลไทม์ที่ลูกค้าของคุณต้องการได้ คุณสามารถอ้างอิงแหล่งข้อมูลของ Google เกี่ยวกับ [วิธีการทำงานของคุณสมบัติการแชท](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=) คุณสามารถเปิดใช้งานคุณสมบัติการแชทของคุณได้ใน 3 ขั้นตอนง่ายๆ ด้านล่างนี้:

### ขั้นตอนที่ 1. ลงชื่อเข้าใช้บัญชี Google Business Profile ของคุณ

เยี่ยมชม [หน้าแรกของ Google Business Profile](https://www.google.com/business/) และลงชื่อเข้าใช้รายชื่อธุรกิจของคุณ

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/GBP_manager_interface.png" alt="หน้า Google Business Profile เมื่อเจ้าของธุรกิจลงชื่อเข้าใช้"/>

*หน้า Google Business Profile เมื่อเจ้าของธุรกิจลงชื่อเข้าใช้.*
</center>

### ขั้นตอนที่ 2. ไปที่แท็บข้อความ

ขั้นตอนต่อไปคือการคลิกแท็บ *"ข้อความ"* ทางด้านซ้ายของหน้า

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/messages_tab.png" alt="อินเทอร์เฟซของแท็บข้อความใน Google Business Profile"/>

*อินเทอร์เฟซของแท็บข้อความ.*
</center>

### ขั้นตอนที่ 3. เปิดใช้งานคุณสมบัติ ‘แชท’ ในรายชื่อของคุณ

คลิกปุ่ม *"เปิดแชท"* ตามที่แสดงด้านล่าง

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/turn_on_chat.png" alt= "การคลิกปุ่มเปิดแชทจะเปิดใช้งานคุณสมบัติแชท"/>

*คลิกปุ่มเปิดแชทเพื่อเปิดใช้งานคุณสมบัติแชท.*
</center>

ทันทีที่คุณคลิกปุ่ม *"เปิดแชท"* หน้าต่างป๊อปอัปจะปรากฏขึ้นเพื่อแจ้งให้คุณทราบว่าแชทของคุณเปิดใช้งานแล้ว Google จะส่งการแจ้งเตือนทางอีเมลเกี่ยวกับคุณสมบัติการแชทที่เปิดใช้งานใหม่ของคุณด้วย

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/chat_activated.png" alt="ข้อความยืนยันที่แสดงการเปิดใช้งานแชท Google Business Profile สำเร็จ"/>

*หน้าป๊อปอัปที่แจ้งให้เจ้าของธุรกิจทราบว่าคุณสมบัติการแชทเปิดใช้งานแล้ว.*
</center>


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/email_notifications.png" alt="การแจ้งเตือนทางอีเมลจาก Google เกี่ยวกับคุณสมบัติ “แชท” ที่เปิดใช้งานใหม่บน Google Maps"/>

*การแจ้งเตือนทางอีเมลจาก Google เกี่ยวกับคุณสมบัติ “แชท” ที่เปิดใช้งานใหม่.*
</center>


เมื่อคุณเปิดใช้งานบริการ Google Business Profile Messaging คุณจะเห็นปุ่มแชทในรายชื่อของคุณ และลูกค้าจะสามารถติดต่อธุรกิจของคุณพร้อมข้อสงสัยใดๆ ที่อาจมี โปรดจำไว้ว่าเมื่อคุณใช้คุณสมบัตินี้ คุณต้องแน่ใจว่าคุณจะพร้อมตอบคำถาม ลูกค้าสามารถดูเวลาตอบกลับเฉลี่ยของคุณ และอาจท้อใจที่จะติดต่อคุณหากพวกเขาเห็นเวลาตอบกลับที่นานขึ้น สิ่งสำคัญคือคุณต้องตอบกลับข้อความของลูกค้าภายใน 24 ชั่วโมง ตาม [หน้าคำถามที่พบบ่อยของ Google Business Profile](https://support.google.com/business/answer/9114771?hl=en&co=GENIE.Platform%3DAndroid#zippy=%2Chow-do-i-keep-the-chat-button-active-on-google) Google อาจลบปุ่ม "แชท" ในรายชื่อของคุณ หากคุณไม่ตอบกลับภายในหนึ่งวัน

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/response_time.png" alt="เวลาตอบกลับจะแสดงในคุณสมบัติแชทบน Google Maps เมื่อลูกค้ากำลังจะพิมพ์คำถาม"/>

*เวลาตอบกลับจะแสดงในคุณสมบัติแชทบน Google Maps
เมื่อลูกค้ากำลังจะพิมพ์คำถาม.*
</center>

แต่ไม่ต้องกังวล Google มีอีกวิธีหนึ่งในการแจ้งให้คุณทราบเมื่อลูกค้าส่งข้อความถึงธุรกิจของคุณผ่านปุ่มแชท Google จะส่งอีเมลถึงคุณสำหรับข้อความที่พลาดไป หรืออย่างที่เกิดขึ้นกับลูกค้าบางราย คุณสามารถเปิดใช้งานการแจ้งเตือนทาง SMS เพื่อรับการแจ้งเตือนข้อความที่พลาดไปได้ ตามบทความนี้ การแจ้งเตือนทาง SMS เคยเป็นคุณสมบัติการส่งข้อความหลักใน Google Business Profile อย่างไรก็ตาม คุณสมบัตินี้ถูกแทนที่ด้วยแอปพลิเคชันมือถือและอินเทอร์เฟซเว็บ ดูเหมือนว่า Google กำลังนำคุณสมบัตินี้กลับมาสำหรับ Google Business Profile เราขอแนะนำว่าเมื่อคุณเปิดใช้งานคุณสมบัติการแชทแล้ว ให้รอการแจ้งเตือนเกี่ยวกับคุณสมบัติการแจ้งเตือนทาง SMS ใหม่ที่จะปรากฏบนโทรศัพท์ของคุณ จากประสบการณ์ของเรา จาก 5 ธุรกิจที่เราจัดการ มีเพียง 2 แห่งเท่านั้นที่ได้รับการแจ้งเตือนเกี่ยวกับคุณสมบัตินี้


<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/pop_up_sms_notif.png" alt="การแจ้งเตือนแบบป๊อปอัปเกี่ยวกับคุณสมบัติการแจ้งเตือนทาง SMS ใหม่ใน Google Maps Profile"/>

*การแจ้งเตือนแบบป๊อปอัปเกี่ยวกับคุณสมบัติการแจ้งเตือนทาง SMS ใหม่.*
</center>

จากนั้น ป้อนหมายเลขโทรศัพท์ที่คุณต้องการใช้เพื่อรับการแจ้งเตือน และเปิด *"รับการแจ้งเตือนทาง SMS เมื่อลูกค้าส่งข้อความ"*.

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/phone_number_sms_notif.png" alt="ช่องหมายเลขโทรศัพท์มือถือที่ระบุว่าจะรับการแจ้งเตือนการแชทของ Google Business Profile ได้ที่ใด"/>

*หน้าการตั้งค่าการแจ้งเตือนเพื่อเปิดใช้งานคุณสมบัติการแจ้งเตือนทาง SMS.*
</center>

Google จะส่งรหัสยืนยันไปยังหมายเลขโทรศัพท์ของคุณ ป้อนรหัสยืนยันและคุณก็พร้อมแล้ว!

<center>
<img src="/images/blog/9-enable-chat-on-Google-Maps/verification_code.png" alt="ช่องรหัสยืนยันเพื่อเปิดใช้งานการแจ้งเตือนข้อความจากการโต้ตอบการแชทของ Google Business Profile"/>

*หน้าป๊อปอัปจะปรากฏขึ้น ซึ่งคุณสามารถป้อนรหัสยืนยันที่ Google ส่งไปยังหมายเลขโทรศัพท์ของคุณได้.*
</center>

ตอนนี้คุณรู้วิธีเปิดใช้งานปุ่มแชทในรายชื่อของคุณและประโยชน์ของมันแล้ว คุณจะแน่ใจได้อย่างไรว่าธุรกิจของคุณสามารถติดตามจำนวนคำถามของลูกค้าที่เพิ่มขึ้นได้? การตอบกลับแชทที่ซ้ำซ้อนต้องใช้เวลาและเงินเป็นจำนวนมาก ตรวจสอบโพสต์ถัดไปของเราเกี่ยวกับ Google Business Messages และวิธีที่สิ่งนี้สามารถช่วยคุณประหยัดเวลาและเงินในการให้บริการลูกค้าที่เป็นเลิศ

[จองการสาธิตกับเรา](https://meetings.hubspot.com/seasalt-ai/seasalt-meeting) และเป็นคนแรกที่ได้รับทดลองใช้ผลิตภัณฑ์ของเราฟรี!
`;export{e as default};
